#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CinematicCharacter

#include "Basic.hpp"

#include "SQRoleVersion_structs.hpp"
#include "Engine_structs.hpp"
#include "Squad_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_CinematicCharacter.BP_CinematicCharacter_C.ExecuteUbergraph_BP_CinematicCharacter
// 0x0750 (0x0750 - 0x0000)
struct BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_NewParam;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x001C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x00C8(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class ABP_MutableSoldier_C*                   K2Node_DynamicCast_AsBP_Mutable_Soldier;           // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15A[0x2];                                      // 0x015A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0xC];                                      // 0x0184(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0190(0x0030)(IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x01C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x01CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x01D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x01E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0220(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x023C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ABP_MutableSoldier_C*                   K2Node_DynamicCast_AsBP_Mutable_Soldier_1;         // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0258(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         Temp_object_Variable_1;                            // 0x0268(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0278(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0284(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0290(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x029C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0324(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0325(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0326(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_327[0x1];                                      // 0x0327(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0330(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x033C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0348(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0354(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0370(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x038C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0398(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x03A4(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x042C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42D[0x3];                                      // 0x042D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_Damage;                               // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_434[0x4];                                      // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UDamageType*                      K2Node_Event_DamageType;                           // 0x0438(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            K2Node_Event_InstigatedBy;                         // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue_1;         // 0x0450(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0480(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x048C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0498(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x04A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x04B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x04BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_MyComp;                               // 0x04C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Other;                                // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x04D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelfMoved;                           // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E1[0x3];                                      // 0x04E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_Event_HitLocation;                          // 0x04E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitNormal;                            // 0x04F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_NormalImpulse;                        // 0x04FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0508(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit_1;                 // 0x0590(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue_1;            // 0x0618(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_619[0x3];                                      // 0x0619(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_1;     // 0x061C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x06A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x06A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A6[0x2];                                      // 0x06A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x06A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x06AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x06B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x06BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x06C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x06D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x06E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x06E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x06F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x06F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0700(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x0704(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0708(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x070C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x0718(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_724[0x4];                                      // 0x0724(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Projectile_C*                       K2Node_DynamicCast_AsBP_Projectile;                // 0x0728(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0730(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_731[0x7];                                      // 0x0731(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASQProjectile*                          K2Node_DynamicCast_AsSQProjectile;                 // 0x0738(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0740(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_741[0x7];                                      // 0x0741(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0748(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter) == 0x000010, "Wrong alignment on BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter");
static_assert(sizeof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter) == 0x000750, "Wrong size on BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, EntryPoint) == 0x000000, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, K2Node_CustomEvent_NewParam) == 0x000008, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::K2Node_CustomEvent_NewParam' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x00001C, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x0000A8, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, K2Node_ComponentBoundEvent_OtherActor_1) == 0x0000B0, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, K2Node_ComponentBoundEvent_OtherComp_1) == 0x0000B8, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x0000C0, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, K2Node_ComponentBoundEvent_bFromSweep) == 0x0000C4, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, K2Node_ComponentBoundEvent_SweepResult) == 0x0000C8, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, K2Node_DynamicCast_AsBP_Mutable_Soldier) == 0x000150, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::K2Node_DynamicCast_AsBP_Mutable_Soldier' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, K2Node_DynamicCast_bSuccess) == 0x000158, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_IsValid_ReturnValue) == 0x000159, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00015C, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_Add_VectorVector_ReturnValue) == 0x000168, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, K2Node_Event_DeltaSeconds) == 0x000174, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000178, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_GetSocketTransform_ReturnValue) == 0x000190, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_FindLookAtRotation_ReturnValue) == 0x0001C0, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_BreakTransform_Location) == 0x0001CC, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_BreakTransform_Rotation) == 0x0001D8, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_BreakTransform_Scale) == 0x0001E4, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_BreakRotator_Roll) == 0x0001F0, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_BreakRotator_Pitch) == 0x0001F4, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_BreakRotator_Yaw) == 0x0001F8, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_BreakRotator_Roll_1) == 0x0001FC, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_BreakRotator_Pitch_1) == 0x000200, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_BreakRotator_Yaw_1) == 0x000204, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_Add_FloatFloat_ReturnValue) == 0x000208, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x00020C, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000210, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x000214, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000218, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_FClamp_ReturnValue) == 0x00021C, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000220, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, K2Node_ComponentBoundEvent_OtherActor) == 0x000228, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, K2Node_ComponentBoundEvent_OtherComp) == 0x000230, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000238, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_MakeRotator_ReturnValue) == 0x00023C, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, K2Node_DynamicCast_AsBP_Mutable_Soldier_1) == 0x000248, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::K2Node_DynamicCast_AsBP_Mutable_Soldier_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, K2Node_DynamicCast_bSuccess_1) == 0x000250, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, Temp_object_Variable) == 0x000258, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, Temp_object_Variable_1) == 0x000268, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000278, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000284, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000290, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_LineTraceSingle_OutHit) == 0x00029C, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_LineTraceSingle_ReturnValue) == 0x000324, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_BreakHitResult_bBlockingHit) == 0x000325, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_BreakHitResult_bInitialOverlap) == 0x000326, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_BreakHitResult_Time) == 0x000328, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_BreakHitResult_Distance) == 0x00032C, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_BreakHitResult_Location) == 0x000330, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_BreakHitResult_ImpactPoint) == 0x00033C, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_BreakHitResult_Normal) == 0x000348, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_BreakHitResult_ImpactNormal) == 0x000354, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_BreakHitResult_PhysMat) == 0x000360, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_BreakHitResult_HitActor) == 0x000368, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_BreakHitResult_HitComponent) == 0x000370, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_BreakHitResult_HitBoneName) == 0x000378, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_BreakHitResult_HitItem) == 0x000380, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_BreakHitResult_ElementIndex) == 0x000384, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_BreakHitResult_FaceIndex) == 0x000388, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_BreakHitResult_TraceStart) == 0x00038C, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_BreakHitResult_TraceEnd) == 0x000398, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x0003A4, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_K2_SetActorLocation_ReturnValue) == 0x00042C, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, K2Node_Event_Damage) == 0x000430, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, K2Node_Event_DamageType) == 0x000438, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::K2Node_Event_DamageType' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, K2Node_Event_InstigatedBy) == 0x000440, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::K2Node_Event_InstigatedBy' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, K2Node_Event_DamageCauser) == 0x000448, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_GetSocketTransform_ReturnValue_1) == 0x000450, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_GetSocketTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_BreakTransform_Location_1) == 0x000480, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_BreakTransform_Rotation_1) == 0x00048C, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_BreakTransform_Scale_1) == 0x000498, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_GetForwardVector_ReturnValue) == 0x0004A4, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0004B0, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_Add_VectorVector_ReturnValue_2) == 0x0004BC, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, K2Node_Event_MyComp) == 0x0004C8, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::K2Node_Event_MyComp' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, K2Node_Event_Other) == 0x0004D0, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::K2Node_Event_Other' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, K2Node_Event_OtherComp) == 0x0004D8, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, K2Node_Event_bSelfMoved) == 0x0004E0, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::K2Node_Event_bSelfMoved' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, K2Node_Event_HitLocation) == 0x0004E4, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, K2Node_Event_HitNormal) == 0x0004F0, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::K2Node_Event_HitNormal' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, K2Node_Event_NormalImpulse) == 0x0004FC, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::K2Node_Event_NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, K2Node_Event_Hit) == 0x000508, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_LineTraceSingle_OutHit_1) == 0x000590, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_LineTraceSingle_OutHit_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_LineTraceSingle_ReturnValue_1) == 0x000618, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_LineTraceSingle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_K2_SetWorldLocation_SweepHitResult_1) == 0x00061C, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_K2_SetWorldLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_BreakHitResult_bBlockingHit_1) == 0x0006A4, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x0006A5, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_BreakHitResult_Time_1) == 0x0006A8, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_BreakHitResult_Distance_1) == 0x0006AC, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_BreakHitResult_Location_1) == 0x0006B0, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_BreakHitResult_ImpactPoint_1) == 0x0006BC, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_BreakHitResult_Normal_1) == 0x0006C8, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_BreakHitResult_ImpactNormal_1) == 0x0006D4, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_BreakHitResult_PhysMat_1) == 0x0006E0, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_BreakHitResult_HitActor_1) == 0x0006E8, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_BreakHitResult_HitComponent_1) == 0x0006F0, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_BreakHitResult_HitBoneName_1) == 0x0006F8, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_BreakHitResult_HitItem_1) == 0x000700, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_BreakHitResult_ElementIndex_1) == 0x000704, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_BreakHitResult_FaceIndex_1) == 0x000708, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_BreakHitResult_TraceStart_1) == 0x00070C, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_BreakHitResult_TraceEnd_1) == 0x000718, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, K2Node_DynamicCast_AsBP_Projectile) == 0x000728, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::K2Node_DynamicCast_AsBP_Projectile' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, K2Node_DynamicCast_bSuccess_2) == 0x000730, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, K2Node_DynamicCast_AsSQProjectile) == 0x000738, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::K2Node_DynamicCast_AsSQProjectile' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, K2Node_DynamicCast_bSuccess_3) == 0x000740, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000748, "Member 'BP_CinematicCharacter_C_ExecuteUbergraph_BP_CinematicCharacter::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");

// Function BP_CinematicCharacter.BP_CinematicCharacter_C.ReceiveHit
// 0x00C8 (0x00C8 - 0x0000)
struct BP_CinematicCharacter_C_ReceiveHit final
{
public:
	class UPrimitiveComponent*                    MyComp;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Other;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelfMoved;                                        // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                HitLocation;                                       // 0x001C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0034(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0040(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_CinematicCharacter_C_ReceiveHit) == 0x000008, "Wrong alignment on BP_CinematicCharacter_C_ReceiveHit");
static_assert(sizeof(BP_CinematicCharacter_C_ReceiveHit) == 0x0000C8, "Wrong size on BP_CinematicCharacter_C_ReceiveHit");
static_assert(offsetof(BP_CinematicCharacter_C_ReceiveHit, MyComp) == 0x000000, "Member 'BP_CinematicCharacter_C_ReceiveHit::MyComp' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ReceiveHit, Other) == 0x000008, "Member 'BP_CinematicCharacter_C_ReceiveHit::Other' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ReceiveHit, OtherComp) == 0x000010, "Member 'BP_CinematicCharacter_C_ReceiveHit::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ReceiveHit, bSelfMoved) == 0x000018, "Member 'BP_CinematicCharacter_C_ReceiveHit::bSelfMoved' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ReceiveHit, HitLocation) == 0x00001C, "Member 'BP_CinematicCharacter_C_ReceiveHit::HitLocation' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ReceiveHit, HitNormal) == 0x000028, "Member 'BP_CinematicCharacter_C_ReceiveHit::HitNormal' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ReceiveHit, NormalImpulse) == 0x000034, "Member 'BP_CinematicCharacter_C_ReceiveHit::NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ReceiveHit, Hit) == 0x000040, "Member 'BP_CinematicCharacter_C_ReceiveHit::Hit' has a wrong offset!");

// Function BP_CinematicCharacter.BP_CinematicCharacter_C.ReceiveAnyDamage
// 0x0020 (0x0020 - 0x0000)
struct BP_CinematicCharacter_C_ReceiveAnyDamage final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UDamageType*                      DamageType;                                        // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            InstigatedBy;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CinematicCharacter_C_ReceiveAnyDamage) == 0x000008, "Wrong alignment on BP_CinematicCharacter_C_ReceiveAnyDamage");
static_assert(sizeof(BP_CinematicCharacter_C_ReceiveAnyDamage) == 0x000020, "Wrong size on BP_CinematicCharacter_C_ReceiveAnyDamage");
static_assert(offsetof(BP_CinematicCharacter_C_ReceiveAnyDamage, Damage) == 0x000000, "Member 'BP_CinematicCharacter_C_ReceiveAnyDamage::Damage' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ReceiveAnyDamage, DamageType) == 0x000008, "Member 'BP_CinematicCharacter_C_ReceiveAnyDamage::DamageType' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ReceiveAnyDamage, InstigatedBy) == 0x000010, "Member 'BP_CinematicCharacter_C_ReceiveAnyDamage::InstigatedBy' has a wrong offset!");
static_assert(offsetof(BP_CinematicCharacter_C_ReceiveAnyDamage, DamageCauser) == 0x000018, "Member 'BP_CinematicCharacter_C_ReceiveAnyDamage::DamageCauser' has a wrong offset!");

// Function BP_CinematicCharacter.BP_CinematicCharacter_C.BndEvt__detectionSphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_CinematicCharacter_C_BndEvt__detectionSphere_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
