#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MapMarker_CommandMaster

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_GenericMapMarker_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MapMarker_CommandMaster.BP_MapMarker_CommandMaster_C
// 0x0020 (0x02B0 - 0x0290)
class ABP_MapMarker_CommandMaster_C : public ABP_GenericMapMarker_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_MapMarker_CommandMaster_C;       // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Distance;                                          // 0x0298(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Action;                                            // 0x02A0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Request;                                           // 0x02A8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AddDistance;                                       // 0x02AC(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_MapMarker_CommandMaster(int32 EntryPoint);
	void OnDestroyed_Event_0(class AActor* DestroyedActor);
	void Bind_To_Destroy(class AActor* Bind_To);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MapMarker_CommandMaster_C">();
	}
	static class ABP_MapMarker_CommandMaster_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MapMarker_CommandMaster_C>();
	}
};
static_assert(alignof(ABP_MapMarker_CommandMaster_C) == 0x000008, "Wrong alignment on ABP_MapMarker_CommandMaster_C");
static_assert(sizeof(ABP_MapMarker_CommandMaster_C) == 0x0002B0, "Wrong size on ABP_MapMarker_CommandMaster_C");
static_assert(offsetof(ABP_MapMarker_CommandMaster_C, UberGraphFrame_BP_MapMarker_CommandMaster_C) == 0x000290, "Member 'ABP_MapMarker_CommandMaster_C::UberGraphFrame_BP_MapMarker_CommandMaster_C' has a wrong offset!");
static_assert(offsetof(ABP_MapMarker_CommandMaster_C, Distance) == 0x000298, "Member 'ABP_MapMarker_CommandMaster_C::Distance' has a wrong offset!");
static_assert(offsetof(ABP_MapMarker_CommandMaster_C, Action) == 0x0002A0, "Member 'ABP_MapMarker_CommandMaster_C::Action' has a wrong offset!");
static_assert(offsetof(ABP_MapMarker_CommandMaster_C, Request) == 0x0002A8, "Member 'ABP_MapMarker_CommandMaster_C::Request' has a wrong offset!");
static_assert(offsetof(ABP_MapMarker_CommandMaster_C, AddDistance) == 0x0002AC, "Member 'ABP_MapMarker_CommandMaster_C::AddDistance' has a wrong offset!");

}

