#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_R2T_Soldier

#include "Basic.hpp"

#include "Squad_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_R2T_Soldier.BP_R2T_Soldier_C.ExecuteUbergraph_BP_R2T_Soldier
// 0x0048 (0x0048 - 0x0000)
struct BP_R2T_Soldier_C_ExecuteUbergraph_BP_R2T_Soldier final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage;                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_R2T_Soldier_C_ExecuteUbergraph_BP_R2T_Soldier) == 0x000008, "Wrong alignment on BP_R2T_Soldier_C_ExecuteUbergraph_BP_R2T_Soldier");
static_assert(sizeof(BP_R2T_Soldier_C_ExecuteUbergraph_BP_R2T_Soldier) == 0x000048, "Wrong size on BP_R2T_Soldier_C_ExecuteUbergraph_BP_R2T_Soldier");
static_assert(offsetof(BP_R2T_Soldier_C_ExecuteUbergraph_BP_R2T_Soldier, EntryPoint) == 0x000000, "Member 'BP_R2T_Soldier_C_ExecuteUbergraph_BP_R2T_Soldier::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_ExecuteUbergraph_BP_R2T_Soldier, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_R2T_Soldier_C_ExecuteUbergraph_BP_R2T_Soldier::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_ExecuteUbergraph_BP_R2T_Soldier, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'BP_R2T_Soldier_C_ExecuteUbergraph_BP_R2T_Soldier::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_ExecuteUbergraph_BP_R2T_Soldier, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000018, "Member 'BP_R2T_Soldier_C_ExecuteUbergraph_BP_R2T_Soldier::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_ExecuteUbergraph_BP_R2T_Soldier, Temp_object_Variable) == 0x000020, "Member 'BP_R2T_Soldier_C_ExecuteUbergraph_BP_R2T_Soldier::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_ExecuteUbergraph_BP_R2T_Soldier, CallFunc_Array_Contains_ReturnValue) == 0x000028, "Member 'BP_R2T_Soldier_C_ExecuteUbergraph_BP_R2T_Soldier::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_ExecuteUbergraph_BP_R2T_Soldier, K2Node_DynamicCast_AsAnim_Montage) == 0x000030, "Member 'BP_R2T_Soldier_C_ExecuteUbergraph_BP_R2T_Soldier::K2Node_DynamicCast_AsAnim_Montage' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_ExecuteUbergraph_BP_R2T_Soldier, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_R2T_Soldier_C_ExecuteUbergraph_BP_R2T_Soldier::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_ExecuteUbergraph_BP_R2T_Soldier, K2Node_CustomEvent_Loaded) == 0x000040, "Member 'BP_R2T_Soldier_C_ExecuteUbergraph_BP_R2T_Soldier::K2Node_CustomEvent_Loaded' has a wrong offset!");

// Function BP_R2T_Soldier.BP_R2T_Soldier_C.OnLoaded_B66812B5449CFDA411812989621AA024
// 0x0008 (0x0008 - 0x0000)
struct BP_R2T_Soldier_C_OnLoaded_B66812B5449CFDA411812989621AA024 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_R2T_Soldier_C_OnLoaded_B66812B5449CFDA411812989621AA024) == 0x000008, "Wrong alignment on BP_R2T_Soldier_C_OnLoaded_B66812B5449CFDA411812989621AA024");
static_assert(sizeof(BP_R2T_Soldier_C_OnLoaded_B66812B5449CFDA411812989621AA024) == 0x000008, "Wrong size on BP_R2T_Soldier_C_OnLoaded_B66812B5449CFDA411812989621AA024");
static_assert(offsetof(BP_R2T_Soldier_C_OnLoaded_B66812B5449CFDA411812989621AA024, Loaded) == 0x000000, "Member 'BP_R2T_Soldier_C_OnLoaded_B66812B5449CFDA411812989621AA024::Loaded' has a wrong offset!");

// Function BP_R2T_Soldier.BP_R2T_Soldier_C.UserConstructionScript
// 0x0018 (0x0018 - 0x0000)
struct BP_R2T_Soldier_C_UserConstructionScript final
{
public:
	float                                         Bias;                                              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm)
};
static_assert(alignof(BP_R2T_Soldier_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_R2T_Soldier_C_UserConstructionScript");
static_assert(sizeof(BP_R2T_Soldier_C_UserConstructionScript) == 0x000018, "Wrong size on BP_R2T_Soldier_C_UserConstructionScript");
static_assert(offsetof(BP_R2T_Soldier_C_UserConstructionScript, Bias) == 0x000000, "Member 'BP_R2T_Soldier_C_UserConstructionScript::Bias' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_UserConstructionScript, K2Node_MakeArray_Array) == 0x000008, "Member 'BP_R2T_Soldier_C_UserConstructionScript::K2Node_MakeArray_Array' has a wrong offset!");

// Function BP_R2T_Soldier.BP_R2T_Soldier_C.Set Render Soldier Role
// 0x0048 (0x0048 - 0x0000)
struct BP_R2T_Soldier_C_Set_Render_Soldier_Role final
{
public:
	class USQRoleSettings*                        NewRole;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Force;                                             // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               L_MI_Weap;                                         // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               L_MI_Soldier;                                      // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_SQRoleSettings_C*                   K2Node_DynamicCast_AsBP_SQRole_Settings;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_Get_Role_Info_Soldier_Mesh;               // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_Get_Role_Info_Weapon_Mesh;                // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_R2T_Soldier_C_Set_Render_Soldier_Role) == 0x000008, "Wrong alignment on BP_R2T_Soldier_C_Set_Render_Soldier_Role");
static_assert(sizeof(BP_R2T_Soldier_C_Set_Render_Soldier_Role) == 0x000048, "Wrong size on BP_R2T_Soldier_C_Set_Render_Soldier_Role");
static_assert(offsetof(BP_R2T_Soldier_C_Set_Render_Soldier_Role, NewRole) == 0x000000, "Member 'BP_R2T_Soldier_C_Set_Render_Soldier_Role::NewRole' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Set_Render_Soldier_Role, Force) == 0x000008, "Member 'BP_R2T_Soldier_C_Set_Render_Soldier_Role::Force' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Set_Render_Soldier_Role, L_MI_Weap) == 0x000010, "Member 'BP_R2T_Soldier_C_Set_Render_Soldier_Role::L_MI_Weap' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Set_Render_Soldier_Role, L_MI_Soldier) == 0x000018, "Member 'BP_R2T_Soldier_C_Set_Render_Soldier_Role::L_MI_Soldier' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Set_Render_Soldier_Role, K2Node_DynamicCast_AsBP_SQRole_Settings) == 0x000020, "Member 'BP_R2T_Soldier_C_Set_Render_Soldier_Role::K2Node_DynamicCast_AsBP_SQRole_Settings' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Set_Render_Soldier_Role, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_R2T_Soldier_C_Set_Render_Soldier_Role::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Set_Render_Soldier_Role, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'BP_R2T_Soldier_C_Set_Render_Soldier_Role::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Set_Render_Soldier_Role, CallFunc_K2_AttachToComponent_ReturnValue) == 0x00002A, "Member 'BP_R2T_Soldier_C_Set_Render_Soldier_Role::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Set_Render_Soldier_Role, CallFunc_Get_Role_Info_Soldier_Mesh) == 0x000030, "Member 'BP_R2T_Soldier_C_Set_Render_Soldier_Role::CallFunc_Get_Role_Info_Soldier_Mesh' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Set_Render_Soldier_Role, CallFunc_Get_Role_Info_Weapon_Mesh) == 0x000038, "Member 'BP_R2T_Soldier_C_Set_Render_Soldier_Role::CallFunc_Get_Role_Info_Weapon_Mesh' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Set_Render_Soldier_Role, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'BP_R2T_Soldier_C_Set_Render_Soldier_Role::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Set_Render_Soldier_Role, CallFunc_IsValid_ReturnValue_2) == 0x000041, "Member 'BP_R2T_Soldier_C_Set_Render_Soldier_Role::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Set_Render_Soldier_Role, CallFunc_IsValid_ReturnValue_3) == 0x000042, "Member 'BP_R2T_Soldier_C_Set_Render_Soldier_Role::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Set_Render_Soldier_Role, CallFunc_IsValid_ReturnValue_4) == 0x000043, "Member 'BP_R2T_Soldier_C_Set_Render_Soldier_Role::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Set_Render_Soldier_Role, CallFunc_IsValid_ReturnValue_5) == 0x000044, "Member 'BP_R2T_Soldier_C_Set_Render_Soldier_Role::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Set_Render_Soldier_Role, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000045, "Member 'BP_R2T_Soldier_C_Set_Render_Soldier_Role::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Set_Render_Soldier_Role, CallFunc_BooleanOR_ReturnValue) == 0x000046, "Member 'BP_R2T_Soldier_C_Set_Render_Soldier_Role::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function BP_R2T_Soldier.BP_R2T_Soldier_C.Set Rendering
// 0x0068 (0x0068 - 0x0000)
struct BP_R2T_Soldier_C_Set_Rendering final
{
public:
	bool                                          Active;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMeshComponent*>                 K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UMeshComponent*                         CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             CallFunc_GetMaterials_ReturnValue;                 // 0x0038(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_Array_Get_Item_1;                         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_R2T_Soldier_C_Set_Rendering) == 0x000008, "Wrong alignment on BP_R2T_Soldier_C_Set_Rendering");
static_assert(sizeof(BP_R2T_Soldier_C_Set_Rendering) == 0x000068, "Wrong size on BP_R2T_Soldier_C_Set_Rendering");
static_assert(offsetof(BP_R2T_Soldier_C_Set_Rendering, Active) == 0x000000, "Member 'BP_R2T_Soldier_C_Set_Rendering::Active' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Set_Rendering, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_R2T_Soldier_C_Set_Rendering::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Set_Rendering, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'BP_R2T_Soldier_C_Set_Rendering::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Set_Rendering, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_R2T_Soldier_C_Set_Rendering::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Set_Rendering, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'BP_R2T_Soldier_C_Set_Rendering::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Set_Rendering, Temp_int_Loop_Counter_Variable_1) == 0x000014, "Member 'BP_R2T_Soldier_C_Set_Rendering::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Set_Rendering, CallFunc_Add_IntInt_ReturnValue_1) == 0x000018, "Member 'BP_R2T_Soldier_C_Set_Rendering::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Set_Rendering, K2Node_MakeArray_Array) == 0x000020, "Member 'BP_R2T_Soldier_C_Set_Rendering::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Set_Rendering, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_R2T_Soldier_C_Set_Rendering::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Set_Rendering, CallFunc_GetMaterials_ReturnValue) == 0x000038, "Member 'BP_R2T_Soldier_C_Set_Rendering::CallFunc_GetMaterials_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Set_Rendering, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BP_R2T_Soldier_C_Set_Rendering::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Set_Rendering, CallFunc_Array_Get_Item_1) == 0x000050, "Member 'BP_R2T_Soldier_C_Set_Rendering::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Set_Rendering, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'BP_R2T_Soldier_C_Set_Rendering::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Set_Rendering, CallFunc_Array_Length_ReturnValue_1) == 0x00005C, "Member 'BP_R2T_Soldier_C_Set_Rendering::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Set_Rendering, CallFunc_Less_IntInt_ReturnValue_1) == 0x000060, "Member 'BP_R2T_Soldier_C_Set_Rendering::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Set_Rendering, CallFunc_Not_PreBool_ReturnValue) == 0x000061, "Member 'BP_R2T_Soldier_C_Set_Rendering::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_R2T_Soldier.BP_R2T_Soldier_C.Get Role Info
// 0x00E0 (0x00E0 - 0x0000)
struct BP_R2T_Soldier_C_Get_Role_Info final
{
public:
	class USkeletalMeshComponent*                 Soldier_Mesh;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Weapon_Mesh;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_SQLayer_C*                          CallFunc_TryGetCurrentLayer_OutLayer;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetCurrentLayer_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   CallFunc_TryGetSoldierWithLayer_OutSoldier;        // 0x0020(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetSoldierWithLayer_ReturnValue;       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSQInventoryWeaponGroupData            CallFunc_Array_Get_Item;                           // 0x0050(0x0010)()
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetDefaultObjectFor_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSQInventoryData                       CallFunc_Array_Get_Item_1;                         // 0x0070(0x0038)()
	class ASQSoldier*                             K2Node_DynamicCast_AsSQSoldier;                    // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue_1;    // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetDefaultObjectFor_ReturnValue_1;        // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASQWeapon*                              K2Node_DynamicCast_AsSQWeapon;                     // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 CallFunc_GetMesh_ReturnValue;                      // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_R2T_Soldier_C_Get_Role_Info) == 0x000008, "Wrong alignment on BP_R2T_Soldier_C_Get_Role_Info");
static_assert(sizeof(BP_R2T_Soldier_C_Get_Role_Info) == 0x0000E0, "Wrong size on BP_R2T_Soldier_C_Get_Role_Info");
static_assert(offsetof(BP_R2T_Soldier_C_Get_Role_Info, Soldier_Mesh) == 0x000000, "Member 'BP_R2T_Soldier_C_Get_Role_Info::Soldier_Mesh' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Get_Role_Info, Weapon_Mesh) == 0x000008, "Member 'BP_R2T_Soldier_C_Get_Role_Info::Weapon_Mesh' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Get_Role_Info, CallFunc_TryGetCurrentLayer_OutLayer) == 0x000010, "Member 'BP_R2T_Soldier_C_Get_Role_Info::CallFunc_TryGetCurrentLayer_OutLayer' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Get_Role_Info, CallFunc_TryGetCurrentLayer_ReturnValue) == 0x000018, "Member 'BP_R2T_Soldier_C_Get_Role_Info::CallFunc_TryGetCurrentLayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Get_Role_Info, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'BP_R2T_Soldier_C_Get_Role_Info::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Get_Role_Info, CallFunc_TryGetSoldierWithLayer_OutSoldier) == 0x000020, "Member 'BP_R2T_Soldier_C_Get_Role_Info::CallFunc_TryGetSoldierWithLayer_OutSoldier' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Get_Role_Info, CallFunc_TryGetSoldierWithLayer_ReturnValue) == 0x000048, "Member 'BP_R2T_Soldier_C_Get_Role_Info::CallFunc_TryGetSoldierWithLayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Get_Role_Info, CallFunc_Array_Get_Item) == 0x000050, "Member 'BP_R2T_Soldier_C_Get_Role_Info::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Get_Role_Info, CallFunc_LoadClassAsset_Blocking_ReturnValue) == 0x000060, "Member 'BP_R2T_Soldier_C_Get_Role_Info::CallFunc_LoadClassAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Get_Role_Info, CallFunc_GetDefaultObjectFor_ReturnValue) == 0x000068, "Member 'BP_R2T_Soldier_C_Get_Role_Info::CallFunc_GetDefaultObjectFor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Get_Role_Info, CallFunc_Array_Get_Item_1) == 0x000070, "Member 'BP_R2T_Soldier_C_Get_Role_Info::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Get_Role_Info, K2Node_DynamicCast_AsSQSoldier) == 0x0000A8, "Member 'BP_R2T_Soldier_C_Get_Role_Info::K2Node_DynamicCast_AsSQSoldier' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Get_Role_Info, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'BP_R2T_Soldier_C_Get_Role_Info::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Get_Role_Info, CallFunc_LoadClassAsset_Blocking_ReturnValue_1) == 0x0000B8, "Member 'BP_R2T_Soldier_C_Get_Role_Info::CallFunc_LoadClassAsset_Blocking_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Get_Role_Info, CallFunc_GetDefaultObjectFor_ReturnValue_1) == 0x0000C0, "Member 'BP_R2T_Soldier_C_Get_Role_Info::CallFunc_GetDefaultObjectFor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Get_Role_Info, K2Node_DynamicCast_AsSQWeapon) == 0x0000C8, "Member 'BP_R2T_Soldier_C_Get_Role_Info::K2Node_DynamicCast_AsSQWeapon' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Get_Role_Info, K2Node_DynamicCast_bSuccess_1) == 0x0000D0, "Member 'BP_R2T_Soldier_C_Get_Role_Info::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Get_Role_Info, CallFunc_GetMesh_ReturnValue) == 0x0000D8, "Member 'BP_R2T_Soldier_C_Get_Role_Info::CallFunc_GetMesh_ReturnValue' has a wrong offset!");

// Function BP_R2T_Soldier.BP_R2T_Soldier_C.Manage Attachments
// 0x0150 (0x0150 - 0x0000)
struct BP_R2T_Soldier_C_Manage_Attachments final
{
public:
	bool                                          Create;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   L_Attach;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            L_Static_Mesh;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   L_Socket_Name;                                     // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33[0x1];                                       // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetDefaultObjectFor_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASQWeapon*                              K2Node_DynamicCast_AsSQWeapon;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSQInventoryWeaponGroupData            CallFunc_Array_Get_Item_1;                         // 0x0058(0x0010)()
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSQInventoryData                       CallFunc_Array_Get_Item_2;                         // 0x0070(0x0038)()
	class UObject*                                CallFunc_GetDefaultObjectFor_ReturnValue_1;        // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USQWeaponAttachment*                    K2Node_DynamicCast_AsSQWeapon_Attachment;          // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UObject>                    CallFunc_Conv_SoftClassReferenceToClass_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UClass*                                 K2Node_ClassDynamicCast_AsSQEquipable_Item;        // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ClassDynamicCast_bSuccess;                  // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USQWeaponAttachment_Scope*              K2Node_DynamicCast_AsSQWeapon_Attachment_Scope;    // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00F0(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_3;                         // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0145(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_R2T_Soldier_C_Manage_Attachments) == 0x000010, "Wrong alignment on BP_R2T_Soldier_C_Manage_Attachments");
static_assert(sizeof(BP_R2T_Soldier_C_Manage_Attachments) == 0x000150, "Wrong size on BP_R2T_Soldier_C_Manage_Attachments");
static_assert(offsetof(BP_R2T_Soldier_C_Manage_Attachments, Create) == 0x000000, "Member 'BP_R2T_Soldier_C_Manage_Attachments::Create' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Manage_Attachments, L_Attach) == 0x000008, "Member 'BP_R2T_Soldier_C_Manage_Attachments::L_Attach' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Manage_Attachments, L_Static_Mesh) == 0x000010, "Member 'BP_R2T_Soldier_C_Manage_Attachments::L_Static_Mesh' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Manage_Attachments, L_Socket_Name) == 0x000018, "Member 'BP_R2T_Soldier_C_Manage_Attachments::L_Socket_Name' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Manage_Attachments, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BP_R2T_Soldier_C_Manage_Attachments::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Manage_Attachments, Temp_int_Loop_Counter_Variable) == 0x000024, "Member 'BP_R2T_Soldier_C_Manage_Attachments::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Manage_Attachments, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'BP_R2T_Soldier_C_Manage_Attachments::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Manage_Attachments, Temp_int_Array_Index_Variable_1) == 0x00002C, "Member 'BP_R2T_Soldier_C_Manage_Attachments::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Manage_Attachments, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_R2T_Soldier_C_Manage_Attachments::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Manage_Attachments, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000031, "Member 'BP_R2T_Soldier_C_Manage_Attachments::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Manage_Attachments, CallFunc_SetStaticMesh_ReturnValue) == 0x000032, "Member 'BP_R2T_Soldier_C_Manage_Attachments::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Manage_Attachments, CallFunc_Array_Add_ReturnValue) == 0x000034, "Member 'BP_R2T_Soldier_C_Manage_Attachments::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Manage_Attachments, CallFunc_GetDefaultObjectFor_ReturnValue) == 0x000038, "Member 'BP_R2T_Soldier_C_Manage_Attachments::CallFunc_GetDefaultObjectFor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Manage_Attachments, K2Node_DynamicCast_AsSQWeapon) == 0x000040, "Member 'BP_R2T_Soldier_C_Manage_Attachments::K2Node_DynamicCast_AsSQWeapon' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Manage_Attachments, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_R2T_Soldier_C_Manage_Attachments::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Manage_Attachments, CallFunc_Array_Get_Item) == 0x000050, "Member 'BP_R2T_Soldier_C_Manage_Attachments::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Manage_Attachments, CallFunc_Array_Get_Item_1) == 0x000058, "Member 'BP_R2T_Soldier_C_Manage_Attachments::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Manage_Attachments, CallFunc_IsValidClass_ReturnValue) == 0x000068, "Member 'BP_R2T_Soldier_C_Manage_Attachments::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Manage_Attachments, CallFunc_Array_Get_Item_2) == 0x000070, "Member 'BP_R2T_Soldier_C_Manage_Attachments::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Manage_Attachments, CallFunc_GetDefaultObjectFor_ReturnValue_1) == 0x0000A8, "Member 'BP_R2T_Soldier_C_Manage_Attachments::CallFunc_GetDefaultObjectFor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Manage_Attachments, K2Node_DynamicCast_AsSQWeapon_Attachment) == 0x0000B0, "Member 'BP_R2T_Soldier_C_Manage_Attachments::K2Node_DynamicCast_AsSQWeapon_Attachment' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Manage_Attachments, K2Node_DynamicCast_bSuccess_1) == 0x0000B8, "Member 'BP_R2T_Soldier_C_Manage_Attachments::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Manage_Attachments, CallFunc_Conv_SoftClassReferenceToClass_ReturnValue) == 0x0000C0, "Member 'BP_R2T_Soldier_C_Manage_Attachments::CallFunc_Conv_SoftClassReferenceToClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Manage_Attachments, K2Node_ClassDynamicCast_AsSQEquipable_Item) == 0x0000C8, "Member 'BP_R2T_Soldier_C_Manage_Attachments::K2Node_ClassDynamicCast_AsSQEquipable_Item' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Manage_Attachments, K2Node_ClassDynamicCast_bSuccess) == 0x0000D0, "Member 'BP_R2T_Soldier_C_Manage_Attachments::K2Node_ClassDynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Manage_Attachments, CallFunc_LoadClassAsset_Blocking_ReturnValue) == 0x0000D8, "Member 'BP_R2T_Soldier_C_Manage_Attachments::CallFunc_LoadClassAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Manage_Attachments, K2Node_DynamicCast_AsSQWeapon_Attachment_Scope) == 0x0000E0, "Member 'BP_R2T_Soldier_C_Manage_Attachments::K2Node_DynamicCast_AsSQWeapon_Attachment_Scope' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Manage_Attachments, K2Node_DynamicCast_bSuccess_2) == 0x0000E8, "Member 'BP_R2T_Soldier_C_Manage_Attachments::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Manage_Attachments, CallFunc_Array_Length_ReturnValue) == 0x0000EC, "Member 'BP_R2T_Soldier_C_Manage_Attachments::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Manage_Attachments, CallFunc_MakeTransform_ReturnValue) == 0x0000F0, "Member 'BP_R2T_Soldier_C_Manage_Attachments::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Manage_Attachments, Temp_int_Loop_Counter_Variable_1) == 0x000120, "Member 'BP_R2T_Soldier_C_Manage_Attachments::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Manage_Attachments, CallFunc_AddComponent_ReturnValue) == 0x000128, "Member 'BP_R2T_Soldier_C_Manage_Attachments::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Manage_Attachments, CallFunc_Less_IntInt_ReturnValue) == 0x000130, "Member 'BP_R2T_Soldier_C_Manage_Attachments::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Manage_Attachments, CallFunc_Add_IntInt_ReturnValue_1) == 0x000134, "Member 'BP_R2T_Soldier_C_Manage_Attachments::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Manage_Attachments, CallFunc_Array_Get_Item_3) == 0x000138, "Member 'BP_R2T_Soldier_C_Manage_Attachments::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Manage_Attachments, CallFunc_Array_Length_ReturnValue_1) == 0x000140, "Member 'BP_R2T_Soldier_C_Manage_Attachments::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Manage_Attachments, CallFunc_IsValid_ReturnValue_1) == 0x000144, "Member 'BP_R2T_Soldier_C_Manage_Attachments::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_Manage_Attachments, CallFunc_Less_IntInt_ReturnValue_1) == 0x000145, "Member 'BP_R2T_Soldier_C_Manage_Attachments::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");

// Function BP_R2T_Soldier.BP_R2T_Soldier_C.HasCiggy
// 0x0001 (0x0001 - 0x0000)
struct BP_R2T_Soldier_C_HasCiggy final
{
public:
	bool                                          bIsCiggy;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_R2T_Soldier_C_HasCiggy) == 0x000001, "Wrong alignment on BP_R2T_Soldier_C_HasCiggy");
static_assert(sizeof(BP_R2T_Soldier_C_HasCiggy) == 0x000001, "Wrong size on BP_R2T_Soldier_C_HasCiggy");
static_assert(offsetof(BP_R2T_Soldier_C_HasCiggy, bIsCiggy) == 0x000000, "Member 'BP_R2T_Soldier_C_HasCiggy::bIsCiggy' has a wrong offset!");

// Function BP_R2T_Soldier.BP_R2T_Soldier_C.UpdatePreviewLocation
// 0x00C0 (0x00C0 - 0x0000)
struct BP_R2T_Soldier_C_UpdatePreviewLocation final
{
public:
	float                                         CallFunc_GetScalarParameterValue_ReturnValue;      // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScalarParameterValue_ReturnValue_1;    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0034(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_R2T_Soldier_C_UpdatePreviewLocation) == 0x000004, "Wrong alignment on BP_R2T_Soldier_C_UpdatePreviewLocation");
static_assert(sizeof(BP_R2T_Soldier_C_UpdatePreviewLocation) == 0x0000C0, "Wrong size on BP_R2T_Soldier_C_UpdatePreviewLocation");
static_assert(offsetof(BP_R2T_Soldier_C_UpdatePreviewLocation, CallFunc_GetScalarParameterValue_ReturnValue) == 0x000000, "Member 'BP_R2T_Soldier_C_UpdatePreviewLocation::CallFunc_GetScalarParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_UpdatePreviewLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'BP_R2T_Soldier_C_UpdatePreviewLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_UpdatePreviewLocation, CallFunc_GetScalarParameterValue_ReturnValue_1) == 0x000010, "Member 'BP_R2T_Soldier_C_UpdatePreviewLocation::CallFunc_GetScalarParameterValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_UpdatePreviewLocation, CallFunc_BreakVector_X) == 0x000014, "Member 'BP_R2T_Soldier_C_UpdatePreviewLocation::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_UpdatePreviewLocation, CallFunc_BreakVector_Y) == 0x000018, "Member 'BP_R2T_Soldier_C_UpdatePreviewLocation::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_UpdatePreviewLocation, CallFunc_BreakVector_Z) == 0x00001C, "Member 'BP_R2T_Soldier_C_UpdatePreviewLocation::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_UpdatePreviewLocation, CallFunc_Add_FloatFloat_ReturnValue) == 0x000020, "Member 'BP_R2T_Soldier_C_UpdatePreviewLocation::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_UpdatePreviewLocation, CallFunc_FMax_ReturnValue) == 0x000024, "Member 'BP_R2T_Soldier_C_UpdatePreviewLocation::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_UpdatePreviewLocation, CallFunc_MakeVector_ReturnValue) == 0x000028, "Member 'BP_R2T_Soldier_C_UpdatePreviewLocation::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_UpdatePreviewLocation, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000034, "Member 'BP_R2T_Soldier_C_UpdatePreviewLocation::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_UpdatePreviewLocation, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0000BC, "Member 'BP_R2T_Soldier_C_UpdatePreviewLocation::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");

// Function BP_R2T_Soldier.BP_R2T_Soldier_C.SetupEmoteProp
// 0x0068 (0x0068 - 0x0000)
struct BP_R2T_Soldier_C_SetupEmoteProp final
{
public:
	struct FSQEmotePropData                       PropInfo;                                          // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm)
	class ASQEmoteProp*                           CallFunc_SpawnPropInPreview_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_R2T_Soldier_C_SetupEmoteProp) == 0x000008, "Wrong alignment on BP_R2T_Soldier_C_SetupEmoteProp");
static_assert(sizeof(BP_R2T_Soldier_C_SetupEmoteProp) == 0x000068, "Wrong size on BP_R2T_Soldier_C_SetupEmoteProp");
static_assert(offsetof(BP_R2T_Soldier_C_SetupEmoteProp, PropInfo) == 0x000000, "Member 'BP_R2T_Soldier_C_SetupEmoteProp::PropInfo' has a wrong offset!");
static_assert(offsetof(BP_R2T_Soldier_C_SetupEmoteProp, CallFunc_SpawnPropInPreview_ReturnValue) == 0x000060, "Member 'BP_R2T_Soldier_C_SetupEmoteProp::CallFunc_SpawnPropInPreview_ReturnValue' has a wrong offset!");

}

