#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VehicleAmmoIcon

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_VehicleAmmoIcon.BP_VehicleAmmoIcon_C.ExecuteUbergraph_BP_VehicleAmmoIcon
// 0x0058 (0x0058 - 0x0000)
struct BP_VehicleAmmoIcon_C_ExecuteUbergraph_BP_VehicleAmmoIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Selected)>                K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveData_UI_C*                         CallFunc_Get_UI_Save_Data_UI_Save_Data;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_Selected;                       // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_HUD_C*                              K2Node_DynamicCast_AsBP_HUD;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_VehicleAmmoIcon_C_ExecuteUbergraph_BP_VehicleAmmoIcon) == 0x000008, "Wrong alignment on BP_VehicleAmmoIcon_C_ExecuteUbergraph_BP_VehicleAmmoIcon");
static_assert(sizeof(BP_VehicleAmmoIcon_C_ExecuteUbergraph_BP_VehicleAmmoIcon) == 0x000058, "Wrong size on BP_VehicleAmmoIcon_C_ExecuteUbergraph_BP_VehicleAmmoIcon");
static_assert(offsetof(BP_VehicleAmmoIcon_C_ExecuteUbergraph_BP_VehicleAmmoIcon, EntryPoint) == 0x000000, "Member 'BP_VehicleAmmoIcon_C_ExecuteUbergraph_BP_VehicleAmmoIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_VehicleAmmoIcon_C_ExecuteUbergraph_BP_VehicleAmmoIcon, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_VehicleAmmoIcon_C_ExecuteUbergraph_BP_VehicleAmmoIcon::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_VehicleAmmoIcon_C_ExecuteUbergraph_BP_VehicleAmmoIcon, CallFunc_Get_UI_Save_Data_UI_Save_Data) == 0x000018, "Member 'BP_VehicleAmmoIcon_C_ExecuteUbergraph_BP_VehicleAmmoIcon::CallFunc_Get_UI_Save_Data_UI_Save_Data' has a wrong offset!");
static_assert(offsetof(BP_VehicleAmmoIcon_C_ExecuteUbergraph_BP_VehicleAmmoIcon, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'BP_VehicleAmmoIcon_C_ExecuteUbergraph_BP_VehicleAmmoIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleAmmoIcon_C_ExecuteUbergraph_BP_VehicleAmmoIcon, K2Node_CustomEvent_Selected) == 0x000021, "Member 'BP_VehicleAmmoIcon_C_ExecuteUbergraph_BP_VehicleAmmoIcon::K2Node_CustomEvent_Selected' has a wrong offset!");
static_assert(offsetof(BP_VehicleAmmoIcon_C_ExecuteUbergraph_BP_VehicleAmmoIcon, CallFunc_GetPlayerController_ReturnValue) == 0x000028, "Member 'BP_VehicleAmmoIcon_C_ExecuteUbergraph_BP_VehicleAmmoIcon::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleAmmoIcon_C_ExecuteUbergraph_BP_VehicleAmmoIcon, CallFunc_IsValid_ReturnValue_1) == 0x000030, "Member 'BP_VehicleAmmoIcon_C_ExecuteUbergraph_BP_VehicleAmmoIcon::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_VehicleAmmoIcon_C_ExecuteUbergraph_BP_VehicleAmmoIcon, CallFunc_GetHUD_ReturnValue) == 0x000038, "Member 'BP_VehicleAmmoIcon_C_ExecuteUbergraph_BP_VehicleAmmoIcon::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VehicleAmmoIcon_C_ExecuteUbergraph_BP_VehicleAmmoIcon, CallFunc_IsValid_ReturnValue_2) == 0x000040, "Member 'BP_VehicleAmmoIcon_C_ExecuteUbergraph_BP_VehicleAmmoIcon::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_VehicleAmmoIcon_C_ExecuteUbergraph_BP_VehicleAmmoIcon, K2Node_DynamicCast_AsBP_HUD) == 0x000048, "Member 'BP_VehicleAmmoIcon_C_ExecuteUbergraph_BP_VehicleAmmoIcon::K2Node_DynamicCast_AsBP_HUD' has a wrong offset!");
static_assert(offsetof(BP_VehicleAmmoIcon_C_ExecuteUbergraph_BP_VehicleAmmoIcon, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_VehicleAmmoIcon_C_ExecuteUbergraph_BP_VehicleAmmoIcon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_VehicleAmmoIcon_C_ExecuteUbergraph_BP_VehicleAmmoIcon, CallFunc_IsValid_ReturnValue_3) == 0x000051, "Member 'BP_VehicleAmmoIcon_C_ExecuteUbergraph_BP_VehicleAmmoIcon::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_VehicleAmmoIcon_C_ExecuteUbergraph_BP_VehicleAmmoIcon, CallFunc_IsValid_ReturnValue_4) == 0x000052, "Member 'BP_VehicleAmmoIcon_C_ExecuteUbergraph_BP_VehicleAmmoIcon::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_VehicleAmmoIcon_C_ExecuteUbergraph_BP_VehicleAmmoIcon, CallFunc_IsValid_ReturnValue_5) == 0x000053, "Member 'BP_VehicleAmmoIcon_C_ExecuteUbergraph_BP_VehicleAmmoIcon::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");

// Function BP_VehicleAmmoIcon.BP_VehicleAmmoIcon_C.ChangeIconActive
// 0x0001 (0x0001 - 0x0000)
struct BP_VehicleAmmoIcon_C_ChangeIconActive final
{
public:
	bool                                          Selected;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_VehicleAmmoIcon_C_ChangeIconActive) == 0x000001, "Wrong alignment on BP_VehicleAmmoIcon_C_ChangeIconActive");
static_assert(sizeof(BP_VehicleAmmoIcon_C_ChangeIconActive) == 0x000001, "Wrong size on BP_VehicleAmmoIcon_C_ChangeIconActive");
static_assert(offsetof(BP_VehicleAmmoIcon_C_ChangeIconActive, Selected) == 0x000000, "Member 'BP_VehicleAmmoIcon_C_ChangeIconActive::Selected' has a wrong offset!");

}

