#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Weapons_Marketing

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Weapons_Marketing.BP_Weapons_Marketing_C
// 0x00A8 (0x02D0 - 0x0228)
class ABP_Weapons_Marketing_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 Item_Mesh;                                         // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ItemClass;                                         // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                ItemObjectRef;                                     // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseConstruction;                                   // 0x0250(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UClass*, class UStaticMeshComponent*> AttachmentToMeshes3P;                              // 0x0258(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TSoftObjectPtr<class USQItemSkinCollection>   SkinToDisplay;                                     // 0x02A8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Weapons_Marketing(int32 EntryPoint);
	void UpdateVisuals();
	void UserConstructionScript();
	void ConfigureWeaponVisuals(class ABP_Weapon2_C* Weapon);
	void ApplySkin(class USQItemSkinCollection* SkinCollection);
	void ApplyAttachmentSkins(class USQItemSkinCollection* SkinCollection);
	void ClearAttachments();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Weapons_Marketing_C">();
	}
	static class ABP_Weapons_Marketing_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Weapons_Marketing_C>();
	}
};
static_assert(alignof(ABP_Weapons_Marketing_C) == 0x000008, "Wrong alignment on ABP_Weapons_Marketing_C");
static_assert(sizeof(ABP_Weapons_Marketing_C) == 0x0002D0, "Wrong size on ABP_Weapons_Marketing_C");
static_assert(offsetof(ABP_Weapons_Marketing_C, UberGraphFrame) == 0x000228, "Member 'ABP_Weapons_Marketing_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Weapons_Marketing_C, Item_Mesh) == 0x000230, "Member 'ABP_Weapons_Marketing_C::Item_Mesh' has a wrong offset!");
static_assert(offsetof(ABP_Weapons_Marketing_C, DefaultSceneRoot) == 0x000238, "Member 'ABP_Weapons_Marketing_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Weapons_Marketing_C, ItemClass) == 0x000240, "Member 'ABP_Weapons_Marketing_C::ItemClass' has a wrong offset!");
static_assert(offsetof(ABP_Weapons_Marketing_C, ItemObjectRef) == 0x000248, "Member 'ABP_Weapons_Marketing_C::ItemObjectRef' has a wrong offset!");
static_assert(offsetof(ABP_Weapons_Marketing_C, UseConstruction) == 0x000250, "Member 'ABP_Weapons_Marketing_C::UseConstruction' has a wrong offset!");
static_assert(offsetof(ABP_Weapons_Marketing_C, AttachmentToMeshes3P) == 0x000258, "Member 'ABP_Weapons_Marketing_C::AttachmentToMeshes3P' has a wrong offset!");
static_assert(offsetof(ABP_Weapons_Marketing_C, SkinToDisplay) == 0x0002A8, "Member 'ABP_Weapons_Marketing_C::SkinToDisplay' has a wrong offset!");

}

