#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clothesline_urban_4m

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass clothesline_urban_4m.clothesline_urban_4m_C
// 0x0058 (0x0280 - 0x0228)
class AClothesline_urban_4m_C final : public AActor
{
public:
	class UStaticMeshComponent*                   SM_Clothesline4M_01_Static;                        // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ME_PowerPole_Cable;                             // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent07;                             // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent06;                             // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent05;                             // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent04;                             // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent03;                             // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent02;                             // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent01;                             // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshComponent0;                              // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"clothesline_urban_4m_C">();
	}
	static class AClothesline_urban_4m_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AClothesline_urban_4m_C>();
	}
};
static_assert(alignof(AClothesline_urban_4m_C) == 0x000008, "Wrong alignment on AClothesline_urban_4m_C");
static_assert(sizeof(AClothesline_urban_4m_C) == 0x000280, "Wrong size on AClothesline_urban_4m_C");
static_assert(offsetof(AClothesline_urban_4m_C, SM_Clothesline4M_01_Static) == 0x000228, "Member 'AClothesline_urban_4m_C::SM_Clothesline4M_01_Static' has a wrong offset!");
static_assert(offsetof(AClothesline_urban_4m_C, SM_ME_PowerPole_Cable) == 0x000230, "Member 'AClothesline_urban_4m_C::SM_ME_PowerPole_Cable' has a wrong offset!");
static_assert(offsetof(AClothesline_urban_4m_C, StaticMeshComponent07) == 0x000238, "Member 'AClothesline_urban_4m_C::StaticMeshComponent07' has a wrong offset!");
static_assert(offsetof(AClothesline_urban_4m_C, StaticMeshComponent06) == 0x000240, "Member 'AClothesline_urban_4m_C::StaticMeshComponent06' has a wrong offset!");
static_assert(offsetof(AClothesline_urban_4m_C, StaticMeshComponent05) == 0x000248, "Member 'AClothesline_urban_4m_C::StaticMeshComponent05' has a wrong offset!");
static_assert(offsetof(AClothesline_urban_4m_C, StaticMeshComponent04) == 0x000250, "Member 'AClothesline_urban_4m_C::StaticMeshComponent04' has a wrong offset!");
static_assert(offsetof(AClothesline_urban_4m_C, StaticMeshComponent03) == 0x000258, "Member 'AClothesline_urban_4m_C::StaticMeshComponent03' has a wrong offset!");
static_assert(offsetof(AClothesline_urban_4m_C, StaticMeshComponent02) == 0x000260, "Member 'AClothesline_urban_4m_C::StaticMeshComponent02' has a wrong offset!");
static_assert(offsetof(AClothesline_urban_4m_C, StaticMeshComponent01) == 0x000268, "Member 'AClothesline_urban_4m_C::StaticMeshComponent01' has a wrong offset!");
static_assert(offsetof(AClothesline_urban_4m_C, StaticMeshComponent0) == 0x000270, "Member 'AClothesline_urban_4m_C::StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(AClothesline_urban_4m_C, SharedRoot) == 0x000278, "Member 'AClothesline_urban_4m_C::SharedRoot' has a wrong offset!");

}

