#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GraphTicketComponent

#include "Basic.hpp"

#include "Squad_structs.hpp"


namespace SDK::Params
{

// Function GraphTicketComponent.GraphTicketComponent_C.ExecuteUbergraph_GraphTicketComponent
// 0x0160 (0x0160 - 0x0000)
struct GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESQTicketChangeReason                         Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	ESQTicketChangeReason                         Temp_byte_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USQStatsCollectorSubsystem*             CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x1];                                       // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASQUndirectedGraph*                     K2Node_DynamicCast_AsSQUndirected_Graph;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASQUndirectedGraph*                     K2Node_DynamicCast_AsSQUndirected_Graph_1;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USQGraphNodeComponent*                  CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USQCaptureZoneComponent*                K2Node_DynamicCast_AsSQCapture_Zone_Component;     // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USQCaptureZoneComponent*                K2Node_CustomEvent_CaptureZone;                    // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_Team;                           // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASQGameState*                           CallFunc_GetSquadGameState_Return_Value;           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASQTeamState*                           CallFunc_Array_Get_Item_1;                         // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTickets_ReturnValue;                   // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTickets_ReturnValue_1;                 // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C3[0x1];                                       // 0x00C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESQTicketChangeReason                         K2Node_Select_Default;                             // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CB[0x1];                                       // 0x00CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESQTicketChangeReason                         Temp_byte_Variable_2;                              // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D3[0x5];                                       // 0x00D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESQTicketChangeReason                         K2Node_Select_Default_1;                           // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x2];                                       // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class USQCaptureZoneComponent* CaptureZone, uint8 Team)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x00E4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USQStatsCollectorSubsystem*             CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USQObjectiveStatsCollector*             CallFunc_GetObjectiveStatsCollector_ReturnValue;   // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_2;                           // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASQGameMode*                            K2Node_DynamicCast_AsSQGame_Mode;                  // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMatchTime_ReturnValue;                 // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSQTicketChange                        K2Node_MakeStruct_SQTicketChange;                  // 0x0134(0x0014)(NoDestructor)
	int32                                         CallFunc_RegisterTicketChange_ReturnValue;         // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_3;                           // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_4;                           // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent) == 0x000008, "Wrong alignment on GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent");
static_assert(sizeof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent) == 0x000160, "Wrong size on GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, EntryPoint) == 0x000000, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, Temp_byte_Variable) == 0x000004, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, Temp_byte_Variable_1) == 0x000018, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000020, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, CallFunc_MakeLiteralByte_ReturnValue) == 0x000028, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000029, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x00002A, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, Temp_int_Loop_Counter_Variable) == 0x000030, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, Temp_int_Array_Index_Variable_1) == 0x000038, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, Temp_bool_Variable) == 0x00003C, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, CallFunc_GetOwner_ReturnValue) == 0x000040, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, K2Node_DynamicCast_AsSQUndirected_Graph) == 0x000048, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::K2Node_DynamicCast_AsSQUndirected_Graph' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, CallFunc_GetOwner_ReturnValue_1) == 0x000058, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, K2Node_DynamicCast_AsSQUndirected_Graph_1) == 0x000060, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::K2Node_DynamicCast_AsSQUndirected_Graph_1' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, CallFunc_Array_Get_Item) == 0x000070, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, K2Node_DynamicCast_AsSQCapture_Zone_Component) == 0x000078, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::K2Node_DynamicCast_AsSQCapture_Zone_Component' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, K2Node_DynamicCast_bSuccess_2) == 0x000080, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, CallFunc_Array_Length_ReturnValue) == 0x000084, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, K2Node_CustomEvent_CaptureZone) == 0x000088, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::K2Node_CustomEvent_CaptureZone' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, K2Node_CustomEvent_Team) == 0x000090, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::K2Node_CustomEvent_Team' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, CallFunc_GetSquadGameState_Return_Value) == 0x000098, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::CallFunc_GetSquadGameState_Return_Value' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000A0, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, CallFunc_Array_Get_Item_1) == 0x0000A8, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, CallFunc_Array_Length_ReturnValue_1) == 0x0000B0, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, CallFunc_GetTickets_ReturnValue) == 0x0000B4, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::CallFunc_GetTickets_ReturnValue' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, CallFunc_Less_IntInt_ReturnValue) == 0x0000B8, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, CallFunc_GetTickets_ReturnValue_1) == 0x0000BC, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::CallFunc_GetTickets_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, CallFunc_IsValid_ReturnValue) == 0x0000C0, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, CallFunc_Conv_IntToByte_ReturnValue) == 0x0000C1, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000C2, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, Temp_int_Loop_Counter_Variable_1) == 0x0000C4, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0000C8, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000C9, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, K2Node_Select_Default) == 0x0000CA, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000CC, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000D0, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, Temp_byte_Variable_2) == 0x0000D1, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, Temp_bool_Variable_1) == 0x0000D2, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, CallFunc_GetOwner_ReturnValue_2) == 0x0000D8, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, CallFunc_HasAuthority_ReturnValue) == 0x0000E0, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, K2Node_Select_Default_1) == 0x0000E1, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000E4, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, CallFunc_GetGameInstanceSubsystem_ReturnValue_1) == 0x0000F8, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::CallFunc_GetGameInstanceSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, CallFunc_GetObjectiveStatsCollector_ReturnValue) == 0x000100, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::CallFunc_GetObjectiveStatsCollector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, CallFunc_Add_IntInt_ReturnValue_2) == 0x000108, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, Temp_bool_Variable_2) == 0x00010C, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, CallFunc_GetGameMode_ReturnValue) == 0x000110, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, K2Node_Select_Default_2) == 0x000118, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, K2Node_DynamicCast_AsSQGame_Mode) == 0x000120, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::K2Node_DynamicCast_AsSQGame_Mode' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, K2Node_DynamicCast_bSuccess_3) == 0x000128, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, CallFunc_GetMatchTime_ReturnValue) == 0x00012C, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::CallFunc_GetMatchTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, Temp_bool_Variable_3) == 0x000130, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, K2Node_MakeStruct_SQTicketChange) == 0x000134, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::K2Node_MakeStruct_SQTicketChange' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, CallFunc_RegisterTicketChange_ReturnValue) == 0x000148, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::CallFunc_RegisterTicketChange_ReturnValue' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, K2Node_Select_Default_3) == 0x00014C, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, CallFunc_Subtract_IntInt_ReturnValue) == 0x000150, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, Temp_bool_Variable_4) == 0x000154, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent, K2Node_Select_Default_4) == 0x000158, "Member 'GraphTicketComponent_C_ExecuteUbergraph_GraphTicketComponent::K2Node_Select_Default_4' has a wrong offset!");

// Function GraphTicketComponent.GraphTicketComponent_C.CaptureStateChangeEvent_Event_0
// 0x0010 (0x0010 - 0x0000)
struct GraphTicketComponent_C_CaptureStateChangeEvent_Event_0 final
{
public:
	class USQCaptureZoneComponent*                CaptureZone;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Team;                                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GraphTicketComponent_C_CaptureStateChangeEvent_Event_0) == 0x000008, "Wrong alignment on GraphTicketComponent_C_CaptureStateChangeEvent_Event_0");
static_assert(sizeof(GraphTicketComponent_C_CaptureStateChangeEvent_Event_0) == 0x000010, "Wrong size on GraphTicketComponent_C_CaptureStateChangeEvent_Event_0");
static_assert(offsetof(GraphTicketComponent_C_CaptureStateChangeEvent_Event_0, CaptureZone) == 0x000000, "Member 'GraphTicketComponent_C_CaptureStateChangeEvent_Event_0::CaptureZone' has a wrong offset!");
static_assert(offsetof(GraphTicketComponent_C_CaptureStateChangeEvent_Event_0, Team) == 0x000008, "Member 'GraphTicketComponent_C_CaptureStateChangeEvent_Event_0::Team' has a wrong offset!");

}

