#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_TimelineGraph

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Squad_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_TimelineGraph.UMG_TimelineGraph_C
// 0x0060 (0x0360 - 0x0300)
class UUMG_TimelineGraph_C final : public USQTimelineGraph
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_120;                                        // 0x0308(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         HoveredLine;                                       // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowBoth;                                          // 0x0314(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_315[0x3];                                      // 0x0315(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_TimelinePoint_C*                   LineTracer;                                        // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_TimelineTooltip_C*                 TimelineTooltip;                                   // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USQEndStatsComponent*                   EndStatComponent;                                  // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 LineTeam;                                          // 0x0330(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         LastUpdatedLine;                                   // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LastUpdatedShowBoth;                               // 0x0344(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_345[0x3];                                      // 0x0345(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 VisibleLinesDetails;                               // 0x0348(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         HoverDetectionDistance;                            // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_TimelineGraph(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void Refresh();
	void UpdatePointerVisibility(float& LineDist);
	void UpdatePointsInfo(struct FVector2D& StartPoint, TArray<int32>& PrevPoints);
	void PresentPointInfo(class USQTimelinePoint* NewPoint);
	void GetTimeAtPoint(struct FVector2D& PointLoc, TArray<int32>& PointIndexes, int32& TeamId, float* Time);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_TimelineGraph_C">();
	}
	static class UUMG_TimelineGraph_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_TimelineGraph_C>();
	}
};
static_assert(alignof(UUMG_TimelineGraph_C) == 0x000008, "Wrong alignment on UUMG_TimelineGraph_C");
static_assert(sizeof(UUMG_TimelineGraph_C) == 0x000360, "Wrong size on UUMG_TimelineGraph_C");
static_assert(offsetof(UUMG_TimelineGraph_C, UberGraphFrame) == 0x000300, "Member 'UUMG_TimelineGraph_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_TimelineGraph_C, Border_120) == 0x000308, "Member 'UUMG_TimelineGraph_C::Border_120' has a wrong offset!");
static_assert(offsetof(UUMG_TimelineGraph_C, HoveredLine) == 0x000310, "Member 'UUMG_TimelineGraph_C::HoveredLine' has a wrong offset!");
static_assert(offsetof(UUMG_TimelineGraph_C, ShowBoth) == 0x000314, "Member 'UUMG_TimelineGraph_C::ShowBoth' has a wrong offset!");
static_assert(offsetof(UUMG_TimelineGraph_C, LineTracer) == 0x000318, "Member 'UUMG_TimelineGraph_C::LineTracer' has a wrong offset!");
static_assert(offsetof(UUMG_TimelineGraph_C, TimelineTooltip) == 0x000320, "Member 'UUMG_TimelineGraph_C::TimelineTooltip' has a wrong offset!");
static_assert(offsetof(UUMG_TimelineGraph_C, EndStatComponent) == 0x000328, "Member 'UUMG_TimelineGraph_C::EndStatComponent' has a wrong offset!");
static_assert(offsetof(UUMG_TimelineGraph_C, LineTeam) == 0x000330, "Member 'UUMG_TimelineGraph_C::LineTeam' has a wrong offset!");
static_assert(offsetof(UUMG_TimelineGraph_C, LastUpdatedLine) == 0x000340, "Member 'UUMG_TimelineGraph_C::LastUpdatedLine' has a wrong offset!");
static_assert(offsetof(UUMG_TimelineGraph_C, LastUpdatedShowBoth) == 0x000344, "Member 'UUMG_TimelineGraph_C::LastUpdatedShowBoth' has a wrong offset!");
static_assert(offsetof(UUMG_TimelineGraph_C, VisibleLinesDetails) == 0x000348, "Member 'UUMG_TimelineGraph_C::VisibleLinesDetails' has a wrong offset!");
static_assert(offsetof(UUMG_TimelineGraph_C, HoverDetectionDistance) == 0x000358, "Member 'UUMG_TimelineGraph_C::HoverDetectionDistance' has a wrong offset!");

}

