#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_NameTag

#include "Basic.hpp"

#include "FSQRoleEntry_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CachedNametagTargetInfo_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "Squad_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UMG_NameTag.UMG_NameTag_C.ExecuteUbergraph_UMG_NameTag
// 0x0128 (0x0128 - 0x0000)
struct UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USQPipScopeCaptureComponent*            CallFunc_Get_PIP_PipComponent;                     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       K2Node_DynamicCast_AsCanvas_Panel_Slot;            // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USQGameUserSettings*                    CallFunc_GetSquadGameUserSettings_ReturnValue;     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class USQGameUserSettings*              K2Node_CustomEvent_UserSettings;                   // 0x0040(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0058(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USQGameUserSettings*                    CallFunc_GetSquadGameUserSettings_ReturnValue_1;   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASQPlayerState*                         K2Node_DynamicCast_AsSQPlayer_State;               // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x008C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_Vector2DVector2D_ReturnValue;  // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00D4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x00E8(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class USQGameUserSettings* UserSettings)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00F0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_103[0x1];                                      // 0x0103(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FMin_ReturnValue_1;                       // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0110(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_3;        // 0x0120(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag) == 0x000008, "Wrong alignment on UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag");
static_assert(sizeof(UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag) == 0x000128, "Wrong size on UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag");
static_assert(offsetof(UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag, EntryPoint) == 0x000000, "Member 'UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag, CallFunc_Get_PIP_PipComponent) == 0x000008, "Member 'UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag::CallFunc_Get_PIP_PipComponent' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag, K2Node_DynamicCast_AsCanvas_Panel_Slot) == 0x000028, "Member 'UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag::K2Node_DynamicCast_AsCanvas_Panel_Slot' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag, CallFunc_GetSquadGameUserSettings_ReturnValue) == 0x000038, "Member 'UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag::CallFunc_GetSquadGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag, K2Node_CustomEvent_UserSettings) == 0x000040, "Member 'UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag::K2Node_CustomEvent_UserSettings' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag, K2Node_CreateDelegate_OutputDelegate_1) == 0x000048, "Member 'UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000058, "Member 'UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag, CallFunc_FMin_ReturnValue) == 0x000060, "Member 'UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag, CallFunc_GetSquadGameUserSettings_ReturnValue_1) == 0x000068, "Member 'UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag::CallFunc_GetSquadGameUserSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag, CallFunc_GetOwningPlayer_ReturnValue) == 0x000070, "Member 'UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000078, "Member 'UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag, K2Node_DynamicCast_AsSQPlayer_State) == 0x000080, "Member 'UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag::K2Node_DynamicCast_AsSQPlayer_State' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag, K2Node_Event_MyGeometry) == 0x00008C, "Member 'UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag, K2Node_Event_InDeltaTime) == 0x0000C4, "Member 'UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag, CallFunc_GetPosition_ReturnValue) == 0x0000C8, "Member 'UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag::CallFunc_GetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag, CallFunc_EqualEqual_Vector2DVector2D_ReturnValue) == 0x0000D0, "Member 'UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag::CallFunc_EqualEqual_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000D4, "Member 'UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag, CallFunc_K2_SetTimerDelegate_ReturnValue_2) == 0x0000E8, "Member 'UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag::CallFunc_K2_SetTimerDelegate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000F0, "Member 'UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag, CallFunc_IsValid_ReturnValue) == 0x000100, "Member 'UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag, CallFunc_IsValid_ReturnValue_1) == 0x000101, "Member 'UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag, CallFunc_IsValid_ReturnValue_2) == 0x000102, "Member 'UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag, CallFunc_FMin_ReturnValue_1) == 0x000104, "Member 'UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag::CallFunc_FMin_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag, CallFunc_MakeVector2D_ReturnValue) == 0x000108, "Member 'UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag, K2Node_CreateDelegate_OutputDelegate_4) == 0x000110, "Member 'UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag, CallFunc_K2_SetTimerDelegate_ReturnValue_3) == 0x000120, "Member 'UMG_NameTag_C_ExecuteUbergraph_UMG_NameTag::CallFunc_K2_SetTimerDelegate_ReturnValue_3' has a wrong offset!");

// Function UMG_NameTag.UMG_NameTag_C.Tick
// 0x003C (0x003C - 0x0000)
struct UMG_NameTag_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_NameTag_C_Tick) == 0x000004, "Wrong alignment on UMG_NameTag_C_Tick");
static_assert(sizeof(UMG_NameTag_C_Tick) == 0x00003C, "Wrong size on UMG_NameTag_C_Tick");
static_assert(offsetof(UMG_NameTag_C_Tick, MyGeometry) == 0x000000, "Member 'UMG_NameTag_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Tick, InDeltaTime) == 0x000038, "Member 'UMG_NameTag_C_Tick::InDeltaTime' has a wrong offset!");

// Function UMG_NameTag.UMG_NameTag_C.Load Saved Settings
// 0x0008 (0x0008 - 0x0000)
struct UMG_NameTag_C_Load_Saved_Settings final
{
public:
	const class USQGameUserSettings*              UserSettings;                                      // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_NameTag_C_Load_Saved_Settings) == 0x000008, "Wrong alignment on UMG_NameTag_C_Load_Saved_Settings");
static_assert(sizeof(UMG_NameTag_C_Load_Saved_Settings) == 0x000008, "Wrong size on UMG_NameTag_C_Load_Saved_Settings");
static_assert(offsetof(UMG_NameTag_C_Load_Saved_Settings, UserSettings) == 0x000000, "Member 'UMG_NameTag_C_Load_Saved_Settings::UserSettings' has a wrong offset!");

// Function UMG_NameTag.UMG_NameTag_C.Get_Color
// 0x0068 (0x0068 - 0x0000)
struct UMG_NameTag_C_Get_Color final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USQColorsDataAsset*                     CallFunc_Get_SQHUD_Colors_ColorsDataAsset;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISQNameTagInterface>   K2Node_DynamicCast_AsSQName_Tag_Interface;         // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NameTagIsAlive_ReturnValue;               // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33[0x1];                                       // 0x0033(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetColor_ReturnValue;                     // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_1;                // 0x0054(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_NameTag_C_Get_Color) == 0x000008, "Wrong alignment on UMG_NameTag_C_Get_Color");
static_assert(sizeof(UMG_NameTag_C_Get_Color) == 0x000068, "Wrong size on UMG_NameTag_C_Get_Color");
static_assert(offsetof(UMG_NameTag_C_Get_Color, ReturnValue) == 0x000000, "Member 'UMG_NameTag_C_Get_Color::ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Get_Color, CallFunc_Get_SQHUD_Colors_ColorsDataAsset) == 0x000010, "Member 'UMG_NameTag_C_Get_Color::CallFunc_Get_SQHUD_Colors_ColorsDataAsset' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Get_Color, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'UMG_NameTag_C_Get_Color::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Get_Color, K2Node_DynamicCast_AsSQName_Tag_Interface) == 0x000020, "Member 'UMG_NameTag_C_Get_Color::K2Node_DynamicCast_AsSQName_Tag_Interface' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Get_Color, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'UMG_NameTag_C_Get_Color::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Get_Color, CallFunc_NameTagIsAlive_ReturnValue) == 0x000031, "Member 'UMG_NameTag_C_Get_Color::CallFunc_NameTagIsAlive_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Get_Color, CallFunc_Less_IntInt_ReturnValue) == 0x000032, "Member 'UMG_NameTag_C_Get_Color::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Get_Color, CallFunc_GetColor_ReturnValue) == 0x000034, "Member 'UMG_NameTag_C_Get_Color::CallFunc_GetColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Get_Color, CallFunc_SelectColor_ReturnValue) == 0x000044, "Member 'UMG_NameTag_C_Get_Color::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Get_Color, CallFunc_SelectColor_ReturnValue_1) == 0x000054, "Member 'UMG_NameTag_C_Get_Color::CallFunc_SelectColor_ReturnValue_1' has a wrong offset!");

// Function UMG_NameTag.UMG_NameTag_C.Update Opacity
// 0x00C4 (0x00C4 - 0x0000)
struct UMG_NameTag_C_Update_Opacity final
{
public:
	float                                         L_Focus_Strength;                                  // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                L_Location;                                        // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Rank_Opacity_L;                                    // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Info_Opacity_L;                                    // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         L_Distance;                                        // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetTargetDistance_Distance;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Get_Tag_Test_Location_Location;           // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_ADS_In_ADS;                           // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetContentColor_BOTTOM_ReturnValue;       // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetContentColor_TOP_ReturnValue;          // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetScreenLocation_NewParam;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DotProductToCam_Dot;                      // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FMin_ReturnValue_1;                       // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_1;            // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_2;            // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FInterpTo_Constant_ReturnValue;           // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Get_ADS_In_ADS_1;                         // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_MapRangeClamped_ReturnValue_2;            // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_Constant_ReturnValue_1;         // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_1;                           // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_2;                           // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_3;            // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue_4;            // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_2;                // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_2;                     // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_NameTag_C_Update_Opacity) == 0x000004, "Wrong alignment on UMG_NameTag_C_Update_Opacity");
static_assert(sizeof(UMG_NameTag_C_Update_Opacity) == 0x0000C4, "Wrong size on UMG_NameTag_C_Update_Opacity");
static_assert(offsetof(UMG_NameTag_C_Update_Opacity, L_Focus_Strength) == 0x000000, "Member 'UMG_NameTag_C_Update_Opacity::L_Focus_Strength' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Update_Opacity, L_Location) == 0x000004, "Member 'UMG_NameTag_C_Update_Opacity::L_Location' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Update_Opacity, Rank_Opacity_L) == 0x000010, "Member 'UMG_NameTag_C_Update_Opacity::Rank_Opacity_L' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Update_Opacity, Info_Opacity_L) == 0x000014, "Member 'UMG_NameTag_C_Update_Opacity::Info_Opacity_L' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Update_Opacity, L_Distance) == 0x000018, "Member 'UMG_NameTag_C_Update_Opacity::L_Distance' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Update_Opacity, Temp_bool_Variable) == 0x00001C, "Member 'UMG_NameTag_C_Update_Opacity::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Update_Opacity, Temp_bool_Variable_1) == 0x00001D, "Member 'UMG_NameTag_C_Update_Opacity::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Update_Opacity, Temp_bool_Variable_2) == 0x00001E, "Member 'UMG_NameTag_C_Update_Opacity::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Update_Opacity, CallFunc_IsValid_ReturnValue) == 0x00001F, "Member 'UMG_NameTag_C_Update_Opacity::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Update_Opacity, CallFunc_GetTargetDistance_Distance) == 0x000020, "Member 'UMG_NameTag_C_Update_Opacity::CallFunc_GetTargetDistance_Distance' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Update_Opacity, CallFunc_Get_Tag_Test_Location_Location) == 0x000024, "Member 'UMG_NameTag_C_Update_Opacity::CallFunc_Get_Tag_Test_Location_Location' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Update_Opacity, CallFunc_FMin_ReturnValue) == 0x000030, "Member 'UMG_NameTag_C_Update_Opacity::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Update_Opacity, CallFunc_Get_ADS_In_ADS) == 0x000034, "Member 'UMG_NameTag_C_Update_Opacity::CallFunc_Get_ADS_In_ADS' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Update_Opacity, CallFunc_GetContentColor_BOTTOM_ReturnValue) == 0x000038, "Member 'UMG_NameTag_C_Update_Opacity::CallFunc_GetContentColor_BOTTOM_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Update_Opacity, CallFunc_GetContentColor_TOP_ReturnValue) == 0x000048, "Member 'UMG_NameTag_C_Update_Opacity::CallFunc_GetContentColor_TOP_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Update_Opacity, CallFunc_GetScreenLocation_NewParam) == 0x000058, "Member 'UMG_NameTag_C_Update_Opacity::CallFunc_GetScreenLocation_NewParam' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Update_Opacity, CallFunc_DotProductToCam_Dot) == 0x000060, "Member 'UMG_NameTag_C_Update_Opacity::CallFunc_DotProductToCam_Dot' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Update_Opacity, CallFunc_FClamp_ReturnValue) == 0x000064, "Member 'UMG_NameTag_C_Update_Opacity::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Update_Opacity, CallFunc_IsValid_ReturnValue_1) == 0x000068, "Member 'UMG_NameTag_C_Update_Opacity::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Update_Opacity, CallFunc_FMin_ReturnValue_1) == 0x00006C, "Member 'UMG_NameTag_C_Update_Opacity::CallFunc_FMin_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Update_Opacity, CallFunc_Less_FloatFloat_ReturnValue) == 0x000070, "Member 'UMG_NameTag_C_Update_Opacity::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Update_Opacity, K2Node_Select_Default) == 0x000074, "Member 'UMG_NameTag_C_Update_Opacity::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Update_Opacity, CallFunc_MapRangeClamped_ReturnValue) == 0x000078, "Member 'UMG_NameTag_C_Update_Opacity::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Update_Opacity, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x00007C, "Member 'UMG_NameTag_C_Update_Opacity::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Update_Opacity, CallFunc_SelectFloat_ReturnValue) == 0x000080, "Member 'UMG_NameTag_C_Update_Opacity::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Update_Opacity, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000084, "Member 'UMG_NameTag_C_Update_Opacity::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Update_Opacity, CallFunc_MapRangeClamped_ReturnValue_1) == 0x000088, "Member 'UMG_NameTag_C_Update_Opacity::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Update_Opacity, CallFunc_Less_FloatFloat_ReturnValue_2) == 0x00008C, "Member 'UMG_NameTag_C_Update_Opacity::CallFunc_Less_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Update_Opacity, CallFunc_FInterpTo_Constant_ReturnValue) == 0x000090, "Member 'UMG_NameTag_C_Update_Opacity::CallFunc_FInterpTo_Constant_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Update_Opacity, CallFunc_SelectFloat_ReturnValue_1) == 0x000094, "Member 'UMG_NameTag_C_Update_Opacity::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Update_Opacity, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x000098, "Member 'UMG_NameTag_C_Update_Opacity::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Update_Opacity, CallFunc_Get_ADS_In_ADS_1) == 0x00009C, "Member 'UMG_NameTag_C_Update_Opacity::CallFunc_Get_ADS_In_ADS_1' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Update_Opacity, CallFunc_MapRangeClamped_ReturnValue_2) == 0x0000A0, "Member 'UMG_NameTag_C_Update_Opacity::CallFunc_MapRangeClamped_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Update_Opacity, CallFunc_FInterpTo_Constant_ReturnValue_1) == 0x0000A4, "Member 'UMG_NameTag_C_Update_Opacity::CallFunc_FInterpTo_Constant_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Update_Opacity, K2Node_Select_Default_1) == 0x0000A8, "Member 'UMG_NameTag_C_Update_Opacity::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Update_Opacity, CallFunc_FClamp_ReturnValue_1) == 0x0000AC, "Member 'UMG_NameTag_C_Update_Opacity::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Update_Opacity, K2Node_Select_Default_2) == 0x0000B0, "Member 'UMG_NameTag_C_Update_Opacity::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Update_Opacity, CallFunc_MapRangeClamped_ReturnValue_3) == 0x0000B4, "Member 'UMG_NameTag_C_Update_Opacity::CallFunc_MapRangeClamped_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Update_Opacity, CallFunc_MapRangeClamped_ReturnValue_4) == 0x0000B8, "Member 'UMG_NameTag_C_Update_Opacity::CallFunc_MapRangeClamped_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Update_Opacity, CallFunc_SelectFloat_ReturnValue_2) == 0x0000BC, "Member 'UMG_NameTag_C_Update_Opacity::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Update_Opacity, CallFunc_FClamp_ReturnValue_2) == 0x0000C0, "Member 'UMG_NameTag_C_Update_Opacity::CallFunc_FClamp_ReturnValue_2' has a wrong offset!");

// Function UMG_NameTag.UMG_NameTag_C.Find Target
// 0x00E0 (0x00E0 - 0x0000)
struct UMG_NameTag_C_Find_Target final
{
public:
	float                                         BestTargetDotProduct;                              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BestTargetLocation;                                // 0x0004(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASQPlayerState*                         My_SL_State;                                       // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  Test_Target;                                       // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class APawn*>                          Test_Array;                                        // 0x0020(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class APawn*                                  Best_Target;                                       // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetCurrentPawn_ReturnValue;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISQNameTagInterface>   K2Node_DynamicCast_AsSQName_Tag_Interface;         // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class ASQVehicle*                       CallFunc_NameTagGetVehicle_ReturnValue;            // 0x0068(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73[0x1];                                       // 0x0073(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Get_Tag_Test_Location_Location;           // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DotProductToCam_Dot;                      // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9E[0x2];                                       // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetScreenLocation_NewParam;               // 0x00A4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_1;      // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x00AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x00AF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TScriptInterface<class ISQNameTagInterface>   K2Node_DynamicCast_AsSQName_Tag_Interface_1;       // 0x00B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_NameTagGetMaxDistanceWhenNotAlive_ReturnValue; // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class ASQVehicle*                       CallFunc_NameTagGetVehicle_ReturnValue_1;          // 0x00C8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NameTagIsAlive_ReturnValue;               // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D3[0x1];                                       // 0x00D3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTargetDistance_Distance;               // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_NameTag_C_Find_Target) == 0x000008, "Wrong alignment on UMG_NameTag_C_Find_Target");
static_assert(sizeof(UMG_NameTag_C_Find_Target) == 0x0000E0, "Wrong size on UMG_NameTag_C_Find_Target");
static_assert(offsetof(UMG_NameTag_C_Find_Target, BestTargetDotProduct) == 0x000000, "Member 'UMG_NameTag_C_Find_Target::BestTargetDotProduct' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Find_Target, BestTargetLocation) == 0x000004, "Member 'UMG_NameTag_C_Find_Target::BestTargetLocation' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Find_Target, My_SL_State) == 0x000010, "Member 'UMG_NameTag_C_Find_Target::My_SL_State' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Find_Target, Test_Target) == 0x000018, "Member 'UMG_NameTag_C_Find_Target::Test_Target' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Find_Target, Test_Array) == 0x000020, "Member 'UMG_NameTag_C_Find_Target::Test_Array' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Find_Target, Best_Target) == 0x000030, "Member 'UMG_NameTag_C_Find_Target::Best_Target' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Find_Target, Temp_int_Array_Index_Variable) == 0x000038, "Member 'UMG_NameTag_C_Find_Target::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Find_Target, CallFunc_IsValid_ReturnValue) == 0x00003C, "Member 'UMG_NameTag_C_Find_Target::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Find_Target, CallFunc_IsValid_ReturnValue_1) == 0x00003D, "Member 'UMG_NameTag_C_Find_Target::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Find_Target, CallFunc_GetCurrentPawn_ReturnValue) == 0x000040, "Member 'UMG_NameTag_C_Find_Target::CallFunc_GetCurrentPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Find_Target, CallFunc_IsValid_ReturnValue_2) == 0x000048, "Member 'UMG_NameTag_C_Find_Target::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Find_Target, K2Node_DynamicCast_AsSQName_Tag_Interface) == 0x000050, "Member 'UMG_NameTag_C_Find_Target::K2Node_DynamicCast_AsSQName_Tag_Interface' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Find_Target, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'UMG_NameTag_C_Find_Target::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Find_Target, CallFunc_NameTagGetVehicle_ReturnValue) == 0x000068, "Member 'UMG_NameTag_C_Find_Target::CallFunc_NameTagGetVehicle_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Find_Target, CallFunc_IsValid_ReturnValue_3) == 0x000070, "Member 'UMG_NameTag_C_Find_Target::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Find_Target, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000071, "Member 'UMG_NameTag_C_Find_Target::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Find_Target, CallFunc_IsValid_ReturnValue_4) == 0x000072, "Member 'UMG_NameTag_C_Find_Target::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Find_Target, CallFunc_Get_Tag_Test_Location_Location) == 0x000074, "Member 'UMG_NameTag_C_Find_Target::CallFunc_Get_Tag_Test_Location_Location' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Find_Target, CallFunc_DotProductToCam_Dot) == 0x000080, "Member 'UMG_NameTag_C_Find_Target::CallFunc_DotProductToCam_Dot' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Find_Target, CallFunc_Array_Get_Item) == 0x000088, "Member 'UMG_NameTag_C_Find_Target::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Find_Target, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000090, "Member 'UMG_NameTag_C_Find_Target::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Find_Target, CallFunc_Array_Length_ReturnValue) == 0x000094, "Member 'UMG_NameTag_C_Find_Target::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Find_Target, Temp_int_Loop_Counter_Variable) == 0x000098, "Member 'UMG_NameTag_C_Find_Target::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Find_Target, CallFunc_IsValid_ReturnValue_5) == 0x00009C, "Member 'UMG_NameTag_C_Find_Target::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Find_Target, CallFunc_Less_IntInt_ReturnValue) == 0x00009D, "Member 'UMG_NameTag_C_Find_Target::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Find_Target, CallFunc_Add_IntInt_ReturnValue) == 0x0000A0, "Member 'UMG_NameTag_C_Find_Target::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Find_Target, CallFunc_GetScreenLocation_NewParam) == 0x0000A4, "Member 'UMG_NameTag_C_Find_Target::CallFunc_GetScreenLocation_NewParam' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Find_Target, CallFunc_IsValid_ReturnValue_6) == 0x0000AC, "Member 'UMG_NameTag_C_Find_Target::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Find_Target, CallFunc_NotEqual_ObjectObject_ReturnValue_1) == 0x0000AD, "Member 'UMG_NameTag_C_Find_Target::CallFunc_NotEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Find_Target, CallFunc_IsValid_ReturnValue_7) == 0x0000AE, "Member 'UMG_NameTag_C_Find_Target::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Find_Target, CallFunc_IsValid_ReturnValue_8) == 0x0000AF, "Member 'UMG_NameTag_C_Find_Target::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Find_Target, K2Node_DynamicCast_AsSQName_Tag_Interface_1) == 0x0000B0, "Member 'UMG_NameTag_C_Find_Target::K2Node_DynamicCast_AsSQName_Tag_Interface_1' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Find_Target, K2Node_DynamicCast_bSuccess_1) == 0x0000C0, "Member 'UMG_NameTag_C_Find_Target::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Find_Target, CallFunc_NameTagGetMaxDistanceWhenNotAlive_ReturnValue) == 0x0000C4, "Member 'UMG_NameTag_C_Find_Target::CallFunc_NameTagGetMaxDistanceWhenNotAlive_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Find_Target, CallFunc_NameTagGetVehicle_ReturnValue_1) == 0x0000C8, "Member 'UMG_NameTag_C_Find_Target::CallFunc_NameTagGetVehicle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Find_Target, CallFunc_NameTagIsAlive_ReturnValue) == 0x0000D0, "Member 'UMG_NameTag_C_Find_Target::CallFunc_NameTagIsAlive_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Find_Target, CallFunc_IsValid_ReturnValue_9) == 0x0000D1, "Member 'UMG_NameTag_C_Find_Target::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Find_Target, CallFunc_Not_PreBool_ReturnValue) == 0x0000D2, "Member 'UMG_NameTag_C_Find_Target::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Find_Target, CallFunc_GetTargetDistance_Distance) == 0x0000D4, "Member 'UMG_NameTag_C_Find_Target::CallFunc_GetTargetDistance_Distance' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Find_Target, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0000D8, "Member 'UMG_NameTag_C_Find_Target::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Find_Target, CallFunc_BooleanAND_ReturnValue) == 0x0000D9, "Member 'UMG_NameTag_C_Find_Target::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Find_Target, CallFunc_BooleanOR_ReturnValue) == 0x0000DA, "Member 'UMG_NameTag_C_Find_Target::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function UMG_NameTag.UMG_NameTag_C.Get ADS
// 0x0020 (0x0020 - 0x0000)
struct UMG_NameTag_C_Get_ADS final
{
public:
	bool                                          In_ADS;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ASQEquipableItem*                       CallFunc_GetCurrentWeapon_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASQWeapon*                              K2Node_DynamicCast_AsSQWeapon;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_NameTag_C_Get_ADS) == 0x000008, "Wrong alignment on UMG_NameTag_C_Get_ADS");
static_assert(sizeof(UMG_NameTag_C_Get_ADS) == 0x000020, "Wrong size on UMG_NameTag_C_Get_ADS");
static_assert(offsetof(UMG_NameTag_C_Get_ADS, In_ADS) == 0x000000, "Member 'UMG_NameTag_C_Get_ADS::In_ADS' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Get_ADS, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'UMG_NameTag_C_Get_ADS::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Get_ADS, CallFunc_IsValid_ReturnValue_1) == 0x000002, "Member 'UMG_NameTag_C_Get_ADS::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Get_ADS, CallFunc_GetCurrentWeapon_ReturnValue) == 0x000008, "Member 'UMG_NameTag_C_Get_ADS::CallFunc_GetCurrentWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Get_ADS, K2Node_DynamicCast_AsSQWeapon) == 0x000010, "Member 'UMG_NameTag_C_Get_ADS::K2Node_DynamicCast_AsSQWeapon' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Get_ADS, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'UMG_NameTag_C_Get_ADS::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_NameTag_C_Get_ADS, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000019, "Member 'UMG_NameTag_C_Get_ADS::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function UMG_NameTag.UMG_NameTag_C.Get_Kit_Image
// 0x0418 (0x0418 - 0x0000)
struct UMG_NameTag_C_Get_Kit_Image final
{
public:
	struct FSlateBrush                            ReturnValue;                                       // 0x0000(0x0088)(Parm, OutParm, ReturnParm)
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue;         // 0x0088(0x0088)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_SQRoleSettings_C*                   K2Node_DynamicCast_AsBP_SQRole_Settings;           // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetRoleEntry_Success;                     // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_123[0x5];                                      // 0x0123(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFSQRoleEntry                          CallFunc_GetRoleEntry_RoleEntry;                   // 0x0128(0x00C0)(HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EA[0x6];                                      // 0x01EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue_1;       // 0x0210(0x0088)()
