#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_TicketChangeIcon

#include "Basic.hpp"


namespace SDK::Params
{

// Function UMG_TicketChangeIcon.UMG_TicketChangeIcon_C.ExecuteUbergraph_UMG_TicketChangeIcon
// 0x0004 (0x0004 - 0x0000)
struct UMG_TicketChangeIcon_C_ExecuteUbergraph_UMG_TicketChangeIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_TicketChangeIcon_C_ExecuteUbergraph_UMG_TicketChangeIcon) == 0x000004, "Wrong alignment on UMG_TicketChangeIcon_C_ExecuteUbergraph_UMG_TicketChangeIcon");
static_assert(sizeof(UMG_TicketChangeIcon_C_ExecuteUbergraph_UMG_TicketChangeIcon) == 0x000004, "Wrong size on UMG_TicketChangeIcon_C_ExecuteUbergraph_UMG_TicketChangeIcon");
static_assert(offsetof(UMG_TicketChangeIcon_C_ExecuteUbergraph_UMG_TicketChangeIcon, EntryPoint) == 0x000000, "Member 'UMG_TicketChangeIcon_C_ExecuteUbergraph_UMG_TicketChangeIcon::EntryPoint' has a wrong offset!");

// Function UMG_TicketChangeIcon.UMG_TicketChangeIcon_C.UpdateIcon
// 0x0030 (0x0030 - 0x0000)
struct UMG_TicketChangeIcon_C_UpdateIcon final
{
public:
	TSoftObjectPtr<class UTexture2D>              CallFunc_Map_Find_Value;                           // 0x0000(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_TicketChangeIcon_C_UpdateIcon) == 0x000008, "Wrong alignment on UMG_TicketChangeIcon_C_UpdateIcon");
static_assert(sizeof(UMG_TicketChangeIcon_C_UpdateIcon) == 0x000030, "Wrong size on UMG_TicketChangeIcon_C_UpdateIcon");
static_assert(offsetof(UMG_TicketChangeIcon_C_UpdateIcon, CallFunc_Map_Find_Value) == 0x000000, "Member 'UMG_TicketChangeIcon_C_UpdateIcon::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(UMG_TicketChangeIcon_C_UpdateIcon, CallFunc_Map_Find_ReturnValue) == 0x000028, "Member 'UMG_TicketChangeIcon_C_UpdateIcon::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function UMG_TicketChangeIcon.UMG_TicketChangeIcon_C.ChangeIcon
// 0x0028 (0x0028 - 0x0000)
struct UMG_TicketChangeIcon_C_ChangeIcon final
{
public:
	TSoftObjectPtr<class UTexture2D>              NewIcon;                                           // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(UMG_TicketChangeIcon_C_ChangeIcon) == 0x000008, "Wrong alignment on UMG_TicketChangeIcon_C_ChangeIcon");
static_assert(sizeof(UMG_TicketChangeIcon_C_ChangeIcon) == 0x000028, "Wrong size on UMG_TicketChangeIcon_C_ChangeIcon");
static_assert(offsetof(UMG_TicketChangeIcon_C_ChangeIcon, NewIcon) == 0x000000, "Member 'UMG_TicketChangeIcon_C_ChangeIcon::NewIcon' has a wrong offset!");

}

