#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_Scoreboard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Squad_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_Scoreboard.UMG_Scoreboard_C
// 0x0088 (0x03A0 - 0x0318)
class UUMG_Scoreboard_C final : public USQScoreboard
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Blink;                                             // 0x0320(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UUMG_ScoreboardTeam_C*                  BPScoreboardEnemy;                                 // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ScoreboardTeam_C*                  BPScoreboardFriendly;                              // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_0;                                   // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   TickRateText;                                      // 0x0340(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         CurrentGameTime;                                   // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DefaultFavoriteText;                               // 0x0360(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   MarkFavoriteText;                                  // 0x0378(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          SquadVoipOnly;                                     // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          EndGame;                                           // 0x0391(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_392[0x6];                                      // 0x0392(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextBlock*                             TimerText;                                         // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_Scoreboard(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void BPInit();
	void Destruct();
	void Play_Fade_Animation();
	void CustomTickEvent();
	void UpdateServerFPSText();
	void UpdateScaling();
	void SwitchToEndRound();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_Scoreboard_C">();
	}
	static class UUMG_Scoreboard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_Scoreboard_C>();
	}
};
static_assert(alignof(UUMG_Scoreboard_C) == 0x000008, "Wrong alignment on UUMG_Scoreboard_C");
static_assert(sizeof(UUMG_Scoreboard_C) == 0x0003A0, "Wrong size on UUMG_Scoreboard_C");
static_assert(offsetof(UUMG_Scoreboard_C, UberGraphFrame) == 0x000318, "Member 'UUMG_Scoreboard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_Scoreboard_C, Blink) == 0x000320, "Member 'UUMG_Scoreboard_C::Blink' has a wrong offset!");
static_assert(offsetof(UUMG_Scoreboard_C, BPScoreboardEnemy) == 0x000328, "Member 'UUMG_Scoreboard_C::BPScoreboardEnemy' has a wrong offset!");
static_assert(offsetof(UUMG_Scoreboard_C, BPScoreboardFriendly) == 0x000330, "Member 'UUMG_Scoreboard_C::BPScoreboardFriendly' has a wrong offset!");
static_assert(offsetof(UUMG_Scoreboard_C, HorizontalBox_0) == 0x000338, "Member 'UUMG_Scoreboard_C::HorizontalBox_0' has a wrong offset!");
static_assert(offsetof(UUMG_Scoreboard_C, TickRateText) == 0x000340, "Member 'UUMG_Scoreboard_C::TickRateText' has a wrong offset!");
static_assert(offsetof(UUMG_Scoreboard_C, CurrentGameTime) == 0x000358, "Member 'UUMG_Scoreboard_C::CurrentGameTime' has a wrong offset!");
static_assert(offsetof(UUMG_Scoreboard_C, DefaultFavoriteText) == 0x000360, "Member 'UUMG_Scoreboard_C::DefaultFavoriteText' has a wrong offset!");
static_assert(offsetof(UUMG_Scoreboard_C, MarkFavoriteText) == 0x000378, "Member 'UUMG_Scoreboard_C::MarkFavoriteText' has a wrong offset!");
static_assert(offsetof(UUMG_Scoreboard_C, SquadVoipOnly) == 0x000390, "Member 'UUMG_Scoreboard_C::SquadVoipOnly' has a wrong offset!");
static_assert(offsetof(UUMG_Scoreboard_C, EndGame) == 0x000391, "Member 'UUMG_Scoreboard_C::EndGame' has a wrong offset!");
static_assert(offsetof(UUMG_Scoreboard_C, TimerText) == 0x000398, "Member 'UUMG_Scoreboard_C::TimerText' has a wrong offset!");

}

