#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_TimelineTooltipList

#include "Basic.hpp"

#include "SQVehicleEntry_structs.hpp"
#include "Squad_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UMG_TimelineTooltipList.UMG_TimelineTooltipList_C.ExecuteUbergraph_UMG_TimelineTooltipList
// 0x0004 (0x0004 - 0x0000)
struct UMG_TimelineTooltipList_C_ExecuteUbergraph_UMG_TimelineTooltipList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_TimelineTooltipList_C_ExecuteUbergraph_UMG_TimelineTooltipList) == 0x000004, "Wrong alignment on UMG_TimelineTooltipList_C_ExecuteUbergraph_UMG_TimelineTooltipList");
static_assert(sizeof(UMG_TimelineTooltipList_C_ExecuteUbergraph_UMG_TimelineTooltipList) == 0x000004, "Wrong size on UMG_TimelineTooltipList_C_ExecuteUbergraph_UMG_TimelineTooltipList");
static_assert(offsetof(UMG_TimelineTooltipList_C_ExecuteUbergraph_UMG_TimelineTooltipList, EntryPoint) == 0x000000, "Member 'UMG_TimelineTooltipList_C_ExecuteUbergraph_UMG_TimelineTooltipList::EntryPoint' has a wrong offset!");

// Function UMG_TimelineTooltipList.UMG_TimelineTooltipList_C.SetTicketsValue
// 0x0020 (0x0020 - 0x0000)
struct UMG_TimelineTooltipList_C_SetTicketsValue final
{
public:
	int32                                         Tickets;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
};
static_assert(alignof(UMG_TimelineTooltipList_C_SetTicketsValue) == 0x000008, "Wrong alignment on UMG_TimelineTooltipList_C_SetTicketsValue");
static_assert(sizeof(UMG_TimelineTooltipList_C_SetTicketsValue) == 0x000020, "Wrong size on UMG_TimelineTooltipList_C_SetTicketsValue");
static_assert(offsetof(UMG_TimelineTooltipList_C_SetTicketsValue, Tickets) == 0x000000, "Member 'UMG_TimelineTooltipList_C_SetTicketsValue::Tickets' has a wrong offset!");
static_assert(offsetof(UMG_TimelineTooltipList_C_SetTicketsValue, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'UMG_TimelineTooltipList_C_SetTicketsValue::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function UMG_TimelineTooltipList.UMG_TimelineTooltipList_C.ShowSeparator
// 0x0005 (0x0005 - 0x0000)
struct UMG_TimelineTooltipList_C_ShowSeparator final
{
public:
	bool                                          Index_0;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_TimelineTooltipList_C_ShowSeparator) == 0x000001, "Wrong alignment on UMG_TimelineTooltipList_C_ShowSeparator");
static_assert(sizeof(UMG_TimelineTooltipList_C_ShowSeparator) == 0x000005, "Wrong size on UMG_TimelineTooltipList_C_ShowSeparator");
static_assert(offsetof(UMG_TimelineTooltipList_C_ShowSeparator, Index_0) == 0x000000, "Member 'UMG_TimelineTooltipList_C_ShowSeparator::Index_0' has a wrong offset!");
static_assert(offsetof(UMG_TimelineTooltipList_C_ShowSeparator, Temp_bool_Variable) == 0x000001, "Member 'UMG_TimelineTooltipList_C_ShowSeparator::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UMG_TimelineTooltipList_C_ShowSeparator, Temp_byte_Variable) == 0x000002, "Member 'UMG_TimelineTooltipList_C_ShowSeparator::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UMG_TimelineTooltipList_C_ShowSeparator, Temp_byte_Variable_1) == 0x000003, "Member 'UMG_TimelineTooltipList_C_ShowSeparator::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_TimelineTooltipList_C_ShowSeparator, K2Node_Select_Default) == 0x000004, "Member 'UMG_TimelineTooltipList_C_ShowSeparator::K2Node_Select_Default' has a wrong offset!");

// Function UMG_TimelineTooltipList.UMG_TimelineTooltipList_C.FillEvents
// 0x00D8 (0x00D8 - 0x0000)
struct UMG_TimelineTooltipList_C_FillEvents final
{
public:
	int32                                         TeamId;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Events;                                            // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class USQEndStatsComponent*                   EndRoundComp;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TicketsPoint;                                      // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSQTicketChangeLinked>          CallFunc_GetTeamTimelineData_ReturnValue;          // 0x0030(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTeamTicketsTimeline_ReturnValue;       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTeamTicketsTimeline_ReturnValue_1;     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_TimelineTooltipElement_C*          CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Identical_ReturnValue;              // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E[0x2];                                       // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class USQStatsCollectorSubsystem*             CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSQTicketsSummaryVehicleRecord> CallFunc_GroupTickets_OutGroup;                    // 0x0078(0x0010)(ReferenceParm)
	class UUMG_TimelineTooltipElement_C*          CallFunc_Create_ReturnValue;                       // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetElementText_NewText;                   // 0x00A0(0x0018)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_TimelineTooltipList_C_FillEvents) == 0x000008, "Wrong alignment on UMG_TimelineTooltipList_C_FillEvents");
static_assert(sizeof(UMG_TimelineTooltipList_C_FillEvents) == 0x0000D8, "Wrong size on UMG_TimelineTooltipList_C_FillEvents");
static_assert(offsetof(UMG_TimelineTooltipList_C_FillEvents, TeamId) == 0x000000, "Member 'UMG_TimelineTooltipList_C_FillEvents::TeamId' has a wrong offset!");
static_assert(offsetof(UMG_TimelineTooltipList_C_FillEvents, Events) == 0x000008, "Member 'UMG_TimelineTooltipList_C_FillEvents::Events' has a wrong offset!");
static_assert(offsetof(UMG_TimelineTooltipList_C_FillEvents, EndRoundComp) == 0x000018, "Member 'UMG_TimelineTooltipList_C_FillEvents::EndRoundComp' has a wrong offset!");
static_assert(offsetof(UMG_TimelineTooltipList_C_FillEvents, TicketsPoint) == 0x000020, "Member 'UMG_TimelineTooltipList_C_FillEvents::TicketsPoint' has a wrong offset!");
static_assert(offsetof(UMG_TimelineTooltipList_C_FillEvents, CallFunc_Conv_IntToByte_ReturnValue) == 0x000024, "Member 'UMG_TimelineTooltipList_C_FillEvents::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_TimelineTooltipList_C_FillEvents, Temp_int_Variable) == 0x000028, "Member 'UMG_TimelineTooltipList_C_FillEvents::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(UMG_TimelineTooltipList_C_FillEvents, CallFunc_GetTeamTimelineData_ReturnValue) == 0x000030, "Member 'UMG_TimelineTooltipList_C_FillEvents::CallFunc_GetTeamTimelineData_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_TimelineTooltipList_C_FillEvents, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'UMG_TimelineTooltipList_C_FillEvents::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_TimelineTooltipList_C_FillEvents, CallFunc_GetTeamTicketsTimeline_ReturnValue) == 0x000044, "Member 'UMG_TimelineTooltipList_C_FillEvents::CallFunc_GetTeamTicketsTimeline_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_TimelineTooltipList_C_FillEvents, CallFunc_GetTeamTicketsTimeline_ReturnValue_1) == 0x000048, "Member 'UMG_TimelineTooltipList_C_FillEvents::CallFunc_GetTeamTicketsTimeline_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_TimelineTooltipList_C_FillEvents, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'UMG_TimelineTooltipList_C_FillEvents::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_TimelineTooltipList_C_FillEvents, CallFunc_Greater_IntInt_ReturnValue) == 0x000050, "Member 'UMG_TimelineTooltipList_C_FillEvents::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_TimelineTooltipList_C_FillEvents, Temp_int_Array_Index_Variable) == 0x000054, "Member 'UMG_TimelineTooltipList_C_FillEvents::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_TimelineTooltipList_C_FillEvents, Temp_int_Loop_Counter_Variable) == 0x000058, "Member 'UMG_TimelineTooltipList_C_FillEvents::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_TimelineTooltipList_C_FillEvents, CallFunc_Add_IntInt_ReturnValue_1) == 0x00005C, "Member 'UMG_TimelineTooltipList_C_FillEvents::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_TimelineTooltipList_C_FillEvents, CallFunc_Array_Get_Item) == 0x000060, "Member 'UMG_TimelineTooltipList_C_FillEvents::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_TimelineTooltipList_C_FillEvents, CallFunc_Array_Length_ReturnValue_1) == 0x000068, "Member 'UMG_TimelineTooltipList_C_FillEvents::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_TimelineTooltipList_C_FillEvents, CallFunc_Less_IntInt_ReturnValue) == 0x00006C, "Member 'UMG_TimelineTooltipList_C_FillEvents::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_TimelineTooltipList_C_FillEvents, CallFunc_Array_Identical_ReturnValue) == 0x00006D, "Member 'UMG_TimelineTooltipList_C_FillEvents::CallFunc_Array_Identical_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_TimelineTooltipList_C_FillEvents, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000070, "Member 'UMG_TimelineTooltipList_C_FillEvents::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_TimelineTooltipList_C_FillEvents, CallFunc_GroupTickets_OutGroup) == 0x000078, "Member 'UMG_TimelineTooltipList_C_FillEvents::CallFunc_GroupTickets_OutGroup' has a wrong offset!");
static_assert(offsetof(UMG_TimelineTooltipList_C_FillEvents, CallFunc_Create_ReturnValue) == 0x000088, "Member 'UMG_TimelineTooltipList_C_FillEvents::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_TimelineTooltipList_C_FillEvents, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000090, "Member 'UMG_TimelineTooltipList_C_FillEvents::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_TimelineTooltipList_C_FillEvents, CallFunc_Multiply_IntInt_ReturnValue) == 0x000098, "Member 'UMG_TimelineTooltipList_C_FillEvents::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_TimelineTooltipList_C_FillEvents, CallFunc_GetElementText_NewText) == 0x0000A0, "Member 'UMG_TimelineTooltipList_C_FillEvents::CallFunc_GetElementText_NewText' has a wrong offset!");
static_assert(offsetof(UMG_TimelineTooltipList_C_FillEvents, CallFunc_Array_Add_ReturnValue) == 0x0000B8, "Member 'UMG_TimelineTooltipList_C_FillEvents::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_TimelineTooltipList_C_FillEvents, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0000BC, "Member 'UMG_TimelineTooltipList_C_FillEvents::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_TimelineTooltipList_C_FillEvents, CallFunc_Array_Length_ReturnValue_2) == 0x0000C0, "Member 'UMG_TimelineTooltipList_C_FillEvents::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_TimelineTooltipList_C_FillEvents, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000C4, "Member 'UMG_TimelineTooltipList_C_FillEvents::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_TimelineTooltipList_C_FillEvents, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000C8, "Member 'UMG_TimelineTooltipList_C_FillEvents::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_TimelineTooltipList_C_FillEvents, CallFunc_Array_Length_ReturnValue_3) == 0x0000CC, "Member 'UMG_TimelineTooltipList_C_FillEvents::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_TimelineTooltipList_C_FillEvents, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0000D0, "Member 'UMG_TimelineTooltipList_C_FillEvents::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");

// Function UMG_TimelineTooltipList.UMG_TimelineTooltipList_C.GetElementText
// 0x0130 (0x0130 - 0x0000)
struct UMG_TimelineTooltipList_C_GetElementText final
{
public:
	ESQTicketChangeReason                         ChangeReason;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USQVehicleSettings*                     Vehicle;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   NewText;                                           // 0x0010(0x0018)(Parm, OutParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSQVehicleEntry                        CallFunc_GetDataTableRowFromName_OutRow;           // 0x0030(0x0070)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Map_Find_Value;                           // 0x00A8(0x0018)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00C8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0108(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0118(0x0018)()
};
static_assert(alignof(UMG_TimelineTooltipList_C_GetElementText) == 0x000008, "Wrong alignment on UMG_TimelineTooltipList_C_GetElementText");
static_assert(sizeof(UMG_TimelineTooltipList_C_GetElementText) == 0x000130, "Wrong size on UMG_TimelineTooltipList_C_GetElementText");
static_assert(offsetof(UMG_TimelineTooltipList_C_GetElementText, ChangeReason) == 0x000000, "Member 'UMG_TimelineTooltipList_C_GetElementText::ChangeReason' has a wrong offset!");
static_assert(offsetof(UMG_TimelineTooltipList_C_GetElementText, Vehicle) == 0x000008, "Member 'UMG_TimelineTooltipList_C_GetElementText::Vehicle' has a wrong offset!");
static_assert(offsetof(UMG_TimelineTooltipList_C_GetElementText, NewText) == 0x000010, "Member 'UMG_TimelineTooltipList_C_GetElementText::NewText' has a wrong offset!");
static_assert(offsetof(UMG_TimelineTooltipList_C_GetElementText, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'UMG_TimelineTooltipList_C_GetElementText::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_TimelineTooltipList_C_GetElementText, CallFunc_GetDataTableRowFromName_OutRow) == 0x000030, "Member 'UMG_TimelineTooltipList_C_GetElementText::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(UMG_TimelineTooltipList_C_GetElementText, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000A0, "Member 'UMG_TimelineTooltipList_C_GetElementText::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_TimelineTooltipList_C_GetElementText, CallFunc_Map_Find_Value) == 0x0000A8, "Member 'UMG_TimelineTooltipList_C_GetElementText::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(UMG_TimelineTooltipList_C_GetElementText, CallFunc_Map_Find_ReturnValue) == 0x0000C0, "Member 'UMG_TimelineTooltipList_C_GetElementText::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_TimelineTooltipList_C_GetElementText, K2Node_MakeStruct_FormatArgumentData) == 0x0000C8, "Member 'UMG_TimelineTooltipList_C_GetElementText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(UMG_TimelineTooltipList_C_GetElementText, K2Node_MakeArray_Array) == 0x000108, "Member 'UMG_TimelineTooltipList_C_GetElementText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UMG_TimelineTooltipList_C_GetElementText, CallFunc_Format_ReturnValue) == 0x000118, "Member 'UMG_TimelineTooltipList_C_GetElementText::CallFunc_Format_ReturnValue' has a wrong offset!");

}

