#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_TimelineTooltipList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Squad_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_TimelineTooltipList.UMG_TimelineTooltipList_C
// 0x00A8 (0x0308 - 0x0260)
class UUMG_TimelineTooltipList_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           MainVB;                                            // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_TimelineTooltipElement_C*          TicketsRecord;                                     // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TopSeparator;                                      // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           ListColor;                                         // 0x0280(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          WithSeparator;                                     // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUMG_TimelineTooltipElement_C*>  EventsList;                                        // 0x0298(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<int32>                                 LastPresentedEvents;                               // 0x02A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<ESQTicketChangeReason, class FText>      TicketReasonToText;                                // 0x02B8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_UMG_TimelineTooltipList(int32 EntryPoint);
	void Construct();
	void SetTicketsValue(int32 Tickets);
	void ShowSeparator(bool Index_0);
	void FillEvents(int32& TeamId, TArray<int32>& Events, class USQEndStatsComponent*& EndRoundComp, int32& TicketsPoint);
	void GetElementText(ESQTicketChangeReason ChangeReason, class USQVehicleSettings* Vehicle, class FText* NewText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_TimelineTooltipList_C">();
	}
	static class UUMG_TimelineTooltipList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_TimelineTooltipList_C>();
	}
};
static_assert(alignof(UUMG_TimelineTooltipList_C) == 0x000008, "Wrong alignment on UUMG_TimelineTooltipList_C");
static_assert(sizeof(UUMG_TimelineTooltipList_C) == 0x000308, "Wrong size on UUMG_TimelineTooltipList_C");
static_assert(offsetof(UUMG_TimelineTooltipList_C, UberGraphFrame) == 0x000260, "Member 'UUMG_TimelineTooltipList_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_TimelineTooltipList_C, MainVB) == 0x000268, "Member 'UUMG_TimelineTooltipList_C::MainVB' has a wrong offset!");
static_assert(offsetof(UUMG_TimelineTooltipList_C, TicketsRecord) == 0x000270, "Member 'UUMG_TimelineTooltipList_C::TicketsRecord' has a wrong offset!");
static_assert(offsetof(UUMG_TimelineTooltipList_C, TopSeparator) == 0x000278, "Member 'UUMG_TimelineTooltipList_C::TopSeparator' has a wrong offset!");
static_assert(offsetof(UUMG_TimelineTooltipList_C, ListColor) == 0x000280, "Member 'UUMG_TimelineTooltipList_C::ListColor' has a wrong offset!");
static_assert(offsetof(UUMG_TimelineTooltipList_C, WithSeparator) == 0x000290, "Member 'UUMG_TimelineTooltipList_C::WithSeparator' has a wrong offset!");
static_assert(offsetof(UUMG_TimelineTooltipList_C, EventsList) == 0x000298, "Member 'UUMG_TimelineTooltipList_C::EventsList' has a wrong offset!");
static_assert(offsetof(UUMG_TimelineTooltipList_C, LastPresentedEvents) == 0x0002A8, "Member 'UUMG_TimelineTooltipList_C::LastPresentedEvents' has a wrong offset!");
static_assert(offsetof(UUMG_TimelineTooltipList_C, TicketReasonToText) == 0x0002B8, "Member 'UUMG_TimelineTooltipList_C::TicketReasonToText' has a wrong offset!");

}

