#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_CategoryIcon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_CategoryIcon.UMG_CategoryIcon_C
// 0x00A0 (0x0300 - 0x0260)
class UUMG_CategoryIcon_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                IconBorder;                                        // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IconImage;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               MainSB;                                            // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           MainVB;                                            // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                OuterBorder;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                OutsideBorder;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_27;                                        // 0x0298(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ScoreValue;                                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               TopSB;                                             // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           BackgroundColor;                                   // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              IconTexture;                                       // 0x02C0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UUMG_Tooltip_C*                         MainTooltipWidget;                                 // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OnlyValueMode;                                     // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          WithBackground;                                    // 0x02F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F2[0x2];                                      // 0x02F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         IconImageSize;                                     // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IconImageMinPadding;                               // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_CategoryIcon(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	class UWidget* GetToolTipWidget();
	void GetValueTextWidget(class UTextBlock** ScoreValue_0);
	void SetScoreValue(const class FText& InText);
	void SwitchToValueMode(bool ValueMode);
	void ShowBackground(bool NewShow);
	void SetNewWidth(float& Width);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_CategoryIcon_C">();
	}
	static class UUMG_CategoryIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_CategoryIcon_C>();
	}
};
static_assert(alignof(UUMG_CategoryIcon_C) == 0x000008, "Wrong alignment on UUMG_CategoryIcon_C");
static_assert(sizeof(UUMG_CategoryIcon_C) == 0x000300, "Wrong size on UUMG_CategoryIcon_C");
static_assert(offsetof(UUMG_CategoryIcon_C, UberGraphFrame) == 0x000260, "Member 'UUMG_CategoryIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_CategoryIcon_C, IconBorder) == 0x000268, "Member 'UUMG_CategoryIcon_C::IconBorder' has a wrong offset!");
static_assert(offsetof(UUMG_CategoryIcon_C, IconImage) == 0x000270, "Member 'UUMG_CategoryIcon_C::IconImage' has a wrong offset!");
static_assert(offsetof(UUMG_CategoryIcon_C, MainSB) == 0x000278, "Member 'UUMG_CategoryIcon_C::MainSB' has a wrong offset!");
static_assert(offsetof(UUMG_CategoryIcon_C, MainVB) == 0x000280, "Member 'UUMG_CategoryIcon_C::MainVB' has a wrong offset!");
static_assert(offsetof(UUMG_CategoryIcon_C, OuterBorder) == 0x000288, "Member 'UUMG_CategoryIcon_C::OuterBorder' has a wrong offset!");
static_assert(offsetof(UUMG_CategoryIcon_C, OutsideBorder) == 0x000290, "Member 'UUMG_CategoryIcon_C::OutsideBorder' has a wrong offset!");
static_assert(offsetof(UUMG_CategoryIcon_C, Overlay_27) == 0x000298, "Member 'UUMG_CategoryIcon_C::Overlay_27' has a wrong offset!");
static_assert(offsetof(UUMG_CategoryIcon_C, ScoreValue) == 0x0002A0, "Member 'UUMG_CategoryIcon_C::ScoreValue' has a wrong offset!");
static_assert(offsetof(UUMG_CategoryIcon_C, TopSB) == 0x0002A8, "Member 'UUMG_CategoryIcon_C::TopSB' has a wrong offset!");
static_assert(offsetof(UUMG_CategoryIcon_C, BackgroundColor) == 0x0002B0, "Member 'UUMG_CategoryIcon_C::BackgroundColor' has a wrong offset!");
static_assert(offsetof(UUMG_CategoryIcon_C, IconTexture) == 0x0002C0, "Member 'UUMG_CategoryIcon_C::IconTexture' has a wrong offset!");
static_assert(offsetof(UUMG_CategoryIcon_C, MainTooltipWidget) == 0x0002E8, "Member 'UUMG_CategoryIcon_C::MainTooltipWidget' has a wrong offset!");
static_assert(offsetof(UUMG_CategoryIcon_C, OnlyValueMode) == 0x0002F0, "Member 'UUMG_CategoryIcon_C::OnlyValueMode' has a wrong offset!");
static_assert(offsetof(UUMG_CategoryIcon_C, WithBackground) == 0x0002F1, "Member 'UUMG_CategoryIcon_C::WithBackground' has a wrong offset!");
static_assert(offsetof(UUMG_CategoryIcon_C, IconImageSize) == 0x0002F4, "Member 'UUMG_CategoryIcon_C::IconImageSize' has a wrong offset!");
static_assert(offsetof(UUMG_CategoryIcon_C, IconImageMinPadding) == 0x0002F8, "Member 'UUMG_CategoryIcon_C::IconImageMinPadding' has a wrong offset!");

}

