#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_TimelineTime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_TimelineTime.UMG_TimelineTime_C
// 0x0020 (0x0280 - 0x0260)
class UUMG_TimelineTime_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_32;                                          // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ValueText;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Value;                                             // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_TimelineTime(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_TimelineTime_C">();
	}
	static class UUMG_TimelineTime_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_TimelineTime_C>();
	}
};
static_assert(alignof(UUMG_TimelineTime_C) == 0x000008, "Wrong alignment on UUMG_TimelineTime_C");
static_assert(sizeof(UUMG_TimelineTime_C) == 0x000280, "Wrong size on UUMG_TimelineTime_C");
static_assert(offsetof(UUMG_TimelineTime_C, UberGraphFrame) == 0x000260, "Member 'UUMG_TimelineTime_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_TimelineTime_C, Image_32) == 0x000268, "Member 'UUMG_TimelineTime_C::Image_32' has a wrong offset!");
static_assert(offsetof(UUMG_TimelineTime_C, ValueText) == 0x000270, "Member 'UUMG_TimelineTime_C::ValueText' has a wrong offset!");
static_assert(offsetof(UUMG_TimelineTime_C, Value) == 0x000278, "Member 'UUMG_TimelineTime_C::Value' has a wrong offset!");

}

