#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_ScoreboardTeam

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Squad_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_ScoreboardTeam.UMG_ScoreboardTeam_C
// 0x00C0 (0x04B8 - 0x03F8)
class UUMG_ScoreboardTeam_C final : public USQScoreboardTeam
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BPColoredHeaderBarImage;                           // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                BPColoredHeaderTabImage;                           // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BpPlayerNumberText;                                // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BPPlayerNumberTextEnd;                             // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BPRemainingTicketsText;                            // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ScoreboardTeamScore_C*             BPScoreboardTeamScore;                             // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                             BPSquadsGrid;                                      // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BPTicketIcon;                                      // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BPTicketsNumberTextEnd;                            // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           BPTopVerticalBox;                                  // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ContentScrollBox;                                  // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           EndRoundPlayerVB;                                  // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           MainVB;                                            // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               TicketsSB;                                         // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ScoreboardSquad_C*                 UnassignedPlayers;                                 // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Tooltip_C*                         MainTooltipWidget;                                 // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              UsedFlag;                                          // 0x0480(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	float                                         FixedIconMinOffset;                                // 0x04A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinIconSize;                                       // 0x04AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxIconSize;                                       // 0x04B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_ScoreboardTeam(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void ToggleShowAllStats();
	void SetFactionFlag(const TSoftObjectPtr<class UTexture2D>& NewFlagImage);
	void BPInit();
	void Construct();
	void OnLoaded_6B07FF104521D9D459652EB6AF9ACAC6(class UObject* Loaded);
	void PropagateTooltipWidget();
	class UWidget* CreateNewSquad(class ASQSquadState* NewSquad);
	void SwitchToEndMatchMode();
	void OnNewPlayerWidgetAdded(class USQScoreboardPlayer* WidgetRef);

	float GetDesiredIconCategorySize(const struct FVector2D& NewViewportSize) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_ScoreboardTeam_C">();
	}
	static class UUMG_ScoreboardTeam_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_ScoreboardTeam_C>();
	}
};
static_assert(alignof(UUMG_ScoreboardTeam_C) == 0x000008, "Wrong alignment on UUMG_ScoreboardTeam_C");
static_assert(sizeof(UUMG_ScoreboardTeam_C) == 0x0004B8, "Wrong size on UUMG_ScoreboardTeam_C");
static_assert(offsetof(UUMG_ScoreboardTeam_C, UberGraphFrame) == 0x0003F8, "Member 'UUMG_ScoreboardTeam_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardTeam_C, BPColoredHeaderBarImage) == 0x000400, "Member 'UUMG_ScoreboardTeam_C::BPColoredHeaderBarImage' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardTeam_C, BPColoredHeaderTabImage) == 0x000408, "Member 'UUMG_ScoreboardTeam_C::BPColoredHeaderTabImage' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardTeam_C, BpPlayerNumberText) == 0x000410, "Member 'UUMG_ScoreboardTeam_C::BpPlayerNumberText' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardTeam_C, BPPlayerNumberTextEnd) == 0x000418, "Member 'UUMG_ScoreboardTeam_C::BPPlayerNumberTextEnd' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardTeam_C, BPRemainingTicketsText) == 0x000420, "Member 'UUMG_ScoreboardTeam_C::BPRemainingTicketsText' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardTeam_C, BPScoreboardTeamScore) == 0x000428, "Member 'UUMG_ScoreboardTeam_C::BPScoreboardTeamScore' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardTeam_C, BPSquadsGrid) == 0x000430, "Member 'UUMG_ScoreboardTeam_C::BPSquadsGrid' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardTeam_C, BPTicketIcon) == 0x000438, "Member 'UUMG_ScoreboardTeam_C::BPTicketIcon' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardTeam_C, BPTicketsNumberTextEnd) == 0x000440, "Member 'UUMG_ScoreboardTeam_C::BPTicketsNumberTextEnd' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardTeam_C, BPTopVerticalBox) == 0x000448, "Member 'UUMG_ScoreboardTeam_C::BPTopVerticalBox' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardTeam_C, ContentScrollBox) == 0x000450, "Member 'UUMG_ScoreboardTeam_C::ContentScrollBox' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardTeam_C, EndRoundPlayerVB) == 0x000458, "Member 'UUMG_ScoreboardTeam_C::EndRoundPlayerVB' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardTeam_C, MainVB) == 0x000460, "Member 'UUMG_ScoreboardTeam_C::MainVB' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardTeam_C, TicketsSB) == 0x000468, "Member 'UUMG_ScoreboardTeam_C::TicketsSB' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardTeam_C, UnassignedPlayers) == 0x000470, "Member 'UUMG_ScoreboardTeam_C::UnassignedPlayers' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardTeam_C, MainTooltipWidget) == 0x000478, "Member 'UUMG_ScoreboardTeam_C::MainTooltipWidget' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardTeam_C, UsedFlag) == 0x000480, "Member 'UUMG_ScoreboardTeam_C::UsedFlag' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardTeam_C, FixedIconMinOffset) == 0x0004A8, "Member 'UUMG_ScoreboardTeam_C::FixedIconMinOffset' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardTeam_C, MinIconSize) == 0x0004AC, "Member 'UUMG_ScoreboardTeam_C::MinIconSize' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardTeam_C, MaxIconSize) == 0x0004B0, "Member 'UUMG_ScoreboardTeam_C::MaxIconSize' has a wrong offset!");

}

