#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_ScoreboardPlayer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Squad_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_ScoreboardPlayer.UMG_ScoreboardPlayer_C
// 0x0140 (0x0578 - 0x0438)
class UUMG_ScoreboardPlayer_C final : public USQScoreboardPlayer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0438(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                BackgroundBorder;                                  // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_PlayerSoundStateButton_C*           BP_PlayerSoundStateButton_72;                      // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BPDeathsText;                                      // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         BPEndOfRoundPanel;                                 // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BPFTColorImage;                                    // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BPHealText;                                        // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BPHealthIcon;                                      // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BPIncapsText;                                      // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BPKillsText;                                       // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         BPLeaderHorizontalBox;                             // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BPLeaderIcon;                                      // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BPLeaderText;                                      // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BPObjectivesText;                                  // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BPPingText;                                        // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BPPlayerNameText;                                  // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BPPlayerPrefixText;                                // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BPReviveText;                                      // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BPRoleImage;                                       // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BPScoreText;                                       // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BPTeamworkText;                                    // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BPVehicleImage;                                    // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BPVehicleKillsText;                                // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               DeathSB;                                           // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               HealSB;                                            // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               IncapSB;                                           // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               KillsSB;                                           // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ObjectiveSB;                                       // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               PingSB;                                            // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               PlayerNameSB;                                      // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ReviveSB;                                          // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ScoreSB;                                           // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               TeamworkSB;                                        // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               VehicleKillsSB;                                    // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ASQPlayerController*                    SQ_PC;                                             // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Last_Fireteam_Index;                               // 0x0550(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Last_Fireteam_Color;                               // 0x0554(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StatsSpaceSize;                                    // 0x0564(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_Tooltip_C*                         MainTooltip;                                       // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PlayerNameSize;                                    // 0x0570(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_ScoreboardPlayer(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void UpdateState();
	void BPInit();
	void Construct();
	bool Same_Squad();
	class FText Leader_Text();
	struct FLinearColor FT_Color();
	void Get_Position();
	class UTexture2D* GetRoleIcon();
	void UpdateStatSpace();
	void SwitchToEndMatchMode();
	class UWidget* ShowHealhIconTooltip();
	void SetTooltipWidget(class UUMG_Tooltip_C* InTooltip);
	void RescaleWidget(const float& NewIconSize);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_ScoreboardPlayer_C">();
	}
	static class UUMG_ScoreboardPlayer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_ScoreboardPlayer_C>();
	}
};
static_assert(alignof(UUMG_ScoreboardPlayer_C) == 0x000008, "Wrong alignment on UUMG_ScoreboardPlayer_C");
static_assert(sizeof(UUMG_ScoreboardPlayer_C) == 0x000578, "Wrong size on UUMG_ScoreboardPlayer_C");
static_assert(offsetof(UUMG_ScoreboardPlayer_C, UberGraphFrame) == 0x000438, "Member 'UUMG_ScoreboardPlayer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardPlayer_C, BackgroundBorder) == 0x000440, "Member 'UUMG_ScoreboardPlayer_C::BackgroundBorder' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardPlayer_C, BP_PlayerSoundStateButton_72) == 0x000448, "Member 'UUMG_ScoreboardPlayer_C::BP_PlayerSoundStateButton_72' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardPlayer_C, BPDeathsText) == 0x000450, "Member 'UUMG_ScoreboardPlayer_C::BPDeathsText' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardPlayer_C, BPEndOfRoundPanel) == 0x000458, "Member 'UUMG_ScoreboardPlayer_C::BPEndOfRoundPanel' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardPlayer_C, BPFTColorImage) == 0x000460, "Member 'UUMG_ScoreboardPlayer_C::BPFTColorImage' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardPlayer_C, BPHealText) == 0x000468, "Member 'UUMG_ScoreboardPlayer_C::BPHealText' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardPlayer_C, BPHealthIcon) == 0x000470, "Member 'UUMG_ScoreboardPlayer_C::BPHealthIcon' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardPlayer_C, BPIncapsText) == 0x000478, "Member 'UUMG_ScoreboardPlayer_C::BPIncapsText' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardPlayer_C, BPKillsText) == 0x000480, "Member 'UUMG_ScoreboardPlayer_C::BPKillsText' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardPlayer_C, BPLeaderHorizontalBox) == 0x000488, "Member 'UUMG_ScoreboardPlayer_C::BPLeaderHorizontalBox' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardPlayer_C, BPLeaderIcon) == 0x000490, "Member 'UUMG_ScoreboardPlayer_C::BPLeaderIcon' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardPlayer_C, BPLeaderText) == 0x000498, "Member 'UUMG_ScoreboardPlayer_C::BPLeaderText' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardPlayer_C, BPObjectivesText) == 0x0004A0, "Member 'UUMG_ScoreboardPlayer_C::BPObjectivesText' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardPlayer_C, BPPingText) == 0x0004A8, "Member 'UUMG_ScoreboardPlayer_C::BPPingText' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardPlayer_C, BPPlayerNameText) == 0x0004B0, "Member 'UUMG_ScoreboardPlayer_C::BPPlayerNameText' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardPlayer_C, BPPlayerPrefixText) == 0x0004B8, "Member 'UUMG_ScoreboardPlayer_C::BPPlayerPrefixText' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardPlayer_C, BPReviveText) == 0x0004C0, "Member 'UUMG_ScoreboardPlayer_C::BPReviveText' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardPlayer_C, BPRoleImage) == 0x0004C8, "Member 'UUMG_ScoreboardPlayer_C::BPRoleImage' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardPlayer_C, BPScoreText) == 0x0004D0, "Member 'UUMG_ScoreboardPlayer_C::BPScoreText' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardPlayer_C, BPTeamworkText) == 0x0004D8, "Member 'UUMG_ScoreboardPlayer_C::BPTeamworkText' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardPlayer_C, BPVehicleImage) == 0x0004E0, "Member 'UUMG_ScoreboardPlayer_C::BPVehicleImage' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardPlayer_C, BPVehicleKillsText) == 0x0004E8, "Member 'UUMG_ScoreboardPlayer_C::BPVehicleKillsText' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardPlayer_C, DeathSB) == 0x0004F0, "Member 'UUMG_ScoreboardPlayer_C::DeathSB' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardPlayer_C, HealSB) == 0x0004F8, "Member 'UUMG_ScoreboardPlayer_C::HealSB' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardPlayer_C, IncapSB) == 0x000500, "Member 'UUMG_ScoreboardPlayer_C::IncapSB' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardPlayer_C, KillsSB) == 0x000508, "Member 'UUMG_ScoreboardPlayer_C::KillsSB' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardPlayer_C, ObjectiveSB) == 0x000510, "Member 'UUMG_ScoreboardPlayer_C::ObjectiveSB' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardPlayer_C, PingSB) == 0x000518, "Member 'UUMG_ScoreboardPlayer_C::PingSB' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardPlayer_C, PlayerNameSB) == 0x000520, "Member 'UUMG_ScoreboardPlayer_C::PlayerNameSB' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardPlayer_C, ReviveSB) == 0x000528, "Member 'UUMG_ScoreboardPlayer_C::ReviveSB' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardPlayer_C, ScoreSB) == 0x000530, "Member 'UUMG_ScoreboardPlayer_C::ScoreSB' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardPlayer_C, TeamworkSB) == 0x000538, "Member 'UUMG_ScoreboardPlayer_C::TeamworkSB' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardPlayer_C, VehicleKillsSB) == 0x000540, "Member 'UUMG_ScoreboardPlayer_C::VehicleKillsSB' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardPlayer_C, SQ_PC) == 0x000548, "Member 'UUMG_ScoreboardPlayer_C::SQ_PC' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardPlayer_C, Last_Fireteam_Index) == 0x000550, "Member 'UUMG_ScoreboardPlayer_C::Last_Fireteam_Index' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardPlayer_C, Last_Fireteam_Color) == 0x000554, "Member 'UUMG_ScoreboardPlayer_C::Last_Fireteam_Color' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardPlayer_C, StatsSpaceSize) == 0x000564, "Member 'UUMG_ScoreboardPlayer_C::StatsSpaceSize' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardPlayer_C, MainTooltip) == 0x000568, "Member 'UUMG_ScoreboardPlayer_C::MainTooltip' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardPlayer_C, PlayerNameSize) == 0x000570, "Member 'UUMG_ScoreboardPlayer_C::PlayerNameSize' has a wrong offset!");

}

