#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_LayerVoteDetails

#include "Basic.hpp"

#include "SQFactionEntry_structs.hpp"
#include "ESQLayerSpecialTag_structs.hpp"
#include "Engine_structs.hpp"
#include "SQLayerEntry_structs.hpp"
#include "S_FOBRadius_structs.hpp"
#include "SQGameModeEntry_structs.hpp"
#include "Squad_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "SQFactionSetupEntry_structs.hpp"
#include "SQLevelEntry_structs.hpp"
#include "ESQLayerSize_structs.hpp"


namespace SDK::Params
{

// Function UMG_LayerVoteDetails.UMG_LayerVoteDetails_C.ExecuteUbergraph_UMG_LayerVoteDetails
// 0x0120 (0x0120 - 0x0000)
struct UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture>                K2Node_CustomEvent_LayerTexture;                   // 0x0008(0x0028)(HasGetValueTypeHash)
	class USQLayer*                               K2Node_CustomEvent_Layer;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x004C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetVisualData_VoteVisible;                // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetVisualData_Selected;                   // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E[0x2];                                       // 0x008E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetVisualData_VoteCountText;              // 0x0090(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_ComponentBoundEvent_VoteID;                 // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USQLayer*                               CallFunc_GetLayer_OutLayer;                        // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetLayer_LayerID;                         // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_SQLayer_C*                          K2Node_DynamicCast_AsBP_SQLayer;                   // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue_1;             // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USQLayer*                               CallFunc_GetLayer_OutLayer_1;                      // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetLayer_LayerID_1;                       // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_SQLayer_C*                          K2Node_DynamicCast_AsBP_SQLayer_1;                 // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails) == 0x000008, "Wrong alignment on UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails");
static_assert(sizeof(UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails) == 0x000120, "Wrong size on UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails");
static_assert(offsetof(UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails, EntryPoint) == 0x000000, "Member 'UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails, K2Node_CustomEvent_LayerTexture) == 0x000008, "Member 'UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails::K2Node_CustomEvent_LayerTexture' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails, K2Node_CustomEvent_Layer) == 0x000030, "Member 'UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails::K2Node_CustomEvent_Layer' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails, K2Node_Event_MyGeometry) == 0x00004C, "Member 'UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails, K2Node_Event_InDeltaTime) == 0x000084, "Member 'UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails, CallFunc_Subtract_IntInt_ReturnValue) == 0x000088, "Member 'UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails, CallFunc_GetVisualData_VoteVisible) == 0x00008C, "Member 'UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails::CallFunc_GetVisualData_VoteVisible' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails, CallFunc_GetVisualData_Selected) == 0x00008D, "Member 'UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails::CallFunc_GetVisualData_Selected' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails, CallFunc_GetVisualData_VoteCountText) == 0x000090, "Member 'UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails::CallFunc_GetVisualData_VoteCountText' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails, CallFunc_IsValid_ReturnValue) == 0x0000A8, "Member 'UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails, Temp_object_Variable) == 0x0000B0, "Member 'UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails, K2Node_ComponentBoundEvent_VoteID) == 0x0000B8, "Member 'UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails::K2Node_ComponentBoundEvent_VoteID' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails, K2Node_DynamicCast_AsTexture_2D) == 0x0000C0, "Member 'UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000CC, "Member 'UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails, K2Node_CustomEvent_Loaded) == 0x0000D0, "Member 'UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails, CallFunc_Percent_IntInt_ReturnValue) == 0x0000D8, "Member 'UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails, CallFunc_GetLayer_OutLayer) == 0x0000E0, "Member 'UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails::CallFunc_GetLayer_OutLayer' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails, CallFunc_GetLayer_LayerID) == 0x0000E8, "Member 'UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails::CallFunc_GetLayer_LayerID' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails, K2Node_DynamicCast_AsBP_SQLayer) == 0x0000F0, "Member 'UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails::K2Node_DynamicCast_AsBP_SQLayer' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails, K2Node_DynamicCast_bSuccess_1) == 0x0000F8, "Member 'UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails, CallFunc_Percent_IntInt_ReturnValue_1) == 0x0000FC, "Member 'UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails::CallFunc_Percent_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails, CallFunc_GetLayer_OutLayer_1) == 0x000100, "Member 'UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails::CallFunc_GetLayer_OutLayer_1' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails, CallFunc_GetLayer_LayerID_1) == 0x000108, "Member 'UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails::CallFunc_GetLayer_LayerID_1' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails, K2Node_DynamicCast_AsBP_SQLayer_1) == 0x000110, "Member 'UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails::K2Node_DynamicCast_AsBP_SQLayer_1' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails, K2Node_DynamicCast_bSuccess_2) == 0x000118, "Member 'UMG_LayerVoteDetails_C_ExecuteUbergraph_UMG_LayerVoteDetails::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function UMG_LayerVoteDetails.UMG_LayerVoteDetails_C.BndEvt__UMG_LayerVoteDetails_UI_VoteButton_K2Node_ComponentBoundEvent_3_VoteSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UMG_LayerVoteDetails_C_BndEvt__UMG_LayerVoteDetails_UI_VoteButton_K2Node_ComponentBoundEvent_3_VoteSelected__DelegateSignature final
{
public:
	class FName                                   VoteId;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_LayerVoteDetails_C_BndEvt__UMG_LayerVoteDetails_UI_VoteButton_K2Node_ComponentBoundEvent_3_VoteSelected__DelegateSignature) == 0x000004, "Wrong alignment on UMG_LayerVoteDetails_C_BndEvt__UMG_LayerVoteDetails_UI_VoteButton_K2Node_ComponentBoundEvent_3_VoteSelected__DelegateSignature");
static_assert(sizeof(UMG_LayerVoteDetails_C_BndEvt__UMG_LayerVoteDetails_UI_VoteButton_K2Node_ComponentBoundEvent_3_VoteSelected__DelegateSignature) == 0x000008, "Wrong size on UMG_LayerVoteDetails_C_BndEvt__UMG_LayerVoteDetails_UI_VoteButton_K2Node_ComponentBoundEvent_3_VoteSelected__DelegateSignature");
static_assert(offsetof(UMG_LayerVoteDetails_C_BndEvt__UMG_LayerVoteDetails_UI_VoteButton_K2Node_ComponentBoundEvent_3_VoteSelected__DelegateSignature, VoteId) == 0x000000, "Member 'UMG_LayerVoteDetails_C_BndEvt__UMG_LayerVoteDetails_UI_VoteButton_K2Node_ComponentBoundEvent_3_VoteSelected__DelegateSignature::VoteId' has a wrong offset!");

// Function UMG_LayerVoteDetails.UMG_LayerVoteDetails_C.PresentLayerMap
// 0x0030 (0x0030 - 0x0000)
struct UMG_LayerVoteDetails_C_PresentLayerMap final
{
public:
	TSoftObjectPtr<class UTexture>                LayerTexture;                                      // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class USQLayer*                               Layer;                                             // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_LayerVoteDetails_C_PresentLayerMap) == 0x000008, "Wrong alignment on UMG_LayerVoteDetails_C_PresentLayerMap");
static_assert(sizeof(UMG_LayerVoteDetails_C_PresentLayerMap) == 0x000030, "Wrong size on UMG_LayerVoteDetails_C_PresentLayerMap");
static_assert(offsetof(UMG_LayerVoteDetails_C_PresentLayerMap, LayerTexture) == 0x000000, "Member 'UMG_LayerVoteDetails_C_PresentLayerMap::LayerTexture' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_PresentLayerMap, Layer) == 0x000028, "Member 'UMG_LayerVoteDetails_C_PresentLayerMap::Layer' has a wrong offset!");

// Function UMG_LayerVoteDetails.UMG_LayerVoteDetails_C.Tick
// 0x003C (0x003C - 0x0000)
struct UMG_LayerVoteDetails_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_LayerVoteDetails_C_Tick) == 0x000004, "Wrong alignment on UMG_LayerVoteDetails_C_Tick");
static_assert(sizeof(UMG_LayerVoteDetails_C_Tick) == 0x00003C, "Wrong size on UMG_LayerVoteDetails_C_Tick");
static_assert(offsetof(UMG_LayerVoteDetails_C_Tick, MyGeometry) == 0x000000, "Member 'UMG_LayerVoteDetails_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_Tick, InDeltaTime) == 0x000038, "Member 'UMG_LayerVoteDetails_C_Tick::InDeltaTime' has a wrong offset!");

// Function UMG_LayerVoteDetails.UMG_LayerVoteDetails_C.OnLoaded_B8D412B7470916A6DC89C38415086618
// 0x0008 (0x0008 - 0x0000)
struct UMG_LayerVoteDetails_C_OnLoaded_B8D412B7470916A6DC89C38415086618 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_LayerVoteDetails_C_OnLoaded_B8D412B7470916A6DC89C38415086618) == 0x000008, "Wrong alignment on UMG_LayerVoteDetails_C_OnLoaded_B8D412B7470916A6DC89C38415086618");
static_assert(sizeof(UMG_LayerVoteDetails_C_OnLoaded_B8D412B7470916A6DC89C38415086618) == 0x000008, "Wrong size on UMG_LayerVoteDetails_C_OnLoaded_B8D412B7470916A6DC89C38415086618");
static_assert(offsetof(UMG_LayerVoteDetails_C_OnLoaded_B8D412B7470916A6DC89C38415086618, Loaded) == 0x000000, "Member 'UMG_LayerVoteDetails_C_OnLoaded_B8D412B7470916A6DC89C38415086618::Loaded' has a wrong offset!");

// Function UMG_LayerVoteDetails.UMG_LayerVoteDetails_C.FillFromLayer
// 0x0F10 (0x0F10 - 0x0000)
struct UMG_LayerVoteDetails_C_FillFromLayer final
{
public:
	class UBP_SQLayer_C*                          Layer;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USQVoteSessionClient*                   Session;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LayerID;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SingleMode_0;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CurrentTeamIndex;                                  // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSQFactionEntry                        FactionEntry;                                      // 0x0020(0x0580)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TMap<ESQLayerSize, class FText>               LayerSizeMap;                                      // 0x05A0(0x0050)(Edit, BlueprintVisible)
	int32                                         TicketsTeam2;                                      // 0x05F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TicketsTeam1;                                      // 0x05F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x05F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x05F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5FA[0x2];                                      // 0x05FA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChoiceIndex_Index;                     // 0x05FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetLevelEntry_Success;                 // 0x0600(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_601[0x7];                                      // 0x0601(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSQLevelEntry                          CallFunc_TryGetLevelEntry_LevelEntry;              // 0x0608(0x0138)(HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0740(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0744(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0748(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x074C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0750(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0754(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0758(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x075C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0760(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x0764(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_And_IntInt_ReturnValue;                   // 0x0768(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_And_IntInt_ReturnValue_1;                 // 0x076C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0770(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0771(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_772[0x2];                                      // 0x0772(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0774(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<ESQLayerSize, class FText>               K2Node_MakeVariable_MakeVariableOutput;            // 0x0778(0x0050)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x07C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C9[0x7];                                      // 0x07C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_VoteItem_C*                        CallFunc_Array_Get_Item;                           // 0x07D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x07D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x07DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x07DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x07DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7DF[0x1];                                      // 0x07DF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x07E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x07E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E5[0x3];                                      // 0x07E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_FactionNameLine_C*                 CallFunc_Create_ReturnValue;                       // 0x07E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x07F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x07F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7F9[0x7];                                      // 0x07F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture>                K2Node_Select_Default;                             // 0x0800(0x0028)(HasGetValueTypeHash)
	TMap<class USQFaction*, uint8>                CallFunc_GetAllAvailableFactions_ID;               // 0x0828(0x0050)()
	TArray<class USQFaction*>                     CallFunc_Map_Keys_Keys;                            // 0x0878(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0888(0x0040)(HasGetValueTypeHash)
	class USQFaction*                             CallFunc_Array_Get_Item_1;                         // 0x08C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x08D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D4[0x4];                                      // 0x08D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_SQFaction_C*                        K2Node_DynamicCast_AsBP_SQFaction;                 // 0x08D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x08E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x08E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Map_Find_Value;                           // 0x08E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x08E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryGetFactionEntry_Success;               // 0x08E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E5[0x3];                                      // 0x08E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSQFactionEntry                        CallFunc_TryGetFactionEntry_FactionEntry;          // 0x08E8(0x0580)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0E68(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0EA8(0x0010)(ReferenceParm)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0EB8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EB9[0x7];                                      // 0x0EB9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0EC0(0x0018)()
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0ED8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0ED9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0EDA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EDB[0x5];                                      // 0x0EDB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Map_Find_Value_1;                         // 0x0EE0(0x0018)()
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0EF8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EF9[0x7];                                      // 0x0EF9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USQLayerTeamConfig*                     CallFunc_Array_Get_Item_2;                         // 0x0F00(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0F08(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0F0C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0F0D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0F0E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_LayerVoteDetails_C_FillFromLayer) == 0x000008, "Wrong alignment on UMG_LayerVoteDetails_C_FillFromLayer");
static_assert(sizeof(UMG_LayerVoteDetails_C_FillFromLayer) == 0x000F10, "Wrong size on UMG_LayerVoteDetails_C_FillFromLayer");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, Layer) == 0x000000, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::Layer' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, Session) == 0x000008, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::Session' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, LayerID) == 0x000010, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::LayerID' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, SingleMode_0) == 0x000018, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::SingleMode_0' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, CurrentTeamIndex) == 0x000019, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::CurrentTeamIndex' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, FactionEntry) == 0x000020, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::FactionEntry' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, LayerSizeMap) == 0x0005A0, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::LayerSizeMap' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, TicketsTeam2) == 0x0005F0, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::TicketsTeam2' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, TicketsTeam1) == 0x0005F4, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::TicketsTeam1' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, Temp_bool_True_if_break_was_hit_Variable) == 0x0005F8, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, CallFunc_Not_PreBool_ReturnValue) == 0x0005F9, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, CallFunc_GetChoiceIndex_Index) == 0x0005FC, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::CallFunc_GetChoiceIndex_Index' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, CallFunc_TryGetLevelEntry_Success) == 0x000600, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::CallFunc_TryGetLevelEntry_Success' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, CallFunc_TryGetLevelEntry_LevelEntry) == 0x000608, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::CallFunc_TryGetLevelEntry_LevelEntry' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, Temp_int_Array_Index_Variable) == 0x000740, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, Temp_int_Loop_Counter_Variable) == 0x000744, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, CallFunc_Add_IntInt_ReturnValue) == 0x000748, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, Temp_int_Loop_Counter_Variable_1) == 0x00074C, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, Temp_int_Loop_Counter_Variable_2) == 0x000750, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, CallFunc_Add_IntInt_ReturnValue_1) == 0x000754, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, CallFunc_Add_IntInt_ReturnValue_2) == 0x000758, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, Temp_int_Array_Index_Variable_1) == 0x00075C, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000760, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x000764, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, CallFunc_And_IntInt_ReturnValue) == 0x000768, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::CallFunc_And_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, CallFunc_And_IntInt_ReturnValue_1) == 0x00076C, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::CallFunc_And_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000770, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000771, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, Temp_int_Array_Index_Variable_2) == 0x000774, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, K2Node_MakeVariable_MakeVariableOutput) == 0x000778, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::K2Node_MakeVariable_MakeVariableOutput' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, CallFunc_IsValid_ReturnValue) == 0x0007C8, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, CallFunc_Array_Get_Item) == 0x0007D0, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, CallFunc_Array_Length_ReturnValue) == 0x0007D8, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, CallFunc_Less_IntInt_ReturnValue) == 0x0007DC, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, CallFunc_BooleanAND_ReturnValue) == 0x0007DD, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0007DE, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, CallFunc_Array_Length_ReturnValue_1) == 0x0007E0, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x0007E4, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, CallFunc_Create_ReturnValue) == 0x0007E8, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x0007F0, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, Temp_bool_Variable) == 0x0007F8, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, K2Node_Select_Default) == 0x000800, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, CallFunc_GetAllAvailableFactions_ID) == 0x000828, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::CallFunc_GetAllAvailableFactions_ID' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, CallFunc_Map_Keys_Keys) == 0x000878, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, K2Node_MakeStruct_FormatArgumentData) == 0x000888, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, CallFunc_Array_Get_Item_1) == 0x0008C8, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, CallFunc_Array_Length_ReturnValue_2) == 0x0008D0, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, K2Node_DynamicCast_AsBP_SQFaction) == 0x0008D8, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::K2Node_DynamicCast_AsBP_SQFaction' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, K2Node_DynamicCast_bSuccess) == 0x0008E0, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, CallFunc_Less_IntInt_ReturnValue_1) == 0x0008E1, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, CallFunc_Map_Find_Value) == 0x0008E2, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, CallFunc_Map_Find_ReturnValue) == 0x0008E3, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, CallFunc_TryGetFactionEntry_Success) == 0x0008E4, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::CallFunc_TryGetFactionEntry_Success' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, CallFunc_TryGetFactionEntry_FactionEntry) == 0x0008E8, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::CallFunc_TryGetFactionEntry_FactionEntry' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, K2Node_MakeStruct_FormatArgumentData_1) == 0x000E68, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, K2Node_MakeArray_Array) == 0x000EA8, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, Temp_byte_Variable) == 0x000EB8, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, CallFunc_Format_ReturnValue) == 0x000EC0, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, Temp_byte_Variable_1) == 0x000ED8, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, Temp_bool_Variable_1) == 0x000ED9, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, K2Node_Select_Default_1) == 0x000EDA, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, CallFunc_Map_Find_Value_1) == 0x000EE0, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, CallFunc_Map_Find_ReturnValue_1) == 0x000EF8, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, CallFunc_Array_Get_Item_2) == 0x000F00, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, CallFunc_Array_Length_ReturnValue_3) == 0x000F08, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, CallFunc_Less_IntInt_ReturnValue_2) == 0x000F0C, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000F0D, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_FillFromLayer, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000F0E, "Member 'UMG_LayerVoteDetails_C_FillFromLayer::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");

// Function UMG_LayerVoteDetails.UMG_LayerVoteDetails_C.GetAllAvailableFactions
// 0x0230 (0x0230 - 0x0000)
struct UMG_LayerVoteDetails_C_GetAllAvailableFactions final
{
public:
	class UBP_SQLayer_C*                          Layer;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class USQFaction*, uint8>                ID;                                                // 0x0008(0x0050)(Parm, OutParm)
	uint8                                         TeamOneValue;                                      // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class USQFaction*, uint8>                Out;                                               // 0x0060(0x0050)(Edit, BlueprintVisible)
	uint8                                         Temp_byte_Variable;                                // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSQFactionType>                 CallFunc_Map_Values_Values;                        // 0x00B8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Map_Length_ReturnValue;                   // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Temp_byte_Variable_1;                              // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D2[0x2];                                       // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSQFactionType                         CallFunc_Array_Get_Item;                           // 0x00D8(0x0078)()
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_SQFactionSetup_C*                   K2Node_DynamicCast_AsBP_SQFaction_Setup;           // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x3];                                      // 0x0169(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         K2Node_Select_Default;                             // 0x0175(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable_2;                              // 0x0176(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Map_Find_Value;                           // 0x0177(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSQFactionType>                 CallFunc_Map_Values_Values_1;                      // 0x0180(0x0010)(ReferenceParm)
	struct FSQFactionType                         CallFunc_Array_Get_Item_1;                         // 0x0190(0x0078)()
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20D[0x3];                                      // 0x020D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue_1;         // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_SQFactionSetup_C*                   K2Node_DynamicCast_AsBP_SQFaction_Setup_1;         // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_222[0x2];                                      // 0x0222(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Temp_byte_Variable_3;                              // 0x0228(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_LayerVoteDetails_C_GetAllAvailableFactions) == 0x000008, "Wrong alignment on UMG_LayerVoteDetails_C_GetAllAvailableFactions");
static_assert(sizeof(UMG_LayerVoteDetails_C_GetAllAvailableFactions) == 0x000230, "Wrong size on UMG_LayerVoteDetails_C_GetAllAvailableFactions");
static_assert(offsetof(UMG_LayerVoteDetails_C_GetAllAvailableFactions, Layer) == 0x000000, "Member 'UMG_LayerVoteDetails_C_GetAllAvailableFactions::Layer' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_GetAllAvailableFactions, ID) == 0x000008, "Member 'UMG_LayerVoteDetails_C_GetAllAvailableFactions::ID' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_GetAllAvailableFactions, TeamOneValue) == 0x000058, "Member 'UMG_LayerVoteDetails_C_GetAllAvailableFactions::TeamOneValue' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_GetAllAvailableFactions, Out) == 0x000060, "Member 'UMG_LayerVoteDetails_C_GetAllAvailableFactions::Out' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_GetAllAvailableFactions, Temp_byte_Variable) == 0x0000B0, "Member 'UMG_LayerVoteDetails_C_GetAllAvailableFactions::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_GetAllAvailableFactions, CallFunc_Map_Values_Values) == 0x0000B8, "Member 'UMG_LayerVoteDetails_C_GetAllAvailableFactions::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_GetAllAvailableFactions, CallFunc_Map_Length_ReturnValue) == 0x0000C8, "Member 'UMG_LayerVoteDetails_C_GetAllAvailableFactions::CallFunc_Map_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_GetAllAvailableFactions, CallFunc_Array_Length_ReturnValue) == 0x0000CC, "Member 'UMG_LayerVoteDetails_C_GetAllAvailableFactions::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_GetAllAvailableFactions, CallFunc_Greater_IntInt_ReturnValue) == 0x0000D0, "Member 'UMG_LayerVoteDetails_C_GetAllAvailableFactions::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_GetAllAvailableFactions, Temp_byte_Variable_1) == 0x0000D1, "Member 'UMG_LayerVoteDetails_C_GetAllAvailableFactions::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_GetAllAvailableFactions, Temp_int_Array_Index_Variable) == 0x0000D4, "Member 'UMG_LayerVoteDetails_C_GetAllAvailableFactions::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_GetAllAvailableFactions, CallFunc_Array_Get_Item) == 0x0000D8, "Member 'UMG_LayerVoteDetails_C_GetAllAvailableFactions::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_GetAllAvailableFactions, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000150, "Member 'UMG_LayerVoteDetails_C_GetAllAvailableFactions::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_GetAllAvailableFactions, Temp_int_Loop_Counter_Variable) == 0x000158, "Member 'UMG_LayerVoteDetails_C_GetAllAvailableFactions::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_GetAllAvailableFactions, K2Node_DynamicCast_AsBP_SQFaction_Setup) == 0x000160, "Member 'UMG_LayerVoteDetails_C_GetAllAvailableFactions::K2Node_DynamicCast_AsBP_SQFaction_Setup' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_GetAllAvailableFactions, K2Node_DynamicCast_bSuccess) == 0x000168, "Member 'UMG_LayerVoteDetails_C_GetAllAvailableFactions::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_GetAllAvailableFactions, CallFunc_Add_IntInt_ReturnValue) == 0x00016C, "Member 'UMG_LayerVoteDetails_C_GetAllAvailableFactions::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_GetAllAvailableFactions, Temp_int_Array_Index_Variable_1) == 0x000170, "Member 'UMG_LayerVoteDetails_C_GetAllAvailableFactions::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_GetAllAvailableFactions, Temp_bool_Variable) == 0x000174, "Member 'UMG_LayerVoteDetails_C_GetAllAvailableFactions::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_GetAllAvailableFactions, K2Node_Select_Default) == 0x000175, "Member 'UMG_LayerVoteDetails_C_GetAllAvailableFactions::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_GetAllAvailableFactions, Temp_byte_Variable_2) == 0x000176, "Member 'UMG_LayerVoteDetails_C_GetAllAvailableFactions::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_GetAllAvailableFactions, CallFunc_Map_Find_Value) == 0x000177, "Member 'UMG_LayerVoteDetails_C_GetAllAvailableFactions::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_GetAllAvailableFactions, CallFunc_Map_Find_ReturnValue) == 0x000178, "Member 'UMG_LayerVoteDetails_C_GetAllAvailableFactions::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_LayerVoteDetails_C_GetAllAvailableFactions, Temp_int_Loop_Counter_Variable_1) == 0x00017C, "Member 'UMG_LayerVoteDetails_C_GetAllAvailableFactions::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
