#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_TimelineTooltip

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_TimelineTooltip.UMG_TimelineTooltip_C
// 0x0020 (0x0280 - 0x0260)
class UUMG_TimelineTooltip_C final : public UUserWidget
{
public:
	class UTextBlock*                             TimeText;                                          // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBMain;                                            // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UUMG_TimelineTooltipList_C*>     TooltipLists;                                      // 0x0270(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void UpdateListNumber(TArray<struct FLinearColor>& Colors);
	void UpdateTicketsNum(int32 TeamIndex, int32 Tickets);
	void ChangeLIstVisibility(TArray<int32>& VisibleIndexes);
	void FillEvents(int32& TeamId, TArray<int32>& Events, class USQEndStatsComponent*& EndRoundComp, int32 TicketsPoint, int32& LineIndex, float& GameTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_TimelineTooltip_C">();
	}
	static class UUMG_TimelineTooltip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_TimelineTooltip_C>();
	}
};
static_assert(alignof(UUMG_TimelineTooltip_C) == 0x000008, "Wrong alignment on UUMG_TimelineTooltip_C");
static_assert(sizeof(UUMG_TimelineTooltip_C) == 0x000280, "Wrong size on UUMG_TimelineTooltip_C");
static_assert(offsetof(UUMG_TimelineTooltip_C, TimeText) == 0x000260, "Member 'UUMG_TimelineTooltip_C::TimeText' has a wrong offset!");
static_assert(offsetof(UUMG_TimelineTooltip_C, VBMain) == 0x000268, "Member 'UUMG_TimelineTooltip_C::VBMain' has a wrong offset!");
static_assert(offsetof(UUMG_TimelineTooltip_C, TooltipLists) == 0x000270, "Member 'UUMG_TimelineTooltip_C::TooltipLists' has a wrong offset!");

}

