#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_TimelinePoint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Squad_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_TimelinePoint.UMG_TimelinePoint_C
// 0x0018 (0x0298 - 0x0280)
class UUMG_TimelinePoint_C final : public USQTimelinePoint
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                CenterBorder;                                      // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                OuterBorder;                                       // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_TimelinePoint(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void SetMarked(bool bNewMarked);
	void ChangeColor(const struct FLinearColor& NewColor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_TimelinePoint_C">();
	}
	static class UUMG_TimelinePoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_TimelinePoint_C>();
	}
};
static_assert(alignof(UUMG_TimelinePoint_C) == 0x000008, "Wrong alignment on UUMG_TimelinePoint_C");
static_assert(sizeof(UUMG_TimelinePoint_C) == 0x000298, "Wrong size on UUMG_TimelinePoint_C");
static_assert(offsetof(UUMG_TimelinePoint_C, UberGraphFrame) == 0x000280, "Member 'UUMG_TimelinePoint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_TimelinePoint_C, CenterBorder) == 0x000288, "Member 'UUMG_TimelinePoint_C::CenterBorder' has a wrong offset!");
static_assert(offsetof(UUMG_TimelinePoint_C, OuterBorder) == 0x000290, "Member 'UUMG_TimelinePoint_C::OuterBorder' has a wrong offset!");

}

