#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_TimelineGraph

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Squad_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UMG_TimelineGraph.UMG_TimelineGraph_C.ExecuteUbergraph_UMG_TimelineGraph
// 0x0098 (0x0098 - 0x0000)
struct UMG_TimelineGraph_C_ExecuteUbergraph_UMG_TimelineGraph final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector2D>                      CallFunc_UpdatePositionUnderMouse_OutPositions;    // 0x0008(0x0010)(ReferenceParm)
	TArray<int32>                                 CallFunc_UpdatePositionUnderMouse_PrevPoints;      // 0x0018(0x0010)(ReferenceParm)
	float                                         CallFunc_UpdatePositionUnderMouse_OutMouseDistToPoint; // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_UpdatePositionUnderMouse_OutClosestPosIndex; // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0038(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 CallFunc_CalculatePointDistance_OutDistances;      // 0x0078(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_MaxOfFloatArray_IndexOfMaxValue;          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MaxOfFloatArray_MaxValue;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_TimelineGraph_C_ExecuteUbergraph_UMG_TimelineGraph) == 0x000008, "Wrong alignment on UMG_TimelineGraph_C_ExecuteUbergraph_UMG_TimelineGraph");
static_assert(sizeof(UMG_TimelineGraph_C_ExecuteUbergraph_UMG_TimelineGraph) == 0x000098, "Wrong size on UMG_TimelineGraph_C_ExecuteUbergraph_UMG_TimelineGraph");
static_assert(offsetof(UMG_TimelineGraph_C_ExecuteUbergraph_UMG_TimelineGraph, EntryPoint) == 0x000000, "Member 'UMG_TimelineGraph_C_ExecuteUbergraph_UMG_TimelineGraph::EntryPoint' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_ExecuteUbergraph_UMG_TimelineGraph, CallFunc_UpdatePositionUnderMouse_OutPositions) == 0x000008, "Member 'UMG_TimelineGraph_C_ExecuteUbergraph_UMG_TimelineGraph::CallFunc_UpdatePositionUnderMouse_OutPositions' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_ExecuteUbergraph_UMG_TimelineGraph, CallFunc_UpdatePositionUnderMouse_PrevPoints) == 0x000018, "Member 'UMG_TimelineGraph_C_ExecuteUbergraph_UMG_TimelineGraph::CallFunc_UpdatePositionUnderMouse_PrevPoints' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_ExecuteUbergraph_UMG_TimelineGraph, CallFunc_UpdatePositionUnderMouse_OutMouseDistToPoint) == 0x000028, "Member 'UMG_TimelineGraph_C_ExecuteUbergraph_UMG_TimelineGraph::CallFunc_UpdatePositionUnderMouse_OutMouseDistToPoint' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_ExecuteUbergraph_UMG_TimelineGraph, CallFunc_UpdatePositionUnderMouse_OutClosestPosIndex) == 0x00002C, "Member 'UMG_TimelineGraph_C_ExecuteUbergraph_UMG_TimelineGraph::CallFunc_UpdatePositionUnderMouse_OutClosestPosIndex' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_ExecuteUbergraph_UMG_TimelineGraph, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000030, "Member 'UMG_TimelineGraph_C_ExecuteUbergraph_UMG_TimelineGraph::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_ExecuteUbergraph_UMG_TimelineGraph, K2Node_Event_MyGeometry) == 0x000038, "Member 'UMG_TimelineGraph_C_ExecuteUbergraph_UMG_TimelineGraph::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_ExecuteUbergraph_UMG_TimelineGraph, K2Node_Event_InDeltaTime) == 0x000070, "Member 'UMG_TimelineGraph_C_ExecuteUbergraph_UMG_TimelineGraph::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_ExecuteUbergraph_UMG_TimelineGraph, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000074, "Member 'UMG_TimelineGraph_C_ExecuteUbergraph_UMG_TimelineGraph::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_ExecuteUbergraph_UMG_TimelineGraph, CallFunc_IsValid_ReturnValue) == 0x000075, "Member 'UMG_TimelineGraph_C_ExecuteUbergraph_UMG_TimelineGraph::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_ExecuteUbergraph_UMG_TimelineGraph, CallFunc_CalculatePointDistance_OutDistances) == 0x000078, "Member 'UMG_TimelineGraph_C_ExecuteUbergraph_UMG_TimelineGraph::CallFunc_CalculatePointDistance_OutDistances' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_ExecuteUbergraph_UMG_TimelineGraph, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x000088, "Member 'UMG_TimelineGraph_C_ExecuteUbergraph_UMG_TimelineGraph::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_ExecuteUbergraph_UMG_TimelineGraph, CallFunc_MaxOfFloatArray_IndexOfMaxValue) == 0x00008C, "Member 'UMG_TimelineGraph_C_ExecuteUbergraph_UMG_TimelineGraph::CallFunc_MaxOfFloatArray_IndexOfMaxValue' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_ExecuteUbergraph_UMG_TimelineGraph, CallFunc_MaxOfFloatArray_MaxValue) == 0x000090, "Member 'UMG_TimelineGraph_C_ExecuteUbergraph_UMG_TimelineGraph::CallFunc_MaxOfFloatArray_MaxValue' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_ExecuteUbergraph_UMG_TimelineGraph, CallFunc_Less_FloatFloat_ReturnValue) == 0x000094, "Member 'UMG_TimelineGraph_C_ExecuteUbergraph_UMG_TimelineGraph::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");

// Function UMG_TimelineGraph.UMG_TimelineGraph_C.Tick
// 0x003C (0x003C - 0x0000)
struct UMG_TimelineGraph_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_TimelineGraph_C_Tick) == 0x000004, "Wrong alignment on UMG_TimelineGraph_C_Tick");
static_assert(sizeof(UMG_TimelineGraph_C_Tick) == 0x00003C, "Wrong size on UMG_TimelineGraph_C_Tick");
static_assert(offsetof(UMG_TimelineGraph_C_Tick, MyGeometry) == 0x000000, "Member 'UMG_TimelineGraph_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_Tick, InDeltaTime) == 0x000038, "Member 'UMG_TimelineGraph_C_Tick::InDeltaTime' has a wrong offset!");

// Function UMG_TimelineGraph.UMG_TimelineGraph_C.Refresh
// 0x0010 (0x0010 - 0x0000)
struct UMG_TimelineGraph_C_Refresh final
{
public:
	class UUMG_TimelineTooltip_C*                 CallFunc_Create_ReturnValue;                       // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_TimelineGraph_C_Refresh) == 0x000008, "Wrong alignment on UMG_TimelineGraph_C_Refresh");
static_assert(sizeof(UMG_TimelineGraph_C_Refresh) == 0x000010, "Wrong size on UMG_TimelineGraph_C_Refresh");
static_assert(offsetof(UMG_TimelineGraph_C_Refresh, CallFunc_Create_ReturnValue) == 0x000000, "Member 'UMG_TimelineGraph_C_Refresh::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_Refresh, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'UMG_TimelineGraph_C_Refresh::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function UMG_TimelineGraph.UMG_TimelineGraph_C.UpdatePointerVisibility
// 0x000C (0x000C - 0x0000)
struct UMG_TimelineGraph_C_UpdatePointerVisibility final
{
public:
	float                                         LineDist;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_TimelineGraph_C_UpdatePointerVisibility) == 0x000004, "Wrong alignment on UMG_TimelineGraph_C_UpdatePointerVisibility");
static_assert(sizeof(UMG_TimelineGraph_C_UpdatePointerVisibility) == 0x00000C, "Wrong size on UMG_TimelineGraph_C_UpdatePointerVisibility");
static_assert(offsetof(UMG_TimelineGraph_C_UpdatePointerVisibility, LineDist) == 0x000000, "Member 'UMG_TimelineGraph_C_UpdatePointerVisibility::LineDist' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_UpdatePointerVisibility, Temp_bool_Variable) == 0x000004, "Member 'UMG_TimelineGraph_C_UpdatePointerVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_UpdatePointerVisibility, CallFunc_Less_FloatFloat_ReturnValue) == 0x000005, "Member 'UMG_TimelineGraph_C_UpdatePointerVisibility::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_UpdatePointerVisibility, Temp_byte_Variable) == 0x000006, "Member 'UMG_TimelineGraph_C_UpdatePointerVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_UpdatePointerVisibility, Temp_byte_Variable_1) == 0x000007, "Member 'UMG_TimelineGraph_C_UpdatePointerVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_UpdatePointerVisibility, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'UMG_TimelineGraph_C_UpdatePointerVisibility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_UpdatePointerVisibility, CallFunc_Not_PreBool_ReturnValue) == 0x000009, "Member 'UMG_TimelineGraph_C_UpdatePointerVisibility::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_UpdatePointerVisibility, K2Node_Select_Default) == 0x00000A, "Member 'UMG_TimelineGraph_C_UpdatePointerVisibility::K2Node_Select_Default' has a wrong offset!");

// Function UMG_TimelineGraph.UMG_TimelineGraph_C.UpdatePointsInfo
// 0x0080 (0x0080 - 0x0000)
struct UMG_TimelineGraph_C_UpdatePointsInfo final
{
public:
	struct FVector2D                              StartPoint;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 PrevPoints;                                        // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 ListOfPoints;                                      // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CallFunc_GetPointsInXRange_OutPoints;              // 0x0050(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimeAtPoint_Time;                      // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x007E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x007F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UMG_TimelineGraph_C_UpdatePointsInfo) == 0x000008, "Wrong alignment on UMG_TimelineGraph_C_UpdatePointsInfo");
static_assert(sizeof(UMG_TimelineGraph_C_UpdatePointsInfo) == 0x000080, "Wrong size on UMG_TimelineGraph_C_UpdatePointsInfo");
static_assert(offsetof(UMG_TimelineGraph_C_UpdatePointsInfo, StartPoint) == 0x000000, "Member 'UMG_TimelineGraph_C_UpdatePointsInfo::StartPoint' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_UpdatePointsInfo, PrevPoints) == 0x000008, "Member 'UMG_TimelineGraph_C_UpdatePointsInfo::PrevPoints' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_UpdatePointsInfo, ListOfPoints) == 0x000018, "Member 'UMG_TimelineGraph_C_UpdatePointsInfo::ListOfPoints' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_UpdatePointsInfo, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'UMG_TimelineGraph_C_UpdatePointsInfo::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_UpdatePointsInfo, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'UMG_TimelineGraph_C_UpdatePointsInfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_UpdatePointsInfo, Temp_int_Array_Index_Variable) == 0x000030, "Member 'UMG_TimelineGraph_C_UpdatePointsInfo::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_UpdatePointsInfo, Temp_int_Array_Index_Variable_1) == 0x000034, "Member 'UMG_TimelineGraph_C_UpdatePointsInfo::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_UpdatePointsInfo, CallFunc_MakeLiteralFloat_ReturnValue) == 0x000038, "Member 'UMG_TimelineGraph_C_UpdatePointsInfo::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_UpdatePointsInfo, CallFunc_BreakVector2D_X) == 0x00003C, "Member 'UMG_TimelineGraph_C_UpdatePointsInfo::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_UpdatePointsInfo, CallFunc_BreakVector2D_Y) == 0x000040, "Member 'UMG_TimelineGraph_C_UpdatePointsInfo::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_UpdatePointsInfo, Temp_int_Loop_Counter_Variable_1) == 0x000044, "Member 'UMG_TimelineGraph_C_UpdatePointsInfo::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_UpdatePointsInfo, CallFunc_Array_Get_Item) == 0x000048, "Member 'UMG_TimelineGraph_C_UpdatePointsInfo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_UpdatePointsInfo, CallFunc_GetPointsInXRange_OutPoints) == 0x000050, "Member 'UMG_TimelineGraph_C_UpdatePointsInfo::CallFunc_GetPointsInXRange_OutPoints' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_UpdatePointsInfo, CallFunc_Add_IntInt_ReturnValue_1) == 0x000060, "Member 'UMG_TimelineGraph_C_UpdatePointsInfo::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_UpdatePointsInfo, CallFunc_GetTimeAtPoint_Time) == 0x000064, "Member 'UMG_TimelineGraph_C_UpdatePointsInfo::CallFunc_GetTimeAtPoint_Time' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_UpdatePointsInfo, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'UMG_TimelineGraph_C_UpdatePointsInfo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_UpdatePointsInfo, CallFunc_Less_IntInt_ReturnValue) == 0x00006C, "Member 'UMG_TimelineGraph_C_UpdatePointsInfo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_UpdatePointsInfo, CallFunc_Array_Add_ReturnValue) == 0x000070, "Member 'UMG_TimelineGraph_C_UpdatePointsInfo::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_UpdatePointsInfo, CallFunc_Array_Add_ReturnValue_1) == 0x000074, "Member 'UMG_TimelineGraph_C_UpdatePointsInfo::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_UpdatePointsInfo, CallFunc_Array_Length_ReturnValue_1) == 0x000078, "Member 'UMG_TimelineGraph_C_UpdatePointsInfo::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_UpdatePointsInfo, CallFunc_Less_IntInt_ReturnValue_1) == 0x00007C, "Member 'UMG_TimelineGraph_C_UpdatePointsInfo::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_UpdatePointsInfo, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x00007D, "Member 'UMG_TimelineGraph_C_UpdatePointsInfo::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_UpdatePointsInfo, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00007E, "Member 'UMG_TimelineGraph_C_UpdatePointsInfo::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_UpdatePointsInfo, CallFunc_BooleanOR_ReturnValue) == 0x00007F, "Member 'UMG_TimelineGraph_C_UpdatePointsInfo::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function UMG_TimelineGraph.UMG_TimelineGraph_C.PresentPointInfo
// 0x0048 (0x0048 - 0x0000)
struct UMG_TimelineGraph_C_PresentPointInfo final
{
public:
	class USQTimelinePoint*                       NewPoint;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm)
	TArray<int32>                                 K2Node_MakeArray_Array_1;                          // 0x0018(0x0010)(ReferenceParm)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSQTicketChangeLinked                  CallFunc_GetTeamTimelinePoint_OutPoint;            // 0x002C(0x0018)(NoDestructor)
};
static_assert(alignof(UMG_TimelineGraph_C_PresentPointInfo) == 0x000008, "Wrong alignment on UMG_TimelineGraph_C_PresentPointInfo");
static_assert(sizeof(UMG_TimelineGraph_C_PresentPointInfo) == 0x000048, "Wrong size on UMG_TimelineGraph_C_PresentPointInfo");
static_assert(offsetof(UMG_TimelineGraph_C_PresentPointInfo, NewPoint) == 0x000000, "Member 'UMG_TimelineGraph_C_PresentPointInfo::NewPoint' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_PresentPointInfo, K2Node_MakeArray_Array) == 0x000008, "Member 'UMG_TimelineGraph_C_PresentPointInfo::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_PresentPointInfo, K2Node_MakeArray_Array_1) == 0x000018, "Member 'UMG_TimelineGraph_C_PresentPointInfo::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_PresentPointInfo, CallFunc_Conv_IntToByte_ReturnValue) == 0x000028, "Member 'UMG_TimelineGraph_C_PresentPointInfo::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_PresentPointInfo, CallFunc_GetTeamTimelinePoint_OutPoint) == 0x00002C, "Member 'UMG_TimelineGraph_C_PresentPointInfo::CallFunc_GetTeamTimelinePoint_OutPoint' has a wrong offset!");

// Function UMG_TimelineGraph.UMG_TimelineGraph_C.GetTimeAtPoint
// 0x0048 (0x0048 - 0x0000)
struct UMG_TimelineGraph_C_GetTimeAtPoint final
{
public:
	struct FVector2D                              PointLoc;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 PointIndexes;                                      // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         TeamId;                                            // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time;                                              // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSQTicketChangeLinked                  CallFunc_GetTeamTimelinePoint_OutPoint;            // 0x0028(0x0018)(NoDestructor)
	float                                         CallFunc_GetTimeAtPosition_ReturnValue;            // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UMG_TimelineGraph_C_GetTimeAtPoint) == 0x000008, "Wrong alignment on UMG_TimelineGraph_C_GetTimeAtPoint");
static_assert(sizeof(UMG_TimelineGraph_C_GetTimeAtPoint) == 0x000048, "Wrong size on UMG_TimelineGraph_C_GetTimeAtPoint");
static_assert(offsetof(UMG_TimelineGraph_C_GetTimeAtPoint, PointLoc) == 0x000000, "Member 'UMG_TimelineGraph_C_GetTimeAtPoint::PointLoc' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_GetTimeAtPoint, PointIndexes) == 0x000008, "Member 'UMG_TimelineGraph_C_GetTimeAtPoint::PointIndexes' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_GetTimeAtPoint, TeamId) == 0x000018, "Member 'UMG_TimelineGraph_C_GetTimeAtPoint::TeamId' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_GetTimeAtPoint, Time) == 0x00001C, "Member 'UMG_TimelineGraph_C_GetTimeAtPoint::Time' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_GetTimeAtPoint, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'UMG_TimelineGraph_C_GetTimeAtPoint::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_GetTimeAtPoint, CallFunc_Conv_IntToByte_ReturnValue) == 0x000024, "Member 'UMG_TimelineGraph_C_GetTimeAtPoint::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_GetTimeAtPoint, CallFunc_Greater_IntInt_ReturnValue) == 0x000025, "Member 'UMG_TimelineGraph_C_GetTimeAtPoint::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_GetTimeAtPoint, CallFunc_GetTeamTimelinePoint_OutPoint) == 0x000028, "Member 'UMG_TimelineGraph_C_GetTimeAtPoint::CallFunc_GetTeamTimelinePoint_OutPoint' has a wrong offset!");
static_assert(offsetof(UMG_TimelineGraph_C_GetTimeAtPoint, CallFunc_GetTimeAtPosition_ReturnValue) == 0x000040, "Member 'UMG_TimelineGraph_C_GetTimeAtPoint::CallFunc_GetTimeAtPosition_ReturnValue' has a wrong offset!");

}

