#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UMG_ScoreboardTeamScore

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Squad_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UMG_ScoreboardTeamScore.UMG_ScoreboardTeamScore_C
// 0x00A8 (0x0378 - 0x02D0)
class UUMG_ScoreboardTeamScore_C final : public USQScoreboardTeamScore
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         BPEndOfRoundHorizontal;                            // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BPTeamNameText;                                    // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_CategoryIcon_C*                    CombatScoreIcon;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_CategoryIcon_C*                    DeathsScoreIcon;                                   // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         FriendlyIconsHB;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_CategoryIcon_C*                    HealingScoreIcon;                                  // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Flag;                                        // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_CategoryIcon_C*                    IncapsScoreIcon;                                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_CategoryIcon_C*                    KillsScoreIcon;                                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_CategoryIcon_C*                    LatencyIcon;                                       // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         MainHB;                                            // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_CategoryIcon_C*                    ObjectiveScoreIcon;                                // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_CategoryIcon_C*                    ReviveScoreIcon;                                   // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_CategoryIcon_C*                    TeamworkScoreIcon;                                 // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_CategoryIcon_C*                    VehicleKillIcon;                                   // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         FixedIconMinOffset;                                // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_354[0x4];                                      // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUMG_CategoryIcon_C*>            AllItemCategories;                                 // 0x0358(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	float                                         MinIconSize;                                       // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxIconSize;                                       // 0x036C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InGameIconsCount;                                  // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EndGameIconsCount;                                 // 0x0374(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UMG_ScoreboardTeamScore(int32 EntryPoint);
	void BPInit();
	void Construct();
	void SetTooltipWidget(class UUMG_Tooltip_C* ToolTipWidget_0);
	void SwitchToEndMatchMode();
	void UpdateFlagTexture(class UTexture2D* Texture);
	void SetFactionName(const class FText& FactionName);
	void RescaleWidget(const float& NewIconSize);
	void UpdateIconsSize(float NewSize);
	void GetVisibleIconsCount(int32* VisisbleItems);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UMG_ScoreboardTeamScore_C">();
	}
	static class UUMG_ScoreboardTeamScore_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUMG_ScoreboardTeamScore_C>();
	}
};
static_assert(alignof(UUMG_ScoreboardTeamScore_C) == 0x000008, "Wrong alignment on UUMG_ScoreboardTeamScore_C");
static_assert(sizeof(UUMG_ScoreboardTeamScore_C) == 0x000378, "Wrong size on UUMG_ScoreboardTeamScore_C");
static_assert(offsetof(UUMG_ScoreboardTeamScore_C, UberGraphFrame) == 0x0002D0, "Member 'UUMG_ScoreboardTeamScore_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardTeamScore_C, BPEndOfRoundHorizontal) == 0x0002D8, "Member 'UUMG_ScoreboardTeamScore_C::BPEndOfRoundHorizontal' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardTeamScore_C, BPTeamNameText) == 0x0002E0, "Member 'UUMG_ScoreboardTeamScore_C::BPTeamNameText' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardTeamScore_C, CombatScoreIcon) == 0x0002E8, "Member 'UUMG_ScoreboardTeamScore_C::CombatScoreIcon' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardTeamScore_C, DeathsScoreIcon) == 0x0002F0, "Member 'UUMG_ScoreboardTeamScore_C::DeathsScoreIcon' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardTeamScore_C, FriendlyIconsHB) == 0x0002F8, "Member 'UUMG_ScoreboardTeamScore_C::FriendlyIconsHB' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardTeamScore_C, HealingScoreIcon) == 0x000300, "Member 'UUMG_ScoreboardTeamScore_C::HealingScoreIcon' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardTeamScore_C, Image_Flag) == 0x000308, "Member 'UUMG_ScoreboardTeamScore_C::Image_Flag' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardTeamScore_C, IncapsScoreIcon) == 0x000310, "Member 'UUMG_ScoreboardTeamScore_C::IncapsScoreIcon' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardTeamScore_C, KillsScoreIcon) == 0x000318, "Member 'UUMG_ScoreboardTeamScore_C::KillsScoreIcon' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardTeamScore_C, LatencyIcon) == 0x000320, "Member 'UUMG_ScoreboardTeamScore_C::LatencyIcon' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardTeamScore_C, MainHB) == 0x000328, "Member 'UUMG_ScoreboardTeamScore_C::MainHB' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardTeamScore_C, ObjectiveScoreIcon) == 0x000330, "Member 'UUMG_ScoreboardTeamScore_C::ObjectiveScoreIcon' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardTeamScore_C, ReviveScoreIcon) == 0x000338, "Member 'UUMG_ScoreboardTeamScore_C::ReviveScoreIcon' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardTeamScore_C, TeamworkScoreIcon) == 0x000340, "Member 'UUMG_ScoreboardTeamScore_C::TeamworkScoreIcon' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardTeamScore_C, VehicleKillIcon) == 0x000348, "Member 'UUMG_ScoreboardTeamScore_C::VehicleKillIcon' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardTeamScore_C, FixedIconMinOffset) == 0x000350, "Member 'UUMG_ScoreboardTeamScore_C::FixedIconMinOffset' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardTeamScore_C, AllItemCategories) == 0x000358, "Member 'UUMG_ScoreboardTeamScore_C::AllItemCategories' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardTeamScore_C, MinIconSize) == 0x000368, "Member 'UUMG_ScoreboardTeamScore_C::MinIconSize' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardTeamScore_C, MaxIconSize) == 0x00036C, "Member 'UUMG_ScoreboardTeamScore_C::MaxIconSize' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardTeamScore_C, InGameIconsCount) == 0x000370, "Member 'UUMG_ScoreboardTeamScore_C::InGameIconsCount' has a wrong offset!");
static_assert(offsetof(UUMG_ScoreboardTeamScore_C, EndGameIconsCount) == 0x000374, "Member 'UUMG_ScoreboardTeamScore_C::EndGameIconsCount' has a wrong offset!");

}

