#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_DeployConfirmation

#include "Basic.hpp"

#include "Squad_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_DeployConfirmation.W_DeployConfirmation_C.ExecuteUbergraph_W_DeployConfirmation
// 0x0270 (0x0270 - 0x0000)
struct W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESQSpawnPointType                             Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSpawningEnabled_ReturnValue;           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetSieged_ReturnValue;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x0028(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0040(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0058(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0070(0x0018)()
	class FText                                   Temp_text_Variable_5;                              // 0x0088(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_6;                              // 0x00A8(0x0018)()
	class FText                                   Temp_text_Variable_7;                              // 0x00C0(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x00E0(0x0018)()
	bool                                          K2Node_ComponentBoundEvent_bSelected_1;            // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMainMenu_Button_C*                     K2Node_ComponentBoundEvent_Button_1;               // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASQPlayerController*                    K2Node_DynamicCast_AsSQPlayer_Controller;          // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x011C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0130(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable_8;                              // 0x0138(0x0018)()
	class ABP_PlayerController_C*                 K2Node_DynamicCast_AsBP_Player_Controller;         // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_1;                           // 0x0160(0x0018)()
	class FText                                   K2Node_Select_Default_2;                           // 0x0178(0x0018)()
	bool                                          CallFunc_MatchWaitingToStart_ReturnValue;          // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_192[0x6];                                      // 0x0192(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_3;                           // 0x0198(0x0018)()
	class ASQGameState*                           CallFunc_GetSquadGameState_Return_Value;           // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRemainingTime_ReturnValue;             // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_MatchWaitingToStart_ReturnValue_1;        // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BD[0x3];                                      // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_TimeUntilCanSpawn_ReturnValue;            // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x01D0(0x0040)(HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0218(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_229[0x7];                                      // 0x0229(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0230(0x0018)()
	class ASQGameSpawn*                           CallFunc_GetSelectedSpawn_ReturnValue;             // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bSelected;              // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMainMenu_Button_C*                     K2Node_ComponentBoundEvent_Button;                 // 0x0258(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASQGameSpawn*                           CallFunc_GetSelectedSpawn_ReturnValue_1;           // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation) == 0x000008, "Wrong alignment on W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation");
static_assert(sizeof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation) == 0x000270, "Wrong size on W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, EntryPoint) == 0x000000, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, Temp_byte_Variable) == 0x000004, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, CallFunc_GetSpawningEnabled_ReturnValue) == 0x000005, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::CallFunc_GetSpawningEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, CallFunc_GetSieged_ReturnValue) == 0x000006, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::CallFunc_GetSieged_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, CallFunc_Not_PreBool_ReturnValue) == 0x000007, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, Temp_text_Variable) == 0x000008, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, CallFunc_BooleanOR_ReturnValue) == 0x000020, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, Temp_text_Variable_1) == 0x000028, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, Temp_text_Variable_2) == 0x000040, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, Temp_text_Variable_3) == 0x000058, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, Temp_text_Variable_4) == 0x000070, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, Temp_text_Variable_5) == 0x000088, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, Temp_bool_Variable) == 0x0000A0, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, Temp_text_Variable_6) == 0x0000A8, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::Temp_text_Variable_6' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, Temp_text_Variable_7) == 0x0000C0, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::Temp_text_Variable_7' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, Temp_bool_Variable_1) == 0x0000D8, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, K2Node_Select_Default) == 0x0000E0, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, K2Node_ComponentBoundEvent_bSelected_1) == 0x0000F8, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::K2Node_ComponentBoundEvent_bSelected_1' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, K2Node_ComponentBoundEvent_Button_1) == 0x000100, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, CallFunc_GetOwningPlayer_ReturnValue) == 0x000108, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, K2Node_DynamicCast_AsSQPlayer_Controller) == 0x000110, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::K2Node_DynamicCast_AsSQPlayer_Controller' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, K2Node_DynamicCast_bSuccess) == 0x000118, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, K2Node_CreateDelegate_OutputDelegate) == 0x00011C, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000130, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, Temp_text_Variable_8) == 0x000138, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::Temp_text_Variable_8' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, K2Node_DynamicCast_AsBP_Player_Controller) == 0x000150, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::K2Node_DynamicCast_AsBP_Player_Controller' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, K2Node_DynamicCast_bSuccess_1) == 0x000158, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, K2Node_Select_Default_1) == 0x000160, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, K2Node_Select_Default_2) == 0x000178, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, CallFunc_MatchWaitingToStart_ReturnValue) == 0x000190, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::CallFunc_MatchWaitingToStart_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, Temp_bool_Variable_2) == 0x000191, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, K2Node_Select_Default_3) == 0x000198, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, CallFunc_GetSquadGameState_Return_Value) == 0x0001B0, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::CallFunc_GetSquadGameState_Return_Value' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, CallFunc_GetRemainingTime_ReturnValue) == 0x0001B8, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::CallFunc_GetRemainingTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, CallFunc_MatchWaitingToStart_ReturnValue_1) == 0x0001BC, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::CallFunc_MatchWaitingToStart_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, CallFunc_TimeUntilCanSpawn_ReturnValue) == 0x0001C0, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::CallFunc_TimeUntilCanSpawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, CallFunc_Round_ReturnValue) == 0x0001C4, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, CallFunc_IsValid_ReturnValue) == 0x0001C8, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, CallFunc_SelectInt_ReturnValue) == 0x0001CC, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, K2Node_MakeStruct_FormatArgumentData) == 0x0001D0, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, CallFunc_K2_GetPawn_ReturnValue) == 0x000210, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, K2Node_MakeArray_Array) == 0x000218, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, CallFunc_IsValid_ReturnValue_1) == 0x000228, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, CallFunc_Format_ReturnValue) == 0x000230, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, CallFunc_GetSelectedSpawn_ReturnValue) == 0x000248, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::CallFunc_GetSelectedSpawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, K2Node_ComponentBoundEvent_bSelected) == 0x000250, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::K2Node_ComponentBoundEvent_bSelected' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, K2Node_ComponentBoundEvent_Button) == 0x000258, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, CallFunc_IsValid_ReturnValue_2) == 0x000260, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation, CallFunc_GetSelectedSpawn_ReturnValue_1) == 0x000268, "Member 'W_DeployConfirmation_C_ExecuteUbergraph_W_DeployConfirmation::CallFunc_GetSelectedSpawn_ReturnValue_1' has a wrong offset!");

// Function W_DeployConfirmation.W_DeployConfirmation_C.BndEvt__ConfirmButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_DeployConfirmation_C_BndEvt__ConfirmButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature final
{
public:
	bool                                          bSelected;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMainMenu_Button_C*                     Button;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_DeployConfirmation_C_BndEvt__ConfirmButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on W_DeployConfirmation_C_BndEvt__ConfirmButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature");
static_assert(sizeof(W_DeployConfirmation_C_BndEvt__ConfirmButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature) == 0x000010, "Wrong size on W_DeployConfirmation_C_BndEvt__ConfirmButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature");
static_assert(offsetof(W_DeployConfirmation_C_BndEvt__ConfirmButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature, bSelected) == 0x000000, "Member 'W_DeployConfirmation_C_BndEvt__ConfirmButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature::bSelected' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_BndEvt__ConfirmButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature, Button) == 0x000008, "Member 'W_DeployConfirmation_C_BndEvt__ConfirmButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature::Button' has a wrong offset!");

// Function W_DeployConfirmation.W_DeployConfirmation_C.BndEvt__DeployButton_K2Node_ComponentBoundEvent_52_OnClicked__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_DeployConfirmation_C_BndEvt__DeployButton_K2Node_ComponentBoundEvent_52_OnClicked__DelegateSignature final
{
public:
	bool                                          bSelected;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMainMenu_Button_C*                     Button;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_DeployConfirmation_C_BndEvt__DeployButton_K2Node_ComponentBoundEvent_52_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on W_DeployConfirmation_C_BndEvt__DeployButton_K2Node_ComponentBoundEvent_52_OnClicked__DelegateSignature");
static_assert(sizeof(W_DeployConfirmation_C_BndEvt__DeployButton_K2Node_ComponentBoundEvent_52_OnClicked__DelegateSignature) == 0x000010, "Wrong size on W_DeployConfirmation_C_BndEvt__DeployButton_K2Node_ComponentBoundEvent_52_OnClicked__DelegateSignature");
static_assert(offsetof(W_DeployConfirmation_C_BndEvt__DeployButton_K2Node_ComponentBoundEvent_52_OnClicked__DelegateSignature, bSelected) == 0x000000, "Member 'W_DeployConfirmation_C_BndEvt__DeployButton_K2Node_ComponentBoundEvent_52_OnClicked__DelegateSignature::bSelected' has a wrong offset!");
static_assert(offsetof(W_DeployConfirmation_C_BndEvt__DeployButton_K2Node_ComponentBoundEvent_52_OnClicked__DelegateSignature, Button) == 0x000008, "Member 'W_DeployConfirmation_C_BndEvt__DeployButton_K2Node_ComponentBoundEvent_52_OnClicked__DelegateSignature::Button' has a wrong offset!");

}

