#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_EndTicketDetailsTeam

#include "Basic.hpp"

#include "Squad_structs.hpp"
#include "SQFactionEntry_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_EndTicketDetailsTeam.W_EndTicketDetailsTeam_C.ExecuteUbergraph_W_EndTicketDetailsTeam
// 0x0068 (0x0068 - 0x0000)
struct W_EndTicketDetailsTeam_C_ExecuteUbergraph_W_EndTicketDetailsTeam final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              K2Node_CustomEvent_FlagTexture;                    // 0x0010(0x0028)(HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0054(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(W_EndTicketDetailsTeam_C_ExecuteUbergraph_W_EndTicketDetailsTeam) == 0x000008, "Wrong alignment on W_EndTicketDetailsTeam_C_ExecuteUbergraph_W_EndTicketDetailsTeam");
static_assert(sizeof(W_EndTicketDetailsTeam_C_ExecuteUbergraph_W_EndTicketDetailsTeam) == 0x000068, "Wrong size on W_EndTicketDetailsTeam_C_ExecuteUbergraph_W_EndTicketDetailsTeam");
static_assert(offsetof(W_EndTicketDetailsTeam_C_ExecuteUbergraph_W_EndTicketDetailsTeam, EntryPoint) == 0x000000, "Member 'W_EndTicketDetailsTeam_C_ExecuteUbergraph_W_EndTicketDetailsTeam::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_ExecuteUbergraph_W_EndTicketDetailsTeam, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'W_EndTicketDetailsTeam_C_ExecuteUbergraph_W_EndTicketDetailsTeam::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_ExecuteUbergraph_W_EndTicketDetailsTeam, K2Node_CustomEvent_FlagTexture) == 0x000010, "Member 'W_EndTicketDetailsTeam_C_ExecuteUbergraph_W_EndTicketDetailsTeam::K2Node_CustomEvent_FlagTexture' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_ExecuteUbergraph_W_EndTicketDetailsTeam, Temp_object_Variable) == 0x000038, "Member 'W_EndTicketDetailsTeam_C_ExecuteUbergraph_W_EndTicketDetailsTeam::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_ExecuteUbergraph_W_EndTicketDetailsTeam, K2Node_CustomEvent_Loaded) == 0x000040, "Member 'W_EndTicketDetailsTeam_C_ExecuteUbergraph_W_EndTicketDetailsTeam::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_ExecuteUbergraph_W_EndTicketDetailsTeam, K2Node_DynamicCast_AsTexture_2D) == 0x000048, "Member 'W_EndTicketDetailsTeam_C_ExecuteUbergraph_W_EndTicketDetailsTeam::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_ExecuteUbergraph_W_EndTicketDetailsTeam, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'W_EndTicketDetailsTeam_C_ExecuteUbergraph_W_EndTicketDetailsTeam::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_ExecuteUbergraph_W_EndTicketDetailsTeam, K2Node_CreateDelegate_OutputDelegate) == 0x000054, "Member 'W_EndTicketDetailsTeam_C_ExecuteUbergraph_W_EndTicketDetailsTeam::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function W_EndTicketDetailsTeam.W_EndTicketDetailsTeam_C.UpdateFlag
// 0x0028 (0x0028 - 0x0000)
struct W_EndTicketDetailsTeam_C_UpdateFlag final
{
public:
	TSoftObjectPtr<class UTexture2D>              FlagTexture;                                       // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(W_EndTicketDetailsTeam_C_UpdateFlag) == 0x000008, "Wrong alignment on W_EndTicketDetailsTeam_C_UpdateFlag");
static_assert(sizeof(W_EndTicketDetailsTeam_C_UpdateFlag) == 0x000028, "Wrong size on W_EndTicketDetailsTeam_C_UpdateFlag");
static_assert(offsetof(W_EndTicketDetailsTeam_C_UpdateFlag, FlagTexture) == 0x000000, "Member 'W_EndTicketDetailsTeam_C_UpdateFlag::FlagTexture' has a wrong offset!");

// Function W_EndTicketDetailsTeam.W_EndTicketDetailsTeam_C.OnLoaded_D79A88F84BDA7FBE1B99B5A40699AFFD
// 0x0008 (0x0008 - 0x0000)
struct W_EndTicketDetailsTeam_C_OnLoaded_D79A88F84BDA7FBE1B99B5A40699AFFD final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_EndTicketDetailsTeam_C_OnLoaded_D79A88F84BDA7FBE1B99B5A40699AFFD) == 0x000008, "Wrong alignment on W_EndTicketDetailsTeam_C_OnLoaded_D79A88F84BDA7FBE1B99B5A40699AFFD");
static_assert(sizeof(W_EndTicketDetailsTeam_C_OnLoaded_D79A88F84BDA7FBE1B99B5A40699AFFD) == 0x000008, "Wrong size on W_EndTicketDetailsTeam_C_OnLoaded_D79A88F84BDA7FBE1B99B5A40699AFFD");
static_assert(offsetof(W_EndTicketDetailsTeam_C_OnLoaded_D79A88F84BDA7FBE1B99B5A40699AFFD, Loaded) == 0x000000, "Member 'W_EndTicketDetailsTeam_C_OnLoaded_D79A88F84BDA7FBE1B99B5A40699AFFD::Loaded' has a wrong offset!");

// Function W_EndTicketDetailsTeam.W_EndTicketDetailsTeam_C.RefreshTeam
// 0x05F0 (0x05F0 - 0x0000)
struct W_EndTicketDetailsTeam_C_RefreshTeam final
{
public:
	int32                                         InTeamIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_Tooltip_C*                         TooltipWidgetRef_0;                                // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USQFaction*                             CallFunc_GetFaction_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_SQFaction_C*                        K2Node_DynamicCast_AsBP_SQFaction;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryGetFactionEntry_Success;               // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSQFactionEntry                        CallFunc_TryGetFactionEntry_FactionEntry;          // 0x0030(0x0580)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_TryGetMediumSizeFlag_OutTexture;          // 0x05B0(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetMediumSizeFlag_ReturnValue;         // 0x05D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D9[0x7];                                      // 0x05D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASQTeamState*                           CallFunc_TryGetTeamState_OutTeamState;             // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetTeamState_ReturnValue;              // 0x05E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_EndTicketDetailsTeam_C_RefreshTeam) == 0x000008, "Wrong alignment on W_EndTicketDetailsTeam_C_RefreshTeam");
static_assert(sizeof(W_EndTicketDetailsTeam_C_RefreshTeam) == 0x0005F0, "Wrong size on W_EndTicketDetailsTeam_C_RefreshTeam");
static_assert(offsetof(W_EndTicketDetailsTeam_C_RefreshTeam, InTeamIndex) == 0x000000, "Member 'W_EndTicketDetailsTeam_C_RefreshTeam::InTeamIndex' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_RefreshTeam, TooltipWidgetRef_0) == 0x000008, "Member 'W_EndTicketDetailsTeam_C_RefreshTeam::TooltipWidgetRef_0' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_RefreshTeam, CallFunc_GetFaction_ReturnValue) == 0x000010, "Member 'W_EndTicketDetailsTeam_C_RefreshTeam::CallFunc_GetFaction_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_RefreshTeam, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'W_EndTicketDetailsTeam_C_RefreshTeam::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_RefreshTeam, K2Node_DynamicCast_AsBP_SQFaction) == 0x000020, "Member 'W_EndTicketDetailsTeam_C_RefreshTeam::K2Node_DynamicCast_AsBP_SQFaction' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_RefreshTeam, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'W_EndTicketDetailsTeam_C_RefreshTeam::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_RefreshTeam, CallFunc_TryGetFactionEntry_Success) == 0x000029, "Member 'W_EndTicketDetailsTeam_C_RefreshTeam::CallFunc_TryGetFactionEntry_Success' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_RefreshTeam, CallFunc_TryGetFactionEntry_FactionEntry) == 0x000030, "Member 'W_EndTicketDetailsTeam_C_RefreshTeam::CallFunc_TryGetFactionEntry_FactionEntry' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_RefreshTeam, CallFunc_TryGetMediumSizeFlag_OutTexture) == 0x0005B0, "Member 'W_EndTicketDetailsTeam_C_RefreshTeam::CallFunc_TryGetMediumSizeFlag_OutTexture' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_RefreshTeam, CallFunc_TryGetMediumSizeFlag_ReturnValue) == 0x0005D8, "Member 'W_EndTicketDetailsTeam_C_RefreshTeam::CallFunc_TryGetMediumSizeFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_RefreshTeam, CallFunc_TryGetTeamState_OutTeamState) == 0x0005E0, "Member 'W_EndTicketDetailsTeam_C_RefreshTeam::CallFunc_TryGetTeamState_OutTeamState' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_RefreshTeam, CallFunc_TryGetTeamState_ReturnValue) == 0x0005E8, "Member 'W_EndTicketDetailsTeam_C_RefreshTeam::CallFunc_TryGetTeamState_ReturnValue' has a wrong offset!");

// Function W_EndTicketDetailsTeam.W_EndTicketDetailsTeam_C.RefreshContent
// 0x0030 (0x0030 - 0x0000)
struct W_EndTicketDetailsTeam_C_RefreshContent final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	class ASQPlayerController*                    K2Node_DynamicCast_AsSQPlayer_Controller;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_EndTicketDetailsTeam_C_RefreshContent) == 0x000008, "Wrong alignment on W_EndTicketDetailsTeam_C_RefreshContent");
static_assert(sizeof(W_EndTicketDetailsTeam_C_RefreshContent) == 0x000030, "Wrong size on W_EndTicketDetailsTeam_C_RefreshContent");
static_assert(offsetof(W_EndTicketDetailsTeam_C_RefreshContent, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'W_EndTicketDetailsTeam_C_RefreshContent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_RefreshContent, CallFunc_GetPlayerController_ReturnValue) == 0x000010, "Member 'W_EndTicketDetailsTeam_C_RefreshContent::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_RefreshContent, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'W_EndTicketDetailsTeam_C_RefreshContent::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_RefreshContent, K2Node_DynamicCast_AsSQPlayer_Controller) == 0x000020, "Member 'W_EndTicketDetailsTeam_C_RefreshContent::K2Node_DynamicCast_AsSQPlayer_Controller' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_RefreshContent, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'W_EndTicketDetailsTeam_C_RefreshContent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_RefreshContent, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'W_EndTicketDetailsTeam_C_RefreshContent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_RefreshContent, CallFunc_Array_IsValidIndex_ReturnValue) == 0x00002A, "Member 'W_EndTicketDetailsTeam_C_RefreshContent::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function W_EndTicketDetailsTeam.W_EndTicketDetailsTeam_C.FillTicketDetails
// 0x0108 (0x0108 - 0x0000)
struct W_EndTicketDetailsTeam_C_FillTicketDetails final
{
public:
	struct FSQTicketsSummaryData                  InData;                                            // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class UWidget*>                        ChildrenList;                                      // 0x0040(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	TArray<class UW_TicketDetailsCategory_C*>     TicketCategories;                                  // 0x0050(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSQTicketsSummaryRecord                CallFunc_Array_Get_Item;                           // 0x008C(0x000C)(NoDestructor)
	struct FSQTicketsSummaryVehicleRecord         CallFunc_Array_Get_Item_1;                         // 0x0098(0x0018)(NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        K2Node_MakeArray_Array;                            // 0x00C0(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_TicketDetailsCategory_C*             CallFunc_Array_Get_Item_2;                         // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryAddRecord_Added;                       // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00E6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00E7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UWidget*                                CallFunc_Array_Get_Item_3;                         // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_TicketDetailsCategory_C*             K2Node_DynamicCast_AsW_Ticket_Details_Category;    // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_102[0x2];                                      // 0x0102(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_EndTicketDetailsTeam_C_FillTicketDetails) == 0x000008, "Wrong alignment on W_EndTicketDetailsTeam_C_FillTicketDetails");
static_assert(sizeof(W_EndTicketDetailsTeam_C_FillTicketDetails) == 0x000108, "Wrong size on W_EndTicketDetailsTeam_C_FillTicketDetails");
static_assert(offsetof(W_EndTicketDetailsTeam_C_FillTicketDetails, InData) == 0x000000, "Member 'W_EndTicketDetailsTeam_C_FillTicketDetails::InData' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_FillTicketDetails, ChildrenList) == 0x000040, "Member 'W_EndTicketDetailsTeam_C_FillTicketDetails::ChildrenList' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_FillTicketDetails, TicketCategories) == 0x000050, "Member 'W_EndTicketDetailsTeam_C_FillTicketDetails::TicketCategories' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_FillTicketDetails, Temp_int_Loop_Counter_Variable) == 0x000060, "Member 'W_EndTicketDetailsTeam_C_FillTicketDetails::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_FillTicketDetails, CallFunc_Add_IntInt_ReturnValue) == 0x000064, "Member 'W_EndTicketDetailsTeam_C_FillTicketDetails::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_FillTicketDetails, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'W_EndTicketDetailsTeam_C_FillTicketDetails::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_FillTicketDetails, CallFunc_Array_Length_ReturnValue_1) == 0x00006C, "Member 'W_EndTicketDetailsTeam_C_FillTicketDetails::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_FillTicketDetails, Temp_int_Loop_Counter_Variable_1) == 0x000070, "Member 'W_EndTicketDetailsTeam_C_FillTicketDetails::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_FillTicketDetails, Temp_int_Loop_Counter_Variable_2) == 0x000074, "Member 'W_EndTicketDetailsTeam_C_FillTicketDetails::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_FillTicketDetails, CallFunc_Less_IntInt_ReturnValue) == 0x000078, "Member 'W_EndTicketDetailsTeam_C_FillTicketDetails::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_FillTicketDetails, CallFunc_Less_IntInt_ReturnValue_1) == 0x000079, "Member 'W_EndTicketDetailsTeam_C_FillTicketDetails::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_FillTicketDetails, CallFunc_Add_IntInt_ReturnValue_1) == 0x00007C, "Member 'W_EndTicketDetailsTeam_C_FillTicketDetails::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_FillTicketDetails, CallFunc_Add_IntInt_ReturnValue_2) == 0x000080, "Member 'W_EndTicketDetailsTeam_C_FillTicketDetails::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_FillTicketDetails, Temp_int_Array_Index_Variable) == 0x000084, "Member 'W_EndTicketDetailsTeam_C_FillTicketDetails::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_FillTicketDetails, Temp_int_Array_Index_Variable_1) == 0x000088, "Member 'W_EndTicketDetailsTeam_C_FillTicketDetails::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_FillTicketDetails, CallFunc_Array_Get_Item) == 0x00008C, "Member 'W_EndTicketDetailsTeam_C_FillTicketDetails::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_FillTicketDetails, CallFunc_Array_Get_Item_1) == 0x000098, "Member 'W_EndTicketDetailsTeam_C_FillTicketDetails::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_FillTicketDetails, Temp_int_Loop_Counter_Variable_3) == 0x0000B0, "Member 'W_EndTicketDetailsTeam_C_FillTicketDetails::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_FillTicketDetails, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000B4, "Member 'W_EndTicketDetailsTeam_C_FillTicketDetails::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_FillTicketDetails, Temp_int_Array_Index_Variable_2) == 0x0000B8, "Member 'W_EndTicketDetailsTeam_C_FillTicketDetails::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_FillTicketDetails, Temp_int_Array_Index_Variable_3) == 0x0000BC, "Member 'W_EndTicketDetailsTeam_C_FillTicketDetails::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_FillTicketDetails, K2Node_MakeArray_Array) == 0x0000C0, "Member 'W_EndTicketDetailsTeam_C_FillTicketDetails::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_FillTicketDetails, Temp_bool_True_if_break_was_hit_Variable) == 0x0000D0, "Member 'W_EndTicketDetailsTeam_C_FillTicketDetails::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_FillTicketDetails, CallFunc_Array_Get_Item_2) == 0x0000D8, "Member 'W_EndTicketDetailsTeam_C_FillTicketDetails::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_FillTicketDetails, CallFunc_Array_Length_ReturnValue_2) == 0x0000E0, "Member 'W_EndTicketDetailsTeam_C_FillTicketDetails::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_FillTicketDetails, CallFunc_TryAddRecord_Added) == 0x0000E4, "Member 'W_EndTicketDetailsTeam_C_FillTicketDetails::CallFunc_TryAddRecord_Added' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_FillTicketDetails, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000E5, "Member 'W_EndTicketDetailsTeam_C_FillTicketDetails::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_FillTicketDetails, CallFunc_Not_PreBool_ReturnValue) == 0x0000E6, "Member 'W_EndTicketDetailsTeam_C_FillTicketDetails::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_FillTicketDetails, CallFunc_BooleanAND_ReturnValue) == 0x0000E7, "Member 'W_EndTicketDetailsTeam_C_FillTicketDetails::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_FillTicketDetails, CallFunc_Array_Get_Item_3) == 0x0000E8, "Member 'W_EndTicketDetailsTeam_C_FillTicketDetails::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_FillTicketDetails, CallFunc_Array_Length_ReturnValue_3) == 0x0000F0, "Member 'W_EndTicketDetailsTeam_C_FillTicketDetails::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_FillTicketDetails, K2Node_DynamicCast_AsW_Ticket_Details_Category) == 0x0000F8, "Member 'W_EndTicketDetailsTeam_C_FillTicketDetails::K2Node_DynamicCast_AsW_Ticket_Details_Category' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_FillTicketDetails, K2Node_DynamicCast_bSuccess) == 0x000100, "Member 'W_EndTicketDetailsTeam_C_FillTicketDetails::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_FillTicketDetails, CallFunc_Less_IntInt_ReturnValue_3) == 0x000101, "Member 'W_EndTicketDetailsTeam_C_FillTicketDetails::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_FillTicketDetails, CallFunc_Array_Add_ReturnValue) == 0x000104, "Member 'W_EndTicketDetailsTeam_C_FillTicketDetails::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function W_EndTicketDetailsTeam.W_EndTicketDetailsTeam_C.UpdateMainScores
// 0x0008 (0x0008 - 0x0000)
struct W_EndTicketDetailsTeam_C_UpdateMainScores final
{
public:
	int32                                         CallFunc_UpdateMainScore_Score;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_UpdateMainScore_Score_1;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_EndTicketDetailsTeam_C_UpdateMainScores) == 0x000004, "Wrong alignment on W_EndTicketDetailsTeam_C_UpdateMainScores");
static_assert(sizeof(W_EndTicketDetailsTeam_C_UpdateMainScores) == 0x000008, "Wrong size on W_EndTicketDetailsTeam_C_UpdateMainScores");
static_assert(offsetof(W_EndTicketDetailsTeam_C_UpdateMainScores, CallFunc_UpdateMainScore_Score) == 0x000000, "Member 'W_EndTicketDetailsTeam_C_UpdateMainScores::CallFunc_UpdateMainScore_Score' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_UpdateMainScores, CallFunc_UpdateMainScore_Score_1) == 0x000004, "Member 'W_EndTicketDetailsTeam_C_UpdateMainScores::CallFunc_UpdateMainScore_Score_1' has a wrong offset!");

// Function W_EndTicketDetailsTeam.W_EndTicketDetailsTeam_C.ForceExpandAll
// 0x0038 (0x0038 - 0x0000)
struct W_EndTicketDetailsTeam_C_ForceExpandAll final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UW_TicketDetailsCategory_C*>     K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_TicketDetailsCategory_C*             CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_EndTicketDetailsTeam_C_ForceExpandAll) == 0x000008, "Wrong alignment on W_EndTicketDetailsTeam_C_ForceExpandAll");
static_assert(sizeof(W_EndTicketDetailsTeam_C_ForceExpandAll) == 0x000038, "Wrong size on W_EndTicketDetailsTeam_C_ForceExpandAll");
static_assert(offsetof(W_EndTicketDetailsTeam_C_ForceExpandAll, Temp_int_Array_Index_Variable) == 0x000000, "Member 'W_EndTicketDetailsTeam_C_ForceExpandAll::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_ForceExpandAll, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'W_EndTicketDetailsTeam_C_ForceExpandAll::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_EndTicketDetailsTeam_C_ForceExpandAll, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'W_EndTicketDetailsTeam_C_ForceExpandAll::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
