#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_EndTicketDetailsTeam

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_EndTicketDetailsTeam.W_EndTicketDetailsTeam_C
// 0x0098 (0x02F8 - 0x0260)
class UW_EndTicketDetailsTeam_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             BPTeamNameText_1;                                  // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ContentScroll;                                     // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TicketDetailsCategory_C*             FOBLosses;                                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Flag_1;                                      // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TicketDetailsCategory_C*             InfantryLosses;                                    // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TicketDetailsCategory_Logistics_C*   Logistscs;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TicketDetailsCategory_C*             RemainingTicketsCategory;                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ScoreText;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ScoreText_1;                                       // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ScoreText_2;                                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TicketDetailsCategory_C*             StartTicketsCategory;                              // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TicketDetailsCategory_C*             TicketsGained;                                     // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TicketDetailsCategory_C*             TicketsLost;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           TicketsVB;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_TicketDetailsCategory_Vehicles_C*    VehicleLosses;                                     // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         TeamIndex;                                         // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASQTeamState*                           TeamState;                                         // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_Tooltip_C*                         TooltipWidgetRef;                                  // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_EndTicketDetailsTeam(int32 EntryPoint);
	void UpdateFlag(TSoftObjectPtr<class UTexture2D> FlagTexture);
	void Construct();
	void OnLoaded_D79A88F84BDA7FBE1B99B5A40699AFFD(class UObject* Loaded);
	void RefreshTeam(int32 InTeamIndex, class UUMG_Tooltip_C* TooltipWidgetRef_0);
	void RefreshContent();
	void FillTicketDetails(struct FSQTicketsSummaryData& InData);
	void CreateSubcategories();
	void UpdateMainScores();
	void ForceExpandAll();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_EndTicketDetailsTeam_C">();
	}
	static class UW_EndTicketDetailsTeam_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_EndTicketDetailsTeam_C>();
	}
};
static_assert(alignof(UW_EndTicketDetailsTeam_C) == 0x000008, "Wrong alignment on UW_EndTicketDetailsTeam_C");
static_assert(sizeof(UW_EndTicketDetailsTeam_C) == 0x0002F8, "Wrong size on UW_EndTicketDetailsTeam_C");
static_assert(offsetof(UW_EndTicketDetailsTeam_C, UberGraphFrame) == 0x000260, "Member 'UW_EndTicketDetailsTeam_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_EndTicketDetailsTeam_C, BPTeamNameText_1) == 0x000268, "Member 'UW_EndTicketDetailsTeam_C::BPTeamNameText_1' has a wrong offset!");
static_assert(offsetof(UW_EndTicketDetailsTeam_C, ContentScroll) == 0x000270, "Member 'UW_EndTicketDetailsTeam_C::ContentScroll' has a wrong offset!");
static_assert(offsetof(UW_EndTicketDetailsTeam_C, FOBLosses) == 0x000278, "Member 'UW_EndTicketDetailsTeam_C::FOBLosses' has a wrong offset!");
static_assert(offsetof(UW_EndTicketDetailsTeam_C, Image_Flag_1) == 0x000280, "Member 'UW_EndTicketDetailsTeam_C::Image_Flag_1' has a wrong offset!");
static_assert(offsetof(UW_EndTicketDetailsTeam_C, InfantryLosses) == 0x000288, "Member 'UW_EndTicketDetailsTeam_C::InfantryLosses' has a wrong offset!");
static_assert(offsetof(UW_EndTicketDetailsTeam_C, Logistscs) == 0x000290, "Member 'UW_EndTicketDetailsTeam_C::Logistscs' has a wrong offset!");
static_assert(offsetof(UW_EndTicketDetailsTeam_C, RemainingTicketsCategory) == 0x000298, "Member 'UW_EndTicketDetailsTeam_C::RemainingTicketsCategory' has a wrong offset!");
static_assert(offsetof(UW_EndTicketDetailsTeam_C, ScoreText) == 0x0002A0, "Member 'UW_EndTicketDetailsTeam_C::ScoreText' has a wrong offset!");
static_assert(offsetof(UW_EndTicketDetailsTeam_C, ScoreText_1) == 0x0002A8, "Member 'UW_EndTicketDetailsTeam_C::ScoreText_1' has a wrong offset!");
static_assert(offsetof(UW_EndTicketDetailsTeam_C, ScoreText_2) == 0x0002B0, "Member 'UW_EndTicketDetailsTeam_C::ScoreText_2' has a wrong offset!");
static_assert(offsetof(UW_EndTicketDetailsTeam_C, StartTicketsCategory) == 0x0002B8, "Member 'UW_EndTicketDetailsTeam_C::StartTicketsCategory' has a wrong offset!");
static_assert(offsetof(UW_EndTicketDetailsTeam_C, TicketsGained) == 0x0002C0, "Member 'UW_EndTicketDetailsTeam_C::TicketsGained' has a wrong offset!");
static_assert(offsetof(UW_EndTicketDetailsTeam_C, TicketsLost) == 0x0002C8, "Member 'UW_EndTicketDetailsTeam_C::TicketsLost' has a wrong offset!");
static_assert(offsetof(UW_EndTicketDetailsTeam_C, TicketsVB) == 0x0002D0, "Member 'UW_EndTicketDetailsTeam_C::TicketsVB' has a wrong offset!");
static_assert(offsetof(UW_EndTicketDetailsTeam_C, VehicleLosses) == 0x0002D8, "Member 'UW_EndTicketDetailsTeam_C::VehicleLosses' has a wrong offset!");
static_assert(offsetof(UW_EndTicketDetailsTeam_C, TeamIndex) == 0x0002E0, "Member 'UW_EndTicketDetailsTeam_C::TeamIndex' has a wrong offset!");
static_assert(offsetof(UW_EndTicketDetailsTeam_C, TeamState) == 0x0002E8, "Member 'UW_EndTicketDetailsTeam_C::TeamState' has a wrong offset!");
static_assert(offsetof(UW_EndTicketDetailsTeam_C, TooltipWidgetRef) == 0x0002F0, "Member 'UW_EndTicketDetailsTeam_C::TooltipWidgetRef' has a wrong offset!");

}

