#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_EndRound

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "W_EndRound_Base_classes.hpp"
#include "Squad_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_EndRound.W_EndRound_C
// 0x00D0 (0x0340 - 0x0270)
class UW_EndRound_C final : public UW_EndRound_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       BounceText;                                        // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               FactionResultOverlay;                              // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PlayerCallout_C*                     Loser;                                             // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MenuBackgroundCrosses;                             // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MenuBackgroundCrosses_1;                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PlayerCalloutsBox;                                 // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                PlayerCalloutSeparator;                            // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ResultBackground;                                  // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ResultBorder;                                      // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ResultGlow;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ResultOverlay;                                     // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RoundDurationText;                                 // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TB_Team;                                           // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         TicketBox;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TicketIcon;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_PlayerCallout_C*                     Winner;                                            // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             WinText;                                           // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ASQPlayerController*                    My_PC;                                             // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         On_Screen_Time;                                    // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAudioComponent*                        Draw_Sound_0;                                      // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USQEndStatsComponent*                   EndStatComponent;                                  // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_Tooltip_C*                         SquadTooltip;                                      // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASQTeamState*                           WinningTeamState;                                  // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASQTeamState*                           LosingTeamState;                                   // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_EndRound(int32 EntryPoint);
	void Event_Play_Team_Sounds();
	void HUD_Scoreboard();
	void Construct();
	void OnLoaded_4D00979747334CD613094AA5E0E4B4C2(class UObject* Loaded);
	void Init_End_Round_Screen();
	void RefreshStatus();
	void UpdateResults(class USQEndStatsComponent* EndStats);
	void SecondsToText(int32 Seconds, class FText* TimeText);
	void ApplyDrawColors();
	void ApplyDefeatColors();
	void ApplyWinColors();
	void FillPlayerCallouts();
	void GetCalloutData(struct FSQPlayerCalloutScore& PlayerCallout, class FText* Title, TSoftObjectPtr<class UTexture2D>* Flag, class FText* Name_0, bool* Valid, class FText* Tooltip, class FText* AdditionalText);
	void UpdateTicketsIcon();
	void UpdateTeamTicketsCount();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_EndRound_C">();
	}
	static class UW_EndRound_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_EndRound_C>();
	}
};
static_assert(alignof(UW_EndRound_C) == 0x000008, "Wrong alignment on UW_EndRound_C");
static_assert(sizeof(UW_EndRound_C) == 0x000340, "Wrong size on UW_EndRound_C");
static_assert(offsetof(UW_EndRound_C, UberGraphFrame) == 0x000270, "Member 'UW_EndRound_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_EndRound_C, BounceText) == 0x000278, "Member 'UW_EndRound_C::BounceText' has a wrong offset!");
static_assert(offsetof(UW_EndRound_C, FactionResultOverlay) == 0x000280, "Member 'UW_EndRound_C::FactionResultOverlay' has a wrong offset!");
static_assert(offsetof(UW_EndRound_C, Image) == 0x000288, "Member 'UW_EndRound_C::Image' has a wrong offset!");
static_assert(offsetof(UW_EndRound_C, Loser) == 0x000290, "Member 'UW_EndRound_C::Loser' has a wrong offset!");
static_assert(offsetof(UW_EndRound_C, MenuBackgroundCrosses) == 0x000298, "Member 'UW_EndRound_C::MenuBackgroundCrosses' has a wrong offset!");
static_assert(offsetof(UW_EndRound_C, MenuBackgroundCrosses_1) == 0x0002A0, "Member 'UW_EndRound_C::MenuBackgroundCrosses_1' has a wrong offset!");
static_assert(offsetof(UW_EndRound_C, PlayerCalloutsBox) == 0x0002A8, "Member 'UW_EndRound_C::PlayerCalloutsBox' has a wrong offset!");
static_assert(offsetof(UW_EndRound_C, PlayerCalloutSeparator) == 0x0002B0, "Member 'UW_EndRound_C::PlayerCalloutSeparator' has a wrong offset!");
static_assert(offsetof(UW_EndRound_C, ResultBackground) == 0x0002B8, "Member 'UW_EndRound_C::ResultBackground' has a wrong offset!");
static_assert(offsetof(UW_EndRound_C, ResultBorder) == 0x0002C0, "Member 'UW_EndRound_C::ResultBorder' has a wrong offset!");
static_assert(offsetof(UW_EndRound_C, ResultGlow) == 0x0002C8, "Member 'UW_EndRound_C::ResultGlow' has a wrong offset!");
static_assert(offsetof(UW_EndRound_C, ResultOverlay) == 0x0002D0, "Member 'UW_EndRound_C::ResultOverlay' has a wrong offset!");
static_assert(offsetof(UW_EndRound_C, RoundDurationText) == 0x0002D8, "Member 'UW_EndRound_C::RoundDurationText' has a wrong offset!");
static_assert(offsetof(UW_EndRound_C, TB_Team) == 0x0002E0, "Member 'UW_EndRound_C::TB_Team' has a wrong offset!");
static_assert(offsetof(UW_EndRound_C, TicketBox) == 0x0002E8, "Member 'UW_EndRound_C::TicketBox' has a wrong offset!");
static_assert(offsetof(UW_EndRound_C, TicketIcon) == 0x0002F0, "Member 'UW_EndRound_C::TicketIcon' has a wrong offset!");
static_assert(offsetof(UW_EndRound_C, Winner) == 0x0002F8, "Member 'UW_EndRound_C::Winner' has a wrong offset!");
static_assert(offsetof(UW_EndRound_C, WinText) == 0x000300, "Member 'UW_EndRound_C::WinText' has a wrong offset!");
static_assert(offsetof(UW_EndRound_C, My_PC) == 0x000308, "Member 'UW_EndRound_C::My_PC' has a wrong offset!");
static_assert(offsetof(UW_EndRound_C, On_Screen_Time) == 0x000310, "Member 'UW_EndRound_C::On_Screen_Time' has a wrong offset!");
static_assert(offsetof(UW_EndRound_C, Draw_Sound_0) == 0x000318, "Member 'UW_EndRound_C::Draw_Sound_0' has a wrong offset!");
static_assert(offsetof(UW_EndRound_C, EndStatComponent) == 0x000320, "Member 'UW_EndRound_C::EndStatComponent' has a wrong offset!");
static_assert(offsetof(UW_EndRound_C, SquadTooltip) == 0x000328, "Member 'UW_EndRound_C::SquadTooltip' has a wrong offset!");
static_assert(offsetof(UW_EndRound_C, WinningTeamState) == 0x000330, "Member 'UW_EndRound_C::WinningTeamState' has a wrong offset!");
static_assert(offsetof(UW_EndRound_C, LosingTeamState) == 0x000338, "Member 'UW_EndRound_C::LosingTeamState' has a wrong offset!");

}

