#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_EndTicketDetailsScreen

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_EndTicketDetailsScreen.W_EndTicketDetailsScreen_C
// 0x0040 (0x02A0 - 0x0260)
class UW_EndTicketDetailsScreen_C final : public UUserWidget
{
public:
	class UW_EndTicketDetailsTeam_C*              EnemyTeam;                                         // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_EndTicketDetailsTeam_C*              FriendlyTeam;                                      // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_0;                                   // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_130;                                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_2;                                        // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_4;                                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          InitDone;                                          // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMG_Tooltip_C*                         TooltipWidgetRef;                                  // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Refresh();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_EndTicketDetailsScreen_C">();
	}
	static class UW_EndTicketDetailsScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_EndTicketDetailsScreen_C>();
	}
};
static_assert(alignof(UW_EndTicketDetailsScreen_C) == 0x000008, "Wrong alignment on UW_EndTicketDetailsScreen_C");
static_assert(sizeof(UW_EndTicketDetailsScreen_C) == 0x0002A0, "Wrong size on UW_EndTicketDetailsScreen_C");
static_assert(offsetof(UW_EndTicketDetailsScreen_C, EnemyTeam) == 0x000260, "Member 'UW_EndTicketDetailsScreen_C::EnemyTeam' has a wrong offset!");
static_assert(offsetof(UW_EndTicketDetailsScreen_C, FriendlyTeam) == 0x000268, "Member 'UW_EndTicketDetailsScreen_C::FriendlyTeam' has a wrong offset!");
static_assert(offsetof(UW_EndTicketDetailsScreen_C, HorizontalBox_0) == 0x000270, "Member 'UW_EndTicketDetailsScreen_C::HorizontalBox_0' has a wrong offset!");
static_assert(offsetof(UW_EndTicketDetailsScreen_C, Image_130) == 0x000278, "Member 'UW_EndTicketDetailsScreen_C::Image_130' has a wrong offset!");
static_assert(offsetof(UW_EndTicketDetailsScreen_C, ScaleBox_2) == 0x000280, "Member 'UW_EndTicketDetailsScreen_C::ScaleBox_2' has a wrong offset!");
static_assert(offsetof(UW_EndTicketDetailsScreen_C, ScaleBox_4) == 0x000288, "Member 'UW_EndTicketDetailsScreen_C::ScaleBox_4' has a wrong offset!");
static_assert(offsetof(UW_EndTicketDetailsScreen_C, InitDone) == 0x000290, "Member 'UW_EndTicketDetailsScreen_C::InitDone' has a wrong offset!");
static_assert(offsetof(UW_EndTicketDetailsScreen_C, TooltipWidgetRef) == 0x000298, "Member 'UW_EndTicketDetailsScreen_C::TooltipWidgetRef' has a wrong offset!");

}

