#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_FavouriteButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_FavouriteButton.W_FavouriteButton_C
// 0x0058 (0x02B8 - 0x0260)
class UW_FavouriteButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowAnim;                                          // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Fav;                                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_FavPulse;                                   // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_MainMenuButton_C*                    Button_Favourite;                                  // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   DefaultFavoriteText;                               // 0x0288(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   MarkFavoriteText;                                  // 0x02A0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_W_FavouriteButton(int32 EntryPoint);
	void BndEvt__W_FavouriteButton_Button_Favourite_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature(bool bSelected, class UW_MainMenuButton_C* Button);
	void ShowButton(float Delay);
	void IsFavourite(bool* Valid, bool* Favourite);
	void UpdateFavouriteName();
	void ToggleFavourite(bool Is_Fave);
	void IsValidFavourite(TArray<class FString>& Favourites, class FString& UniqueID, bool Licensed, bool* Valid);
	void Update_Favourite();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_FavouriteButton_C">();
	}
	static class UW_FavouriteButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_FavouriteButton_C>();
	}
};
static_assert(alignof(UW_FavouriteButton_C) == 0x000008, "Wrong alignment on UW_FavouriteButton_C");
static_assert(sizeof(UW_FavouriteButton_C) == 0x0002B8, "Wrong size on UW_FavouriteButton_C");
static_assert(offsetof(UW_FavouriteButton_C, UberGraphFrame) == 0x000260, "Member 'UW_FavouriteButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UW_FavouriteButton_C, ShowAnim) == 0x000268, "Member 'UW_FavouriteButton_C::ShowAnim' has a wrong offset!");
static_assert(offsetof(UW_FavouriteButton_C, Border_Fav) == 0x000270, "Member 'UW_FavouriteButton_C::Border_Fav' has a wrong offset!");
static_assert(offsetof(UW_FavouriteButton_C, Border_FavPulse) == 0x000278, "Member 'UW_FavouriteButton_C::Border_FavPulse' has a wrong offset!");
static_assert(offsetof(UW_FavouriteButton_C, Button_Favourite) == 0x000280, "Member 'UW_FavouriteButton_C::Button_Favourite' has a wrong offset!");
static_assert(offsetof(UW_FavouriteButton_C, DefaultFavoriteText) == 0x000288, "Member 'UW_FavouriteButton_C::DefaultFavoriteText' has a wrong offset!");
static_assert(offsetof(UW_FavouriteButton_C, MarkFavoriteText) == 0x0002A0, "Member 'UW_FavouriteButton_C::MarkFavoriteText' has a wrong offset!");

}

