#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Menu_Input_ToolTip

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function W_Menu_Input_ToolTip.W_Menu_Input_ToolTip_C.ExecuteUbergraph_W_Menu_Input_ToolTip
// 0x01A0 (0x01A0 - 0x0000)
struct W_Menu_Input_ToolTip_C_ExecuteUbergraph_W_Menu_Input_ToolTip final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0008(0x0018)()
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0020(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0058(0x0070)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00C8(0x0070)(ConstParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14B[0x5];                                      // 0x014B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_ParseKeybind_Short_Name;                  // 0x0160(0x0018)()
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0178(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UBorderSlot*                            CallFunc_SlotAsBorderSlot_ReturnValue;             // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_Action;                         // 0x0188(0x0018)()
};
static_assert(alignof(W_Menu_Input_ToolTip_C_ExecuteUbergraph_W_Menu_Input_ToolTip) == 0x000008, "Wrong alignment on W_Menu_Input_ToolTip_C_ExecuteUbergraph_W_Menu_Input_ToolTip");
static_assert(sizeof(W_Menu_Input_ToolTip_C_ExecuteUbergraph_W_Menu_Input_ToolTip) == 0x0001A0, "Wrong size on W_Menu_Input_ToolTip_C_ExecuteUbergraph_W_Menu_Input_ToolTip");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ExecuteUbergraph_W_Menu_Input_ToolTip, EntryPoint) == 0x000000, "Member 'W_Menu_Input_ToolTip_C_ExecuteUbergraph_W_Menu_Input_ToolTip::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ExecuteUbergraph_W_Menu_Input_ToolTip, Temp_bool_Variable) == 0x000004, "Member 'W_Menu_Input_ToolTip_C_ExecuteUbergraph_W_Menu_Input_ToolTip::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ExecuteUbergraph_W_Menu_Input_ToolTip, Temp_byte_Variable) == 0x000005, "Member 'W_Menu_Input_ToolTip_C_ExecuteUbergraph_W_Menu_Input_ToolTip::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ExecuteUbergraph_W_Menu_Input_ToolTip, Temp_byte_Variable_1) == 0x000006, "Member 'W_Menu_Input_ToolTip_C_ExecuteUbergraph_W_Menu_Input_ToolTip::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ExecuteUbergraph_W_Menu_Input_ToolTip, K2Node_Event_IsDesignTime) == 0x000007, "Member 'W_Menu_Input_ToolTip_C_ExecuteUbergraph_W_Menu_Input_ToolTip::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ExecuteUbergraph_W_Menu_Input_ToolTip, CallFunc_TextToUpper_ReturnValue) == 0x000008, "Member 'W_Menu_Input_ToolTip_C_ExecuteUbergraph_W_Menu_Input_ToolTip::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ExecuteUbergraph_W_Menu_Input_ToolTip, K2Node_Event_MyGeometry) == 0x000020, "Member 'W_Menu_Input_ToolTip_C_ExecuteUbergraph_W_Menu_Input_ToolTip::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ExecuteUbergraph_W_Menu_Input_ToolTip, K2Node_Event_MouseEvent_1) == 0x000058, "Member 'W_Menu_Input_ToolTip_C_ExecuteUbergraph_W_Menu_Input_ToolTip::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ExecuteUbergraph_W_Menu_Input_ToolTip, K2Node_Event_MouseEvent) == 0x0000C8, "Member 'W_Menu_Input_ToolTip_C_ExecuteUbergraph_W_Menu_Input_ToolTip::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ExecuteUbergraph_W_Menu_Input_ToolTip, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000138, "Member 'W_Menu_Input_ToolTip_C_ExecuteUbergraph_W_Menu_Input_ToolTip::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ExecuteUbergraph_W_Menu_Input_ToolTip, CallFunc_PlayAnimationForward_ReturnValue) == 0x000140, "Member 'W_Menu_Input_ToolTip_C_ExecuteUbergraph_W_Menu_Input_ToolTip::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ExecuteUbergraph_W_Menu_Input_ToolTip, K2Node_Select_Default) == 0x000148, "Member 'W_Menu_Input_ToolTip_C_ExecuteUbergraph_W_Menu_Input_ToolTip::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ExecuteUbergraph_W_Menu_Input_ToolTip, CallFunc_TextIsEmpty_ReturnValue) == 0x000149, "Member 'W_Menu_Input_ToolTip_C_ExecuteUbergraph_W_Menu_Input_ToolTip::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ExecuteUbergraph_W_Menu_Input_ToolTip, CallFunc_Not_PreBool_ReturnValue) == 0x00014A, "Member 'W_Menu_Input_ToolTip_C_ExecuteUbergraph_W_Menu_Input_ToolTip::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ExecuteUbergraph_W_Menu_Input_ToolTip, CallFunc_Conv_TextToString_ReturnValue) == 0x000150, "Member 'W_Menu_Input_ToolTip_C_ExecuteUbergraph_W_Menu_Input_ToolTip::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ExecuteUbergraph_W_Menu_Input_ToolTip, CallFunc_ParseKeybind_Short_Name) == 0x000160, "Member 'W_Menu_Input_ToolTip_C_ExecuteUbergraph_W_Menu_Input_ToolTip::CallFunc_ParseKeybind_Short_Name' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ExecuteUbergraph_W_Menu_Input_ToolTip, CallFunc_K2_SetTimer_ReturnValue) == 0x000178, "Member 'W_Menu_Input_ToolTip_C_ExecuteUbergraph_W_Menu_Input_ToolTip::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ExecuteUbergraph_W_Menu_Input_ToolTip, CallFunc_SlotAsBorderSlot_ReturnValue) == 0x000180, "Member 'W_Menu_Input_ToolTip_C_ExecuteUbergraph_W_Menu_Input_ToolTip::CallFunc_SlotAsBorderSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ExecuteUbergraph_W_Menu_Input_ToolTip, K2Node_CustomEvent_Action) == 0x000188, "Member 'W_Menu_Input_ToolTip_C_ExecuteUbergraph_W_Menu_Input_ToolTip::K2Node_CustomEvent_Action' has a wrong offset!");

// Function W_Menu_Input_ToolTip.W_Menu_Input_ToolTip_C.UpdateAction
// 0x0018 (0x0018 - 0x0000)
struct W_Menu_Input_ToolTip_C_UpdateAction final
{
public:
	class FText                                   Action_0;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(W_Menu_Input_ToolTip_C_UpdateAction) == 0x000008, "Wrong alignment on W_Menu_Input_ToolTip_C_UpdateAction");
static_assert(sizeof(W_Menu_Input_ToolTip_C_UpdateAction) == 0x000018, "Wrong size on W_Menu_Input_ToolTip_C_UpdateAction");
static_assert(offsetof(W_Menu_Input_ToolTip_C_UpdateAction, Action_0) == 0x000000, "Member 'W_Menu_Input_ToolTip_C_UpdateAction::Action_0' has a wrong offset!");

// Function W_Menu_Input_ToolTip.W_Menu_Input_ToolTip_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct W_Menu_Input_ToolTip_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(W_Menu_Input_ToolTip_C_OnMouseLeave) == 0x000008, "Wrong alignment on W_Menu_Input_ToolTip_C_OnMouseLeave");
static_assert(sizeof(W_Menu_Input_ToolTip_C_OnMouseLeave) == 0x000070, "Wrong size on W_Menu_Input_ToolTip_C_OnMouseLeave");
static_assert(offsetof(W_Menu_Input_ToolTip_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'W_Menu_Input_ToolTip_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function W_Menu_Input_ToolTip.W_Menu_Input_ToolTip_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct W_Menu_Input_ToolTip_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(W_Menu_Input_ToolTip_C_OnMouseEnter) == 0x000008, "Wrong alignment on W_Menu_Input_ToolTip_C_OnMouseEnter");
static_assert(sizeof(W_Menu_Input_ToolTip_C_OnMouseEnter) == 0x0000A8, "Wrong size on W_Menu_Input_ToolTip_C_OnMouseEnter");
static_assert(offsetof(W_Menu_Input_ToolTip_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'W_Menu_Input_ToolTip_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'W_Menu_Input_ToolTip_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function W_Menu_Input_ToolTip.W_Menu_Input_ToolTip_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_Menu_Input_ToolTip_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_Menu_Input_ToolTip_C_PreConstruct) == 0x000001, "Wrong alignment on W_Menu_Input_ToolTip_C_PreConstruct");
static_assert(sizeof(W_Menu_Input_ToolTip_C_PreConstruct) == 0x000001, "Wrong size on W_Menu_Input_ToolTip_C_PreConstruct");
static_assert(offsetof(W_Menu_Input_ToolTip_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_Menu_Input_ToolTip_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_Menu_Input_ToolTip.W_Menu_Input_ToolTip_C.ParseKeybind
// 0x0290 (0x0290 - 0x0000)
struct W_Menu_Input_ToolTip_C_ParseKeybind final
{
public:
	class FString                                 InString;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   Short_Name;                                        // 0x0010(0x0018)(Parm, OutParm)
	class FText                                   L_Axis;                                            // 0x0028(0x0018)(Edit, BlueprintVisible)
	TArray<class FName>                           L_Axis_List;                                       // 0x0040(0x0010)(Edit, BlueprintVisible)
	bool                                          Temp_bool_Variable;                                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInputAxisKeyMapping>           CallFunc_GetKeysMapedToAxis_Keys;                  // 0x0060(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FInputAxisKeyMapping>           CallFunc_GetKeysMapedToAxis_Keys_1;                // 0x0080(0x0010)(ReferenceParm)
	class FName                                   CallFunc_GetActionKeyName_Name;                    // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetActionKeyName_ReturnValue;             // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetShortName_Short_Name;                  // 0x00A8(0x0018)()
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputAxisKeyMapping                   CallFunc_Array_Get_Item;                           // 0x00C8(0x0028)()
	class FName                                   CallFunc_BreakInputAxisKeyMapping_ActionName;      // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   CallFunc_BreakInputAxisKeyMapping_Key;             // 0x00F8(0x0018)(HasGetValueTypeHash)
	float                                         CallFunc_BreakInputAxisKeyMapping_Scale;           // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetKeyName_OutName;                       // 0x0114(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Key_IsKeyboardKey_ReturnValue;            // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputAxisKeyMapping                   CallFunc_Array_Get_Item_1;                         // 0x0130(0x0028)()
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakInputAxisKeyMapping_ActionName_1;    // 0x015C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   CallFunc_BreakInputAxisKeyMapping_Key_1;           // 0x0168(0x0018)(HasGetValueTypeHash)
	float                                         CallFunc_BreakInputAxisKeyMapping_Scale_1;         // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetKeyName_OutName_1;                     // 0x0184(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Key_IsKeyboardKey_ReturnValue_1;          // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18D[0x3];                                      // 0x018D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0190(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item_2;                         // 0x01D4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetShortName_Short_Name_1;                // 0x01E0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x01F8(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0240(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0258(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0270(0x0018)()
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_Menu_Input_ToolTip_C_ParseKeybind) == 0x000008, "Wrong alignment on W_Menu_Input_ToolTip_C_ParseKeybind");
static_assert(sizeof(W_Menu_Input_ToolTip_C_ParseKeybind) == 0x000290, "Wrong size on W_Menu_Input_ToolTip_C_ParseKeybind");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, InString) == 0x000000, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::InString' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, Short_Name) == 0x000010, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::Short_Name' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, L_Axis) == 0x000028, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::L_Axis' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, L_Axis_List) == 0x000040, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::L_Axis_List' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, Temp_bool_Variable) == 0x000050, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, CallFunc_Conv_StringToName_ReturnValue) == 0x000054, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, Temp_int_Loop_Counter_Variable) == 0x00005C, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, CallFunc_GetKeysMapedToAxis_Keys) == 0x000060, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::CallFunc_GetKeysMapedToAxis_Keys' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, CallFunc_Add_IntInt_ReturnValue) == 0x000070, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, CallFunc_Array_Length_ReturnValue) == 0x000074, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, CallFunc_Less_IntInt_ReturnValue) == 0x000078, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, CallFunc_GetKeysMapedToAxis_Keys_1) == 0x000080, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::CallFunc_GetKeysMapedToAxis_Keys_1' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, CallFunc_GetActionKeyName_Name) == 0x000090, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::CallFunc_GetActionKeyName_Name' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, CallFunc_GetActionKeyName_ReturnValue) == 0x000098, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::CallFunc_GetActionKeyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, CallFunc_Array_Length_ReturnValue_1) == 0x00009C, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, CallFunc_Not_PreBool_ReturnValue) == 0x0000A0, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, CallFunc_GetShortName_Short_Name) == 0x0000A8, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::CallFunc_GetShortName_Short_Name' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, Temp_int_Array_Index_Variable) == 0x0000C0, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, Temp_int_Array_Index_Variable_1) == 0x0000C4, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, CallFunc_BreakInputAxisKeyMapping_ActionName) == 0x0000F0, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::CallFunc_BreakInputAxisKeyMapping_ActionName' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, CallFunc_BreakInputAxisKeyMapping_Key) == 0x0000F8, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::CallFunc_BreakInputAxisKeyMapping_Key' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, CallFunc_BreakInputAxisKeyMapping_Scale) == 0x000110, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::CallFunc_BreakInputAxisKeyMapping_Scale' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, CallFunc_GetKeyName_OutName) == 0x000114, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::CallFunc_GetKeyName_OutName' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, CallFunc_Key_IsKeyboardKey_ReturnValue) == 0x00011C, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::CallFunc_Key_IsKeyboardKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, Temp_int_Loop_Counter_Variable_1) == 0x000120, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, CallFunc_Less_IntInt_ReturnValue_1) == 0x000124, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, CallFunc_Add_IntInt_ReturnValue_1) == 0x000128, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, Temp_int_Array_Index_Variable_2) == 0x00012C, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, CallFunc_Array_Get_Item_1) == 0x000130, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, CallFunc_Array_AddUnique_ReturnValue) == 0x000158, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, CallFunc_BreakInputAxisKeyMapping_ActionName_1) == 0x00015C, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::CallFunc_BreakInputAxisKeyMapping_ActionName_1' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, CallFunc_BreakInputAxisKeyMapping_Key_1) == 0x000168, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::CallFunc_BreakInputAxisKeyMapping_Key_1' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, CallFunc_BreakInputAxisKeyMapping_Scale_1) == 0x000180, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::CallFunc_BreakInputAxisKeyMapping_Scale_1' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, CallFunc_GetKeyName_OutName_1) == 0x000184, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::CallFunc_GetKeyName_OutName_1' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, CallFunc_Key_IsKeyboardKey_ReturnValue_1) == 0x00018C, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::CallFunc_Key_IsKeyboardKey_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, K2Node_MakeStruct_FormatArgumentData) == 0x000190, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, CallFunc_TextIsEmpty_ReturnValue) == 0x0001D0, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, CallFunc_Array_Get_Item_2) == 0x0001D4, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, CallFunc_Array_Length_ReturnValue_2) == 0x0001DC, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, CallFunc_GetShortName_Short_Name_1) == 0x0001E0, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::CallFunc_GetShortName_Short_Name_1' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, K2Node_MakeStruct_FormatArgumentData_1) == 0x0001F8, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, CallFunc_Array_AddUnique_ReturnValue_1) == 0x000238, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::CallFunc_Array_AddUnique_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, K2Node_MakeArray_Array) == 0x000240, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, Temp_int_Loop_Counter_Variable_2) == 0x000250, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, CallFunc_Format_ReturnValue) == 0x000258, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, K2Node_Select_Default) == 0x000270, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, CallFunc_Less_IntInt_ReturnValue_2) == 0x000288, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_ParseKeybind, CallFunc_Add_IntInt_ReturnValue_2) == 0x00028C, "Member 'W_Menu_Input_ToolTip_C_ParseKeybind::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");

// Function W_Menu_Input_ToolTip.W_Menu_Input_ToolTip_C.GetShortName
// 0x0040 (0x0040 - 0x0000)
struct W_Menu_Input_ToolTip_C_GetShortName final
{
public:
	class FName                                   InputPin;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Short_Name;                                        // 0x0008(0x0018)(Parm, OutParm)
	class FText                                   CallFunc_Conv_NameToText_ReturnValue;              // 0x0020(0x0018)()
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_2;        // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_Menu_Input_ToolTip_C_GetShortName) == 0x000008, "Wrong alignment on W_Menu_Input_ToolTip_C_GetShortName");
static_assert(sizeof(W_Menu_Input_ToolTip_C_GetShortName) == 0x000040, "Wrong size on W_Menu_Input_ToolTip_C_GetShortName");
static_assert(offsetof(W_Menu_Input_ToolTip_C_GetShortName, InputPin) == 0x000000, "Member 'W_Menu_Input_ToolTip_C_GetShortName::InputPin' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_GetShortName, Short_Name) == 0x000008, "Member 'W_Menu_Input_ToolTip_C_GetShortName::Short_Name' has a wrong offset!");
static_assert(offsetof(W_Menu_Input_ToolTip_C_GetShortName, CallFunc_Conv_NameToText_ReturnValue) == 0x000020, "Member 'W_Menu_Input_ToolTip_C_GetShortName::CallFunc_Conv_NameToText_ReturnValue' has a wrong offset!");
