#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_QuickPlayButton

#include "Basic.hpp"

#include "PlayFab_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_QuickPlayButton.W_QuickPlayButton_C.ExecuteUbergraph_W_QuickPlayButton
// 0x0308 (0x0308 - 0x0000)
struct W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FClientWriteEventResponse& Result, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayFabBaseModel                      Temp_struct_Variable;                              // 0x0028(0x0040)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FClientWriteClientPlayerEventRequest   K2Node_MakeStruct_ClientWriteClientPlayerEventRequest; // 0x0070(0x0038)()
	class UPlayFabClientAPI*                      CallFunc_WritePlayerEvent_ReturnValue;             // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FClientWriteEventResponse& Result, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x00BC(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FPlayFabError& Error, class UObject* CustomData)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00CC(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DF[0x1];                                       // 0x00DF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayFabBaseModel                      K2Node_CustomEvent_response_1;                     // 0x00E0(0x0040)()
	class UObject*                                K2Node_CustomEvent_customData_1;                   // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_successful_1;                   // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x012B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSearching_ReturnValue;                  // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13A[0x2];                                      // 0x013A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x013C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     K2Node_CustomEvent_Json;                           // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0158(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FClientWriteClientPlayerEventRequest   K2Node_MakeStruct_ClientWriteClientPlayerEventRequest_1; // 0x0170(0x0038)()
	class UPlayFabClientAPI*                      CallFunc_WritePlayerEvent_ReturnValue_1;           // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Cancel;                         // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B2[0x2];                                      // 0x01B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x01B4(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x01C4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x01D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UMainMenuScreen_C*                      CallFunc_GetMainMenuRef_MainMenuRef;               // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPlayFabBaseModel                      Temp_struct_Variable_1;                            // 0x01E8(0x0040)()
	class UObject*                                Temp_object_Variable_1;                            // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bSelected_1;            // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_MainMenuButton_C*                    K2Node_ComponentBoundEvent_Button_1;               // 0x0238(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bSelected;              // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_MainMenuButton_C*                    K2Node_ComponentBoundEvent_Button;                 // 0x0248(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bHovered;               // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0251(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_252[0x6];                                      // 0x0252(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPlayFabBaseModel                      K2Node_CustomEvent_response;                       // 0x0258(0x0040)()
	class UObject*                                K2Node_CustomEvent_customData;                     // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_successful;                     // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayFabJsonObject*                     CallFunc_PreferencesToJson_ReturnValue;            // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FPlayFabBaseModel& Response, class UObject* CustomData, bool Successful)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x02B0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsSearching_ReturnValue_1;                // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x02C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_ConstructJsonObject_ReturnValue;          // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayFabJsonObject*                     CallFunc_ConstructJsonObject_ReturnValue_1;        // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x02EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USQGameUserSettings*                    CallFunc_GetSquadGameUserSettings_ReturnValue;     // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue_2;                  // 0x0301(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton) == 0x000008, "Wrong alignment on W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton");
static_assert(sizeof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton) == 0x000308, "Wrong size on W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, EntryPoint) == 0x000000, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, Temp_struct_Variable) == 0x000028, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, CallFunc_IsValid_ReturnValue) == 0x000068, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, K2Node_MakeStruct_ClientWriteClientPlayerEventRequest) == 0x000070, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::K2Node_MakeStruct_ClientWriteClientPlayerEventRequest' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, CallFunc_WritePlayerEvent_ReturnValue) == 0x0000A8, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::CallFunc_WritePlayerEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, Temp_object_Variable) == 0x0000B0, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, CallFunc_IsValid_ReturnValue_1) == 0x0000B8, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000BC, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000CC, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, Temp_bool_Variable) == 0x0000DC, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, Temp_bool_IsClosed_Variable) == 0x0000DD, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, Temp_bool_Has_Been_Initd_Variable) == 0x0000DE, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, K2Node_CustomEvent_response_1) == 0x0000E0, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::K2Node_CustomEvent_response_1' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, K2Node_CustomEvent_customData_1) == 0x000120, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::K2Node_CustomEvent_customData_1' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, K2Node_CustomEvent_successful_1) == 0x000128, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::K2Node_CustomEvent_successful_1' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, K2Node_Event_IsDesignTime) == 0x000129, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, CallFunc_IsValid_ReturnValue_2) == 0x00012A, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, CallFunc_IsVisible_ReturnValue) == 0x00012B, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000130, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, CallFunc_IsSearching_ReturnValue) == 0x000138, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::CallFunc_IsSearching_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, CallFunc_IsValid_ReturnValue_3) == 0x000139, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, K2Node_CreateDelegate_OutputDelegate_4) == 0x00013C, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, K2Node_CustomEvent_Json) == 0x000150, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::K2Node_CustomEvent_Json' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, K2Node_CreateDelegate_OutputDelegate_5) == 0x000158, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, CallFunc_IsValid_ReturnValue_4) == 0x000168, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, K2Node_MakeStruct_ClientWriteClientPlayerEventRequest_1) == 0x000170, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::K2Node_MakeStruct_ClientWriteClientPlayerEventRequest_1' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, CallFunc_WritePlayerEvent_ReturnValue_1) == 0x0001A8, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::CallFunc_WritePlayerEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, K2Node_CustomEvent_Cancel) == 0x0001B0, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::K2Node_CustomEvent_Cancel' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, CallFunc_IsValid_ReturnValue_5) == 0x0001B1, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, K2Node_CreateDelegate_OutputDelegate_6) == 0x0001B4, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, K2Node_CreateDelegate_OutputDelegate_7) == 0x0001C4, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0001D8, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, CallFunc_GetMainMenuRef_MainMenuRef) == 0x0001E0, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::CallFunc_GetMainMenuRef_MainMenuRef' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, Temp_struct_Variable_1) == 0x0001E8, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, Temp_object_Variable_1) == 0x000228, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, K2Node_ComponentBoundEvent_bSelected_1) == 0x000230, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::K2Node_ComponentBoundEvent_bSelected_1' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, K2Node_ComponentBoundEvent_Button_1) == 0x000238, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, K2Node_ComponentBoundEvent_bSelected) == 0x000240, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::K2Node_ComponentBoundEvent_bSelected' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, K2Node_ComponentBoundEvent_Button) == 0x000248, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, K2Node_ComponentBoundEvent_bHovered) == 0x000250, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::K2Node_ComponentBoundEvent_bHovered' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, Temp_bool_Variable_1) == 0x000251, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, K2Node_CustomEvent_response) == 0x000258, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::K2Node_CustomEvent_response' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, K2Node_CustomEvent_customData) == 0x000298, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::K2Node_CustomEvent_customData' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, K2Node_CustomEvent_successful) == 0x0002A0, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::K2Node_CustomEvent_successful' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, CallFunc_PreferencesToJson_ReturnValue) == 0x0002A8, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::CallFunc_PreferencesToJson_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, K2Node_CreateDelegate_OutputDelegate_8) == 0x0002B0, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, CallFunc_IsSearching_ReturnValue_1) == 0x0002C0, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::CallFunc_IsSearching_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, CallFunc_SelectString_ReturnValue) == 0x0002C8, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, CallFunc_ConstructJsonObject_ReturnValue) == 0x0002D8, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::CallFunc_ConstructJsonObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, CallFunc_ConstructJsonObject_ReturnValue_1) == 0x0002E0, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::CallFunc_ConstructJsonObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0002E8, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x0002EC, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, CallFunc_GetGameUserSettings_ReturnValue) == 0x0002F0, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, CallFunc_GetSquadGameUserSettings_ReturnValue) == 0x0002F8, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::CallFunc_GetSquadGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, CallFunc_IsVisible_ReturnValue_1) == 0x000300, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::CallFunc_IsVisible_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton, CallFunc_IsVisible_ReturnValue_2) == 0x000301, "Member 'W_QuickPlayButton_C_ExecuteUbergraph_W_QuickPlayButton::CallFunc_IsVisible_ReturnValue_2' has a wrong offset!");

// Function W_QuickPlayButton.W_QuickPlayButton_C.BndEvt__W_QuickPlayButton_ButtonPropertiesN_K2Node_ComponentBoundEvent_6_OnHover__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct W_QuickPlayButton_C_BndEvt__W_QuickPlayButton_ButtonPropertiesN_K2Node_ComponentBoundEvent_6_OnHover__DelegateSignature final
{
public:
	bool                                          bHovered;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_QuickPlayButton_C_BndEvt__W_QuickPlayButton_ButtonPropertiesN_K2Node_ComponentBoundEvent_6_OnHover__DelegateSignature) == 0x000001, "Wrong alignment on W_QuickPlayButton_C_BndEvt__W_QuickPlayButton_ButtonPropertiesN_K2Node_ComponentBoundEvent_6_OnHover__DelegateSignature");
static_assert(sizeof(W_QuickPlayButton_C_BndEvt__W_QuickPlayButton_ButtonPropertiesN_K2Node_ComponentBoundEvent_6_OnHover__DelegateSignature) == 0x000001, "Wrong size on W_QuickPlayButton_C_BndEvt__W_QuickPlayButton_ButtonPropertiesN_K2Node_ComponentBoundEvent_6_OnHover__DelegateSignature");
static_assert(offsetof(W_QuickPlayButton_C_BndEvt__W_QuickPlayButton_ButtonPropertiesN_K2Node_ComponentBoundEvent_6_OnHover__DelegateSignature, bHovered) == 0x000000, "Member 'W_QuickPlayButton_C_BndEvt__W_QuickPlayButton_ButtonPropertiesN_K2Node_ComponentBoundEvent_6_OnHover__DelegateSignature::bHovered' has a wrong offset!");

// Function W_QuickPlayButton.W_QuickPlayButton_C.BndEvt__W_QuickPlayButton_ButtonPropertiesN_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_QuickPlayButton_C_BndEvt__W_QuickPlayButton_ButtonPropertiesN_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature final
{
public:
	bool                                          bSelected;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_MainMenuButton_C*                    Button;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_QuickPlayButton_C_BndEvt__W_QuickPlayButton_ButtonPropertiesN_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on W_QuickPlayButton_C_BndEvt__W_QuickPlayButton_ButtonPropertiesN_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature");
static_assert(sizeof(W_QuickPlayButton_C_BndEvt__W_QuickPlayButton_ButtonPropertiesN_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature) == 0x000010, "Wrong size on W_QuickPlayButton_C_BndEvt__W_QuickPlayButton_ButtonPropertiesN_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature");
static_assert(offsetof(W_QuickPlayButton_C_BndEvt__W_QuickPlayButton_ButtonPropertiesN_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature, bSelected) == 0x000000, "Member 'W_QuickPlayButton_C_BndEvt__W_QuickPlayButton_ButtonPropertiesN_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature::bSelected' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_BndEvt__W_QuickPlayButton_ButtonPropertiesN_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature, Button) == 0x000008, "Member 'W_QuickPlayButton_C_BndEvt__W_QuickPlayButton_ButtonPropertiesN_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature::Button' has a wrong offset!");

// Function W_QuickPlayButton.W_QuickPlayButton_C.BndEvt__W_QuickPlayButton_NewButtonPlay2_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_QuickPlayButton_C_BndEvt__W_QuickPlayButton_NewButtonPlay2_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature final
{
public:
	bool                                          bSelected;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UW_MainMenuButton_C*                    Button;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_QuickPlayButton_C_BndEvt__W_QuickPlayButton_NewButtonPlay2_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on W_QuickPlayButton_C_BndEvt__W_QuickPlayButton_NewButtonPlay2_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature");
static_assert(sizeof(W_QuickPlayButton_C_BndEvt__W_QuickPlayButton_NewButtonPlay2_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature) == 0x000010, "Wrong size on W_QuickPlayButton_C_BndEvt__W_QuickPlayButton_NewButtonPlay2_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature");
static_assert(offsetof(W_QuickPlayButton_C_BndEvt__W_QuickPlayButton_NewButtonPlay2_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature, bSelected) == 0x000000, "Member 'W_QuickPlayButton_C_BndEvt__W_QuickPlayButton_NewButtonPlay2_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature::bSelected' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_BndEvt__W_QuickPlayButton_NewButtonPlay2_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature, Button) == 0x000008, "Member 'W_QuickPlayButton_C_BndEvt__W_QuickPlayButton_NewButtonPlay2_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature::Button' has a wrong offset!");

// Function W_QuickPlayButton.W_QuickPlayButton_C.CloseQuickPlay
// 0x0001 (0x0001 - 0x0000)
struct W_QuickPlayButton_C_CloseQuickPlay final
{
public:
	bool                                          Cancel;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_QuickPlayButton_C_CloseQuickPlay) == 0x000001, "Wrong alignment on W_QuickPlayButton_C_CloseQuickPlay");
static_assert(sizeof(W_QuickPlayButton_C_CloseQuickPlay) == 0x000001, "Wrong size on W_QuickPlayButton_C_CloseQuickPlay");
static_assert(offsetof(W_QuickPlayButton_C_CloseQuickPlay, Cancel) == 0x000000, "Member 'W_QuickPlayButton_C_CloseQuickPlay::Cancel' has a wrong offset!");

// Function W_QuickPlayButton.W_QuickPlayButton_C.SendInfoAboutFilterChange
// 0x0008 (0x0008 - 0x0000)
struct W_QuickPlayButton_C_SendInfoAboutFilterChange final
{
public:
	class UPlayFabJsonObject*                     Json;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_QuickPlayButton_C_SendInfoAboutFilterChange) == 0x000008, "Wrong alignment on W_QuickPlayButton_C_SendInfoAboutFilterChange");
static_assert(sizeof(W_QuickPlayButton_C_SendInfoAboutFilterChange) == 0x000008, "Wrong size on W_QuickPlayButton_C_SendInfoAboutFilterChange");
static_assert(offsetof(W_QuickPlayButton_C_SendInfoAboutFilterChange, Json) == 0x000000, "Member 'W_QuickPlayButton_C_SendInfoAboutFilterChange::Json' has a wrong offset!");

// Function W_QuickPlayButton.W_QuickPlayButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct W_QuickPlayButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_QuickPlayButton_C_PreConstruct) == 0x000001, "Wrong alignment on W_QuickPlayButton_C_PreConstruct");
static_assert(sizeof(W_QuickPlayButton_C_PreConstruct) == 0x000001, "Wrong size on W_QuickPlayButton_C_PreConstruct");
static_assert(offsetof(W_QuickPlayButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'W_QuickPlayButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function W_QuickPlayButton.W_QuickPlayButton_C.OnPlayFabResponse_6CCBFB4641B44B28E5A4D4B3B7395739
// 0x0050 (0x0050 - 0x0000)
struct W_QuickPlayButton_C_OnPlayFabResponse_6CCBFB4641B44B28E5A4D4B3B7395739 final
{
public:
	struct FPlayFabBaseModel                      Response;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                CustomData;                                        // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Successful;                                        // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_QuickPlayButton_C_OnPlayFabResponse_6CCBFB4641B44B28E5A4D4B3B7395739) == 0x000008, "Wrong alignment on W_QuickPlayButton_C_OnPlayFabResponse_6CCBFB4641B44B28E5A4D4B3B7395739");
static_assert(sizeof(W_QuickPlayButton_C_OnPlayFabResponse_6CCBFB4641B44B28E5A4D4B3B7395739) == 0x000050, "Wrong size on W_QuickPlayButton_C_OnPlayFabResponse_6CCBFB4641B44B28E5A4D4B3B7395739");
static_assert(offsetof(W_QuickPlayButton_C_OnPlayFabResponse_6CCBFB4641B44B28E5A4D4B3B7395739, Response) == 0x000000, "Member 'W_QuickPlayButton_C_OnPlayFabResponse_6CCBFB4641B44B28E5A4D4B3B7395739::Response' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_OnPlayFabResponse_6CCBFB4641B44B28E5A4D4B3B7395739, CustomData) == 0x000040, "Member 'W_QuickPlayButton_C_OnPlayFabResponse_6CCBFB4641B44B28E5A4D4B3B7395739::CustomData' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_OnPlayFabResponse_6CCBFB4641B44B28E5A4D4B3B7395739, Successful) == 0x000048, "Member 'W_QuickPlayButton_C_OnPlayFabResponse_6CCBFB4641B44B28E5A4D4B3B7395739::Successful' has a wrong offset!");

// Function W_QuickPlayButton.W_QuickPlayButton_C.OnPlayFabResponse_6CCBFB4641B44B28E5A4D4B34E47D73B
// 0x0050 (0x0050 - 0x0000)
struct W_QuickPlayButton_C_OnPlayFabResponse_6CCBFB4641B44B28E5A4D4B34E47D73B final
{
public:
	struct FPlayFabBaseModel                      Response;                                          // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                CustomData;                                        // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Successful;                                        // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_QuickPlayButton_C_OnPlayFabResponse_6CCBFB4641B44B28E5A4D4B34E47D73B) == 0x000008, "Wrong alignment on W_QuickPlayButton_C_OnPlayFabResponse_6CCBFB4641B44B28E5A4D4B34E47D73B");
static_assert(sizeof(W_QuickPlayButton_C_OnPlayFabResponse_6CCBFB4641B44B28E5A4D4B34E47D73B) == 0x000050, "Wrong size on W_QuickPlayButton_C_OnPlayFabResponse_6CCBFB4641B44B28E5A4D4B34E47D73B");
static_assert(offsetof(W_QuickPlayButton_C_OnPlayFabResponse_6CCBFB4641B44B28E5A4D4B34E47D73B, Response) == 0x000000, "Member 'W_QuickPlayButton_C_OnPlayFabResponse_6CCBFB4641B44B28E5A4D4B34E47D73B::Response' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_OnPlayFabResponse_6CCBFB4641B44B28E5A4D4B34E47D73B, CustomData) == 0x000040, "Member 'W_QuickPlayButton_C_OnPlayFabResponse_6CCBFB4641B44B28E5A4D4B34E47D73B::CustomData' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_OnPlayFabResponse_6CCBFB4641B44B28E5A4D4B34E47D73B, Successful) == 0x000048, "Member 'W_QuickPlayButton_C_OnPlayFabResponse_6CCBFB4641B44B28E5A4D4B34E47D73B::Successful' has a wrong offset!");

// Function W_QuickPlayButton.W_QuickPlayButton_C.UpdateSelectedFilters
// 0x0010 (0x0010 - 0x0000)
struct W_QuickPlayButton_C_UpdateSelectedFilters final
{
public:
	class UPlayFabJsonObject*                     CallFunc_PreferencesToJson_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSearching_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdateSelectedFilters_ChangeDetected;     // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_QuickPlayButton_C_UpdateSelectedFilters) == 0x000008, "Wrong alignment on W_QuickPlayButton_C_UpdateSelectedFilters");
static_assert(sizeof(W_QuickPlayButton_C_UpdateSelectedFilters) == 0x000010, "Wrong size on W_QuickPlayButton_C_UpdateSelectedFilters");
static_assert(offsetof(W_QuickPlayButton_C_UpdateSelectedFilters, CallFunc_PreferencesToJson_ReturnValue) == 0x000000, "Member 'W_QuickPlayButton_C_UpdateSelectedFilters::CallFunc_PreferencesToJson_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_UpdateSelectedFilters, CallFunc_IsSearching_ReturnValue) == 0x000008, "Member 'W_QuickPlayButton_C_UpdateSelectedFilters::CallFunc_IsSearching_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_UpdateSelectedFilters, CallFunc_UpdateSelectedFilters_ChangeDetected) == 0x000009, "Member 'W_QuickPlayButton_C_UpdateSelectedFilters::CallFunc_UpdateSelectedFilters_ChangeDetected' has a wrong offset!");

// Function W_QuickPlayButton.W_QuickPlayButton_C.OnNewResultAppear
// 0x0020 (0x0020 - 0x0000)
struct W_QuickPlayButton_C_OnNewResultAppear final
{
public:
	bool                                          bResult;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USQGameUserSettings*                    CallFunc_GetSquadGameUserSettings_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_QuickPlayButton_C_OnNewResultAppear) == 0x000008, "Wrong alignment on W_QuickPlayButton_C_OnNewResultAppear");
static_assert(sizeof(W_QuickPlayButton_C_OnNewResultAppear) == 0x000020, "Wrong size on W_QuickPlayButton_C_OnNewResultAppear");
static_assert(offsetof(W_QuickPlayButton_C_OnNewResultAppear, bResult) == 0x000000, "Member 'W_QuickPlayButton_C_OnNewResultAppear::bResult' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_OnNewResultAppear, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'W_QuickPlayButton_C_OnNewResultAppear::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_OnNewResultAppear, CallFunc_GetSquadGameUserSettings_ReturnValue) == 0x000008, "Member 'W_QuickPlayButton_C_OnNewResultAppear::CallFunc_GetSquadGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_OnNewResultAppear, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000010, "Member 'W_QuickPlayButton_C_OnNewResultAppear::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_OnNewResultAppear, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'W_QuickPlayButton_C_OnNewResultAppear::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_OnNewResultAppear, CallFunc_Greater_IntInt_ReturnValue) == 0x000018, "Member 'W_QuickPlayButton_C_OnNewResultAppear::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function W_QuickPlayButton.W_QuickPlayButton_C.OnAnaliticsSent
// 0x0020 (0x0020 - 0x0000)
struct W_QuickPlayButton_C_OnAnaliticsSent final
{
public:
	struct FClientWriteEventResponse              Result;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                CustomData;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_QuickPlayButton_C_OnAnaliticsSent) == 0x000008, "Wrong alignment on W_QuickPlayButton_C_OnAnaliticsSent");
static_assert(sizeof(W_QuickPlayButton_C_OnAnaliticsSent) == 0x000020, "Wrong size on W_QuickPlayButton_C_OnAnaliticsSent");
static_assert(offsetof(W_QuickPlayButton_C_OnAnaliticsSent, Result) == 0x000000, "Member 'W_QuickPlayButton_C_OnAnaliticsSent::Result' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_OnAnaliticsSent, CustomData) == 0x000018, "Member 'W_QuickPlayButton_C_OnAnaliticsSent::CustomData' has a wrong offset!");

// Function W_QuickPlayButton.W_QuickPlayButton_C.OnAnaliticsSent2
// 0x0040 (0x0040 - 0x0000)
struct W_QuickPlayButton_C_OnAnaliticsSent2 final
{
public:
	struct FPlayFabError                          Error;                                             // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                CustomData;                                        // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_QuickPlayButton_C_OnAnaliticsSent2) == 0x000008, "Wrong alignment on W_QuickPlayButton_C_OnAnaliticsSent2");
static_assert(sizeof(W_QuickPlayButton_C_OnAnaliticsSent2) == 0x000040, "Wrong size on W_QuickPlayButton_C_OnAnaliticsSent2");
static_assert(offsetof(W_QuickPlayButton_C_OnAnaliticsSent2, Error) == 0x000000, "Member 'W_QuickPlayButton_C_OnAnaliticsSent2::Error' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_OnAnaliticsSent2, CustomData) == 0x000038, "Member 'W_QuickPlayButton_C_OnAnaliticsSent2::CustomData' has a wrong offset!");

// Function W_QuickPlayButton.W_QuickPlayButton_C.CreateQuickSearchObject
// 0x0028 (0x0028 - 0x0000)
struct W_QuickPlayButton_C_CreateQuickSearchObject final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bResult)>                 K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UBP_QuickPlaySearch_C*                  CallFunc_SpawnObject_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_QuickPlayButton_C_CreateQuickSearchObject) == 0x000008, "Wrong alignment on W_QuickPlayButton_C_CreateQuickSearchObject");
static_assert(sizeof(W_QuickPlayButton_C_CreateQuickSearchObject) == 0x000028, "Wrong size on W_QuickPlayButton_C_CreateQuickSearchObject");
static_assert(offsetof(W_QuickPlayButton_C_CreateQuickSearchObject, CallFunc_GetPlayerController_ReturnValue) == 0x000000, "Member 'W_QuickPlayButton_C_CreateQuickSearchObject::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_CreateQuickSearchObject, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'W_QuickPlayButton_C_CreateQuickSearchObject::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_CreateQuickSearchObject, CallFunc_SpawnObject_ReturnValue) == 0x000018, "Member 'W_QuickPlayButton_C_CreateQuickSearchObject::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_CreateQuickSearchObject, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'W_QuickPlayButton_C_CreateQuickSearchObject::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function W_QuickPlayButton.W_QuickPlayButton_C.EnableShowResults
// 0x0018 (0x0018 - 0x0000)
struct W_QuickPlayButton_C_EnableShowResults final
{
public:
	class USQGameUserSettings*                    CallFunc_GetSquadGameUserSettings_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSearching_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_QuickPlayButton_C_EnableShowResults) == 0x000008, "Wrong alignment on W_QuickPlayButton_C_EnableShowResults");
static_assert(sizeof(W_QuickPlayButton_C_EnableShowResults) == 0x000018, "Wrong size on W_QuickPlayButton_C_EnableShowResults");
static_assert(offsetof(W_QuickPlayButton_C_EnableShowResults, CallFunc_GetSquadGameUserSettings_ReturnValue) == 0x000000, "Member 'W_QuickPlayButton_C_EnableShowResults::CallFunc_GetSquadGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_EnableShowResults, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'W_QuickPlayButton_C_EnableShowResults::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_EnableShowResults, CallFunc_IsSearching_ReturnValue) == 0x000009, "Member 'W_QuickPlayButton_C_EnableShowResults::CallFunc_IsSearching_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_EnableShowResults, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'W_QuickPlayButton_C_EnableShowResults::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_EnableShowResults, CallFunc_Greater_IntInt_ReturnValue) == 0x000010, "Member 'W_QuickPlayButton_C_EnableShowResults::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function W_QuickPlayButton.W_QuickPlayButton_C.SortForFavorites
// 0x0008 (0x0008 - 0x0000)
struct W_QuickPlayButton_C_SortForFavorites final
{
public:
	class USQGameUserSettings*                    CallFunc_GetSquadGameUserSettings_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_QuickPlayButton_C_SortForFavorites) == 0x000008, "Wrong alignment on W_QuickPlayButton_C_SortForFavorites");
static_assert(sizeof(W_QuickPlayButton_C_SortForFavorites) == 0x000008, "Wrong size on W_QuickPlayButton_C_SortForFavorites");
static_assert(offsetof(W_QuickPlayButton_C_SortForFavorites, CallFunc_GetSquadGameUserSettings_ReturnValue) == 0x000000, "Member 'W_QuickPlayButton_C_SortForFavorites::CallFunc_GetSquadGameUserSettings_ReturnValue' has a wrong offset!");

// Function W_QuickPlayButton.W_QuickPlayButton_C.GetMainMenuRef
// 0x0028 (0x0028 - 0x0000)
struct W_QuickPlayButton_C_GetMainMenuRef final
{
public:
	class UMainMenuScreen_C*                      MainMenuRef_0;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMainMenuScreen_C*>              CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UMainMenuScreen_C*                      CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_QuickPlayButton_C_GetMainMenuRef) == 0x000008, "Wrong alignment on W_QuickPlayButton_C_GetMainMenuRef");
static_assert(sizeof(W_QuickPlayButton_C_GetMainMenuRef) == 0x000028, "Wrong size on W_QuickPlayButton_C_GetMainMenuRef");
static_assert(offsetof(W_QuickPlayButton_C_GetMainMenuRef, MainMenuRef_0) == 0x000000, "Member 'W_QuickPlayButton_C_GetMainMenuRef::MainMenuRef_0' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_GetMainMenuRef, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'W_QuickPlayButton_C_GetMainMenuRef::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_GetMainMenuRef, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000010, "Member 'W_QuickPlayButton_C_GetMainMenuRef::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(W_QuickPlayButton_C_GetMainMenuRef, CallFunc_Array_Get_Item) == 0x000020, "Member 'W_QuickPlayButton_C_GetMainMenuRef::CallFunc_Array_Get_Item' has a wrong offset!");

// Function W_QuickPlayButton.W_QuickPlayButton_C.SetMainMenuRef
// 0x0008 (0x0008 - 0x0000)
struct W_QuickPlayButton_C_SetMainMenuRef final
{
public:
	class UMainMenuScreen_C*                      MainMenuRef_0;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_QuickPlayButton_C_SetMainMenuRef) == 0x000008, "Wrong alignment on W_QuickPlayButton_C_SetMainMenuRef");
static_assert(sizeof(W_QuickPlayButton_C_SetMainMenuRef) == 0x000008, "Wrong size on W_QuickPlayButton_C_SetMainMenuRef");
static_assert(offsetof(W_QuickPlayButton_C_SetMainMenuRef, MainMenuRef_0) == 0x000000, "Member 'W_QuickPlayButton_C_SetMainMenuRef::MainMenuRef_0' has a wrong offset!");

}

