#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_QuickPlayPreferences

#include "Basic.hpp"

#include "Squad_structs.hpp"


namespace SDK::Params
{

// Function W_QuickPlayPreferences.W_QuickPlayPreferences_C.ExecuteUbergraph_W_QuickPlayPreferences
// 0x00D8 (0x00D8 - 0x0000)
struct W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USQGameUserSettings*                    CallFunc_GetSquadGameUserSettings_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bSelected;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMainMenu_Button_C*                     K2Node_ComponentBoundEvent_Button;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_ComponentBoundEvent_Option_6;               // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Index_6;                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_Option_5;               // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Index_5;                // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_Option_4;               // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Index_4;                // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_Option_3;               // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Index_3;                // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_Option_2;               // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Index_2;                // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_Option_1;               // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Index_1;                // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_ComponentBoundEvent_Option;                 // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Index;                  // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences) == 0x000008, "Wrong alignment on W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences");
static_assert(sizeof(W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences) == 0x0000D8, "Wrong size on W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences");
static_assert(offsetof(W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences, EntryPoint) == 0x000000, "Member 'W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences, CallFunc_GetSquadGameUserSettings_ReturnValue) == 0x000008, "Member 'W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences::CallFunc_GetSquadGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences, K2Node_ComponentBoundEvent_bSelected) == 0x000010, "Member 'W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences::K2Node_ComponentBoundEvent_bSelected' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences, K2Node_ComponentBoundEvent_Button) == 0x000018, "Member 'W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences, K2Node_ComponentBoundEvent_Value) == 0x000020, "Member 'W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences, CallFunc_FTrunc_ReturnValue) == 0x000024, "Member 'W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences, K2Node_ComponentBoundEvent_Option_6) == 0x000028, "Member 'W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences::K2Node_ComponentBoundEvent_Option_6' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences, K2Node_ComponentBoundEvent_Index_6) == 0x000038, "Member 'W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences::K2Node_ComponentBoundEvent_Index_6' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences, K2Node_ComponentBoundEvent_Option_5) == 0x000040, "Member 'W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences::K2Node_ComponentBoundEvent_Option_5' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences, K2Node_ComponentBoundEvent_Index_5) == 0x000050, "Member 'W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences::K2Node_ComponentBoundEvent_Index_5' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences, K2Node_ComponentBoundEvent_Option_4) == 0x000058, "Member 'W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences::K2Node_ComponentBoundEvent_Option_4' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences, K2Node_ComponentBoundEvent_Index_4) == 0x000068, "Member 'W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences::K2Node_ComponentBoundEvent_Index_4' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences, K2Node_ComponentBoundEvent_Option_3) == 0x000070, "Member 'W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences::K2Node_ComponentBoundEvent_Option_3' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences, K2Node_ComponentBoundEvent_Index_3) == 0x000080, "Member 'W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences::K2Node_ComponentBoundEvent_Index_3' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences, K2Node_ComponentBoundEvent_Option_2) == 0x000088, "Member 'W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences::K2Node_ComponentBoundEvent_Option_2' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences, K2Node_ComponentBoundEvent_Index_2) == 0x000098, "Member 'W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences::K2Node_ComponentBoundEvent_Index_2' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences, K2Node_ComponentBoundEvent_Option_1) == 0x0000A0, "Member 'W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences::K2Node_ComponentBoundEvent_Option_1' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences, K2Node_ComponentBoundEvent_Index_1) == 0x0000B0, "Member 'W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences::K2Node_ComponentBoundEvent_Index_1' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences, K2Node_ComponentBoundEvent_Option) == 0x0000B8, "Member 'W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences::K2Node_ComponentBoundEvent_Option' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences, K2Node_ComponentBoundEvent_Index) == 0x0000C8, "Member 'W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences::K2Node_ComponentBoundEvent_Index' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences, CallFunc_FTrunc_ReturnValue_1) == 0x0000CC, "Member 'W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000D0, "Member 'W_QuickPlayPreferences_C_ExecuteUbergraph_W_QuickPlayPreferences::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function W_QuickPlayPreferences.W_QuickPlayPreferences_C.BndEvt__W_QuickPlayPreferences_Settings_MapRot_K2Node_ComponentBoundEvent_8_OnValueChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_MapRot_K2Node_ComponentBoundEvent_8_OnValueChanged__DelegateSignature final
{
public:
	class FString                                 Option;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_MapRot_K2Node_ComponentBoundEvent_8_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_MapRot_K2Node_ComponentBoundEvent_8_OnValueChanged__DelegateSignature");
static_assert(sizeof(W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_MapRot_K2Node_ComponentBoundEvent_8_OnValueChanged__DelegateSignature) == 0x000018, "Wrong size on W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_MapRot_K2Node_ComponentBoundEvent_8_OnValueChanged__DelegateSignature");
static_assert(offsetof(W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_MapRot_K2Node_ComponentBoundEvent_8_OnValueChanged__DelegateSignature, Option) == 0x000000, "Member 'W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_MapRot_K2Node_ComponentBoundEvent_8_OnValueChanged__DelegateSignature::Option' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_MapRot_K2Node_ComponentBoundEvent_8_OnValueChanged__DelegateSignature, Index_0) == 0x000010, "Member 'W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_MapRot_K2Node_ComponentBoundEvent_8_OnValueChanged__DelegateSignature::Index_0' has a wrong offset!");

// Function W_QuickPlayPreferences.W_QuickPlayPreferences_C.BndEvt__W_QuickPlayPreferences_Settings_Experience_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_Experience_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature final
{
public:
	class FString                                 Option;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_Experience_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_Experience_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature");
static_assert(sizeof(W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_Experience_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature) == 0x000018, "Wrong size on W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_Experience_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature");
static_assert(offsetof(W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_Experience_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature, Option) == 0x000000, "Member 'W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_Experience_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature::Option' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_Experience_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature, Index_0) == 0x000010, "Member 'W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_Experience_K2Node_ComponentBoundEvent_7_OnValueChanged__DelegateSignature::Index_0' has a wrong offset!");

// Function W_QuickPlayPreferences.W_QuickPlayPreferences_C.BndEvt__W_QuickPlayPreferences_Settings_Playstyle_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_Playstyle_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature final
{
public:
	class FString                                 Option;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_Playstyle_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_Playstyle_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature");
static_assert(sizeof(W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_Playstyle_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature) == 0x000018, "Wrong size on W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_Playstyle_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature");
static_assert(offsetof(W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_Playstyle_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature, Option) == 0x000000, "Member 'W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_Playstyle_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature::Option' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_Playstyle_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature, Index_0) == 0x000010, "Member 'W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_Playstyle_K2Node_ComponentBoundEvent_6_OnValueChanged__DelegateSignature::Index_0' has a wrong offset!");

// Function W_QuickPlayPreferences.W_QuickPlayPreferences_C.BndEvt__W_QuickPlayPreferences_Settings_QPType_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_QPType_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature final
{
public:
	class FString                                 Option;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_QPType_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_QPType_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature");
static_assert(sizeof(W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_QPType_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature) == 0x000018, "Wrong size on W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_QPType_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature");
static_assert(offsetof(W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_QPType_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature, Option) == 0x000000, "Member 'W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_QPType_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature::Option' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_QPType_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature, Index_0) == 0x000010, "Member 'W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_QPType_K2Node_ComponentBoundEvent_5_OnValueChanged__DelegateSignature::Index_0' has a wrong offset!");

// Function W_QuickPlayPreferences.W_QuickPlayPreferences_C.BndEvt__W_QuickPlayPreferences_Settings_ElapsedTime_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_ElapsedTime_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature final
{
public:
	class FString                                 Option;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_ElapsedTime_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_ElapsedTime_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature");
static_assert(sizeof(W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_ElapsedTime_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature) == 0x000018, "Wrong size on W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_ElapsedTime_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature");
static_assert(offsetof(W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_ElapsedTime_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature, Option) == 0x000000, "Member 'W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_ElapsedTime_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature::Option' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_ElapsedTime_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature, Index_0) == 0x000010, "Member 'W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_ElapsedTime_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature::Index_0' has a wrong offset!");

// Function W_QuickPlayPreferences.W_QuickPlayPreferences_C.BndEvt__W_QuickPlayPreferences_Settings_MinPlayers_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_MinPlayers_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature final
{
public:
	class FString                                 Option;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_MinPlayers_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_MinPlayers_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature");
static_assert(sizeof(W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_MinPlayers_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature) == 0x000018, "Wrong size on W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_MinPlayers_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature");
static_assert(offsetof(W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_MinPlayers_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature, Option) == 0x000000, "Member 'W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_MinPlayers_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature::Option' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_MinPlayers_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature, Index_0) == 0x000010, "Member 'W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_Settings_MinPlayers_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature::Index_0' has a wrong offset!");

// Function W_QuickPlayPreferences.W_QuickPlayPreferences_C.BndEvt__W_QuickPlayPreferences_SettingsComboboxItem_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_SettingsComboboxItem_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature final
{
public:
	class FString                                 Option;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_SettingsComboboxItem_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_SettingsComboboxItem_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature");
static_assert(sizeof(W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_SettingsComboboxItem_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature) == 0x000018, "Wrong size on W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_SettingsComboboxItem_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature");
static_assert(offsetof(W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_SettingsComboboxItem_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature, Option) == 0x000000, "Member 'W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_SettingsComboboxItem_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature::Option' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_SettingsComboboxItem_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature, Index_0) == 0x000010, "Member 'W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_SettingsComboboxItem_K2Node_ComponentBoundEvent_2_OnValueChanged__DelegateSignature::Index_0' has a wrong offset!");

// Function W_QuickPlayPreferences.W_QuickPlayPreferences_C.BndEvt__W_QuickPlayPreferences_PingSlider_K2Node_ComponentBoundEvent_0_OnCaptureEnd__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_PingSlider_K2Node_ComponentBoundEvent_0_OnCaptureEnd__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_PingSlider_K2Node_ComponentBoundEvent_0_OnCaptureEnd__DelegateSignature) == 0x000004, "Wrong alignment on W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_PingSlider_K2Node_ComponentBoundEvent_0_OnCaptureEnd__DelegateSignature");
static_assert(sizeof(W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_PingSlider_K2Node_ComponentBoundEvent_0_OnCaptureEnd__DelegateSignature) == 0x000004, "Wrong size on W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_PingSlider_K2Node_ComponentBoundEvent_0_OnCaptureEnd__DelegateSignature");
static_assert(offsetof(W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_PingSlider_K2Node_ComponentBoundEvent_0_OnCaptureEnd__DelegateSignature, Value) == 0x000000, "Member 'W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_PingSlider_K2Node_ComponentBoundEvent_0_OnCaptureEnd__DelegateSignature::Value' has a wrong offset!");

// Function W_QuickPlayPreferences.W_QuickPlayPreferences_C.BndEvt__W_QuickPlayPreferences_ButtonResetFilters_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_ButtonResetFilters_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature final
{
public:
	bool                                          bSelected;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMainMenu_Button_C*                     Button;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_ButtonResetFilters_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_ButtonResetFilters_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature");
static_assert(sizeof(W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_ButtonResetFilters_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature) == 0x000010, "Wrong size on W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_ButtonResetFilters_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature");
static_assert(offsetof(W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_ButtonResetFilters_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature, bSelected) == 0x000000, "Member 'W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_ButtonResetFilters_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature::bSelected' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_ButtonResetFilters_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature, Button) == 0x000008, "Member 'W_QuickPlayPreferences_C_BndEvt__W_QuickPlayPreferences_ButtonResetFilters_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature::Button' has a wrong offset!");

// Function W_QuickPlayPreferences.W_QuickPlayPreferences_C.FavouriteTooltip
// 0x0028 (0x0028 - 0x0000)
struct W_QuickPlayPreferences_C_FavouriteTooltip final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)(ConstParm)
	class UUMG_Tooltip_C*                         CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_QuickPlayPreferences_C_FavouriteTooltip) == 0x000008, "Wrong alignment on W_QuickPlayPreferences_C_FavouriteTooltip");
static_assert(sizeof(W_QuickPlayPreferences_C_FavouriteTooltip) == 0x000028, "Wrong size on W_QuickPlayPreferences_C_FavouriteTooltip");
static_assert(offsetof(W_QuickPlayPreferences_C_FavouriteTooltip, ReturnValue) == 0x000000, "Member 'W_QuickPlayPreferences_C_FavouriteTooltip::ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FavouriteTooltip, Temp_text_Variable) == 0x000008, "Member 'W_QuickPlayPreferences_C_FavouriteTooltip::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FavouriteTooltip, CallFunc_Create_ReturnValue) == 0x000020, "Member 'W_QuickPlayPreferences_C_FavouriteTooltip::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function W_QuickPlayPreferences.W_QuickPlayPreferences_C.FillTagFilters
// 0x0300 (0x0300 - 0x0000)
struct W_QuickPlayPreferences_C_FillTagFilters final
{
public:
	TArray<class FString>                         MapRotationOptions;                                // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         ExperienceOptions;                                 // 0x0010(0x0010)(Edit, BlueprintVisible)
	TMap<class FString, class FName>              DummyMap;                                          // 0x0020(0x0050)(Edit, BlueprintVisible)
	TArray<class FString>                         PlaystyleOptions;                                  // 0x0070(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         LanguageTags;                                      // 0x0080(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bSelected, class USettingsItem_TickBox_C* Button)> K2Node_CreateDelegate_OutputDelegate;              // 0x009C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item;                           // 0x00D8(0x0018)()
	class FText                                   CallFunc_Array_Get_Item_1;                         // 0x00F0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_3;          // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x0128(0x0010)(ReferenceParm)
	class USettingsItem_TickBox_C*                CallFunc_Create_ReturnValue;                       // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Temp_string_Variable;                              // 0x0140(0x0010)(ConstParm, ReferenceParm)
	TArray<class FString>                         Temp_string_Variable_1;                            // 0x0150(0x0010)(ConstParm, ReferenceParm)
	TArray<class FString>                         Temp_string_Variable_2;                            // 0x0160(0x0010)(ConstParm, ReferenceParm)
	TArray<class FString>                         Temp_string_Variable_3;                            // 0x0170(0x0010)(ConstParm, ReferenceParm)
	ESQTagType                                    Temp_byte_Variable;                                // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_4;          // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<class FName>                           Temp_name_Variable;                                // 0x01A0(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           Temp_name_Variable_1;                              // 0x01C0(0x0010)(ConstParm, ReferenceParm)
	TArray<class FName>                           Temp_name_Variable_2;                              // 0x01D0(0x0010)(ConstParm, ReferenceParm)
	TArray<class FName>                           Temp_name_Variable_3;                              // 0x01E0(0x0010)(ConstParm, ReferenceParm)
	TArray<class FName>                           Temp_name_Variable_4;                              // 0x01F0(0x0010)(ConstParm, ReferenceParm)
	ESQTagType                                    Temp_byte_Variable_1;                              // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0208(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_2;                         // 0x021C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0224(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_225[0x3];                                      // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSQServerTag                           CallFunc_GetDataTableRowFromName_OutRow;           // 0x0228(0x0058)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_5;          // 0x0288(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_Select_Default;                             // 0x02A0(0x0010)(ConstParm, ReferenceParm)
	TArray<class FString>                         K2Node_Select_Default_1;                           // 0x02B0(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x02C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C6[0x2];                                      // 0x02C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_2;                           // 0x02C8(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_6;          // 0x02E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_5;                  // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_QuickPlayPreferences_C_FillTagFilters) == 0x000008, "Wrong alignment on W_QuickPlayPreferences_C_FillTagFilters");
static_assert(sizeof(W_QuickPlayPreferences_C_FillTagFilters) == 0x000300, "Wrong size on W_QuickPlayPreferences_C_FillTagFilters");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, MapRotationOptions) == 0x000000, "Member 'W_QuickPlayPreferences_C_FillTagFilters::MapRotationOptions' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, ExperienceOptions) == 0x000010, "Member 'W_QuickPlayPreferences_C_FillTagFilters::ExperienceOptions' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, DummyMap) == 0x000020, "Member 'W_QuickPlayPreferences_C_FillTagFilters::DummyMap' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, PlaystyleOptions) == 0x000070, "Member 'W_QuickPlayPreferences_C_FillTagFilters::PlaystyleOptions' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, LanguageTags) == 0x000080, "Member 'W_QuickPlayPreferences_C_FillTagFilters::LanguageTags' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, Temp_int_Array_Index_Variable) == 0x000090, "Member 'W_QuickPlayPreferences_C_FillTagFilters::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, Temp_int_Loop_Counter_Variable) == 0x000094, "Member 'W_QuickPlayPreferences_C_FillTagFilters::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, CallFunc_Add_IntInt_ReturnValue) == 0x000098, "Member 'W_QuickPlayPreferences_C_FillTagFilters::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, K2Node_CreateDelegate_OutputDelegate) == 0x00009C, "Member 'W_QuickPlayPreferences_C_FillTagFilters::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, CallFunc_Conv_TextToString_ReturnValue) == 0x0000B0, "Member 'W_QuickPlayPreferences_C_FillTagFilters::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, CallFunc_Conv_TextToString_ReturnValue_1) == 0x0000C0, "Member 'W_QuickPlayPreferences_C_FillTagFilters::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, Temp_bool_Variable) == 0x0000D0, "Member 'W_QuickPlayPreferences_C_FillTagFilters::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, CallFunc_Array_Get_Item) == 0x0000D8, "Member 'W_QuickPlayPreferences_C_FillTagFilters::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, CallFunc_Array_Get_Item_1) == 0x0000F0, "Member 'W_QuickPlayPreferences_C_FillTagFilters::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, CallFunc_Conv_TextToString_ReturnValue_2) == 0x000108, "Member 'W_QuickPlayPreferences_C_FillTagFilters::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, CallFunc_Conv_TextToString_ReturnValue_3) == 0x000118, "Member 'W_QuickPlayPreferences_C_FillTagFilters::CallFunc_Conv_TextToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, K2Node_MakeArray_Array) == 0x000128, "Member 'W_QuickPlayPreferences_C_FillTagFilters::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, CallFunc_Create_ReturnValue) == 0x000138, "Member 'W_QuickPlayPreferences_C_FillTagFilters::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, Temp_string_Variable) == 0x000140, "Member 'W_QuickPlayPreferences_C_FillTagFilters::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, Temp_string_Variable_1) == 0x000150, "Member 'W_QuickPlayPreferences_C_FillTagFilters::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, Temp_string_Variable_2) == 0x000160, "Member 'W_QuickPlayPreferences_C_FillTagFilters::Temp_string_Variable_2' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, Temp_string_Variable_3) == 0x000170, "Member 'W_QuickPlayPreferences_C_FillTagFilters::Temp_string_Variable_3' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, Temp_byte_Variable) == 0x000180, "Member 'W_QuickPlayPreferences_C_FillTagFilters::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000188, "Member 'W_QuickPlayPreferences_C_FillTagFilters::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, CallFunc_Conv_TextToString_ReturnValue_4) == 0x000190, "Member 'W_QuickPlayPreferences_C_FillTagFilters::CallFunc_Conv_TextToString_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, Temp_name_Variable) == 0x0001A0, "Member 'W_QuickPlayPreferences_C_FillTagFilters::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, CallFunc_Array_Add_ReturnValue) == 0x0001B0, "Member 'W_QuickPlayPreferences_C_FillTagFilters::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, CallFunc_Array_Add_ReturnValue_1) == 0x0001B4, "Member 'W_QuickPlayPreferences_C_FillTagFilters::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, CallFunc_Array_Add_ReturnValue_2) == 0x0001B8, "Member 'W_QuickPlayPreferences_C_FillTagFilters::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, CallFunc_Array_Add_ReturnValue_3) == 0x0001BC, "Member 'W_QuickPlayPreferences_C_FillTagFilters::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, Temp_name_Variable_1) == 0x0001C0, "Member 'W_QuickPlayPreferences_C_FillTagFilters::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, Temp_name_Variable_2) == 0x0001D0, "Member 'W_QuickPlayPreferences_C_FillTagFilters::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, Temp_name_Variable_3) == 0x0001E0, "Member 'W_QuickPlayPreferences_C_FillTagFilters::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, Temp_name_Variable_4) == 0x0001F0, "Member 'W_QuickPlayPreferences_C_FillTagFilters::Temp_name_Variable_4' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, Temp_byte_Variable_1) == 0x000200, "Member 'W_QuickPlayPreferences_C_FillTagFilters::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000208, "Member 'W_QuickPlayPreferences_C_FillTagFilters::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, CallFunc_Array_Length_ReturnValue) == 0x000218, "Member 'W_QuickPlayPreferences_C_FillTagFilters::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, CallFunc_Array_Get_Item_2) == 0x00021C, "Member 'W_QuickPlayPreferences_C_FillTagFilters::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, CallFunc_Less_IntInt_ReturnValue) == 0x000224, "Member 'W_QuickPlayPreferences_C_FillTagFilters::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, CallFunc_GetDataTableRowFromName_OutRow) == 0x000228, "Member 'W_QuickPlayPreferences_C_FillTagFilters::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000280, "Member 'W_QuickPlayPreferences_C_FillTagFilters::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, CallFunc_Conv_TextToString_ReturnValue_5) == 0x000288, "Member 'W_QuickPlayPreferences_C_FillTagFilters::CallFunc_Conv_TextToString_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000298, "Member 'W_QuickPlayPreferences_C_FillTagFilters::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, K2Node_Select_Default) == 0x0002A0, "Member 'W_QuickPlayPreferences_C_FillTagFilters::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, K2Node_Select_Default_1) == 0x0002B0, "Member 'W_QuickPlayPreferences_C_FillTagFilters::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, CallFunc_Array_Add_ReturnValue_4) == 0x0002C0, "Member 'W_QuickPlayPreferences_C_FillTagFilters::CallFunc_Array_Add_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0002C4, "Member 'W_QuickPlayPreferences_C_FillTagFilters::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, CallFunc_TextIsEmpty_ReturnValue) == 0x0002C5, "Member 'W_QuickPlayPreferences_C_FillTagFilters::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, K2Node_Select_Default_2) == 0x0002C8, "Member 'W_QuickPlayPreferences_C_FillTagFilters::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, CallFunc_Conv_TextToString_ReturnValue_6) == 0x0002E0, "Member 'W_QuickPlayPreferences_C_FillTagFilters::CallFunc_Conv_TextToString_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, CallFunc_Conv_StringToName_ReturnValue) == 0x0002F0, "Member 'W_QuickPlayPreferences_C_FillTagFilters::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayPreferences_C_FillTagFilters, CallFunc_Array_Add_ReturnValue_5) == 0x0002F8, "Member 'W_QuickPlayPreferences_C_FillTagFilters::CallFunc_Array_Add_ReturnValue_5' has a wrong offset!");

// Function W_QuickPlayPreferences.W_QuickPlayPreferences_C.UpdateFromUserSettings
// 0x0268 (0x0268 - 0x0000)
struct W_QuickPlayPreferences_C_UpdateFromUserSettings final
{
public:
	class USQQuickPlaySearch*                     QPObject;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, class USettingsItem_TickBox_C*> TagMapping;                                        // 0x0008(0x0050)(Edit, BlueprintVisible, ContainsInstancedReference)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable_1;        // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable_2;        // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable_3;        // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AE[0x2];                                       // 0x00AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
