#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_QuickPlayResults

#include "Basic.hpp"

#include "PlayFab_structs.hpp"
#include "OnlineSubsystemUtils_structs.hpp"


namespace SDK::Params
{

// Function W_QuickPlayResults.W_QuickPlayResults_C.ExecuteUbergraph_W_QuickPlayResults
// 0x0004 (0x0004 - 0x0000)
struct W_QuickPlayResults_C_ExecuteUbergraph_W_QuickPlayResults final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_QuickPlayResults_C_ExecuteUbergraph_W_QuickPlayResults) == 0x000004, "Wrong alignment on W_QuickPlayResults_C_ExecuteUbergraph_W_QuickPlayResults");
static_assert(sizeof(W_QuickPlayResults_C_ExecuteUbergraph_W_QuickPlayResults) == 0x000004, "Wrong size on W_QuickPlayResults_C_ExecuteUbergraph_W_QuickPlayResults");
static_assert(offsetof(W_QuickPlayResults_C_ExecuteUbergraph_W_QuickPlayResults, EntryPoint) == 0x000000, "Member 'W_QuickPlayResults_C_ExecuteUbergraph_W_QuickPlayResults::EntryPoint' has a wrong offset!");

// Function W_QuickPlayResults.W_QuickPlayResults_C.UpdateServers
// 0x0068 (0x0068 - 0x0000)
struct W_QuickPlayResults_C_UpdateServers final
{
public:
	TArray<struct FBlueprintSessionResult>        Servers;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          SearchFinished;                                    // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USQSessionInfo*                         CallFunc_SpawnObject_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USQSessionInfo*                         CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue_1;         // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetSession_ReturnValue;                   // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F[0x1];                                       // 0x003F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UServerDetails_C*>               K2Node_MakeArray_Array;                            // 0x0040(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UServerDetails_C*                       CallFunc_Array_Get_Item_1;                         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_QuickPlayResults_C_UpdateServers) == 0x000008, "Wrong alignment on W_QuickPlayResults_C_UpdateServers");
static_assert(sizeof(W_QuickPlayResults_C_UpdateServers) == 0x000068, "Wrong size on W_QuickPlayResults_C_UpdateServers");
static_assert(offsetof(W_QuickPlayResults_C_UpdateServers, Servers) == 0x000000, "Member 'W_QuickPlayResults_C_UpdateServers::Servers' has a wrong offset!");
static_assert(offsetof(W_QuickPlayResults_C_UpdateServers, SearchFinished) == 0x000010, "Member 'W_QuickPlayResults_C_UpdateServers::SearchFinished' has a wrong offset!");
static_assert(offsetof(W_QuickPlayResults_C_UpdateServers, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'W_QuickPlayResults_C_UpdateServers::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(W_QuickPlayResults_C_UpdateServers, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'W_QuickPlayResults_C_UpdateServers::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayResults_C_UpdateServers, CallFunc_SelectInt_ReturnValue) == 0x00001C, "Member 'W_QuickPlayResults_C_UpdateServers::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayResults_C_UpdateServers, Temp_int_Array_Index_Variable) == 0x000020, "Member 'W_QuickPlayResults_C_UpdateServers::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(W_QuickPlayResults_C_UpdateServers, CallFunc_SpawnObject_ReturnValue) == 0x000028, "Member 'W_QuickPlayResults_C_UpdateServers::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayResults_C_UpdateServers, CallFunc_Array_Get_Item) == 0x000030, "Member 'W_QuickPlayResults_C_UpdateServers::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_QuickPlayResults_C_UpdateServers, CallFunc_Array_Add_ReturnValue) == 0x000038, "Member 'W_QuickPlayResults_C_UpdateServers::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayResults_C_UpdateServers, CallFunc_Array_IsValidIndex_ReturnValue) == 0x00003C, "Member 'W_QuickPlayResults_C_UpdateServers::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayResults_C_UpdateServers, CallFunc_Array_IsValidIndex_ReturnValue_1) == 0x00003D, "Member 'W_QuickPlayResults_C_UpdateServers::CallFunc_Array_IsValidIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_QuickPlayResults_C_UpdateServers, CallFunc_SetSession_ReturnValue) == 0x00003E, "Member 'W_QuickPlayResults_C_UpdateServers::CallFunc_SetSession_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayResults_C_UpdateServers, K2Node_MakeArray_Array) == 0x000040, "Member 'W_QuickPlayResults_C_UpdateServers::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_QuickPlayResults_C_UpdateServers, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'W_QuickPlayResults_C_UpdateServers::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayResults_C_UpdateServers, CallFunc_Array_Get_Item_1) == 0x000058, "Member 'W_QuickPlayResults_C_UpdateServers::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(W_QuickPlayResults_C_UpdateServers, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'W_QuickPlayResults_C_UpdateServers::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function W_QuickPlayResults.W_QuickPlayResults_C.PresentSingleResult
// 0x0120 (0x0120 - 0x0000)
struct W_QuickPlayResults_C_PresentSingleResult final
{
public:
	struct FBlueprintSessionResult                Session;                                           // 0x0000(0x0108)(BlueprintVisible, BlueprintReadOnly, Parm)
	class USQSessionInfo*                         CallFunc_SpawnObject_ReturnValue;                  // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USQSessionInfo*                         CallFunc_Array_Get_Item;                           // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetSession_ReturnValue;                   // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(W_QuickPlayResults_C_PresentSingleResult) == 0x000008, "Wrong alignment on W_QuickPlayResults_C_PresentSingleResult");
static_assert(sizeof(W_QuickPlayResults_C_PresentSingleResult) == 0x000120, "Wrong size on W_QuickPlayResults_C_PresentSingleResult");
static_assert(offsetof(W_QuickPlayResults_C_PresentSingleResult, Session) == 0x000000, "Member 'W_QuickPlayResults_C_PresentSingleResult::Session' has a wrong offset!");
static_assert(offsetof(W_QuickPlayResults_C_PresentSingleResult, CallFunc_SpawnObject_ReturnValue) == 0x000108, "Member 'W_QuickPlayResults_C_PresentSingleResult::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayResults_C_PresentSingleResult, CallFunc_Array_Get_Item) == 0x000110, "Member 'W_QuickPlayResults_C_PresentSingleResult::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(W_QuickPlayResults_C_PresentSingleResult, CallFunc_Array_Add_ReturnValue) == 0x000118, "Member 'W_QuickPlayResults_C_PresentSingleResult::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayResults_C_PresentSingleResult, CallFunc_SetSession_ReturnValue) == 0x00011C, "Member 'W_QuickPlayResults_C_PresentSingleResult::CallFunc_SetSession_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_QuickPlayResults_C_PresentSingleResult, CallFunc_Array_IsValidIndex_ReturnValue) == 0x00011D, "Member 'W_QuickPlayResults_C_PresentSingleResult::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function W_QuickPlayResults.W_QuickPlayResults_C.JoinToSingleResult
// 0x0008 (0x0008 - 0x0000)
struct W_QuickPlayResults_C_JoinToSingleResult final
{
public:
	class UServerBrowserWindow_C*                 CallFunc_GetBrowserWindow_Browser;                 // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_QuickPlayResults_C_JoinToSingleResult) == 0x000008, "Wrong alignment on W_QuickPlayResults_C_JoinToSingleResult");
static_assert(sizeof(W_QuickPlayResults_C_JoinToSingleResult) == 0x000008, "Wrong size on W_QuickPlayResults_C_JoinToSingleResult");
static_assert(offsetof(W_QuickPlayResults_C_JoinToSingleResult, CallFunc_GetBrowserWindow_Browser) == 0x000000, "Member 'W_QuickPlayResults_C_JoinToSingleResult::CallFunc_GetBrowserWindow_Browser' has a wrong offset!");

// Function W_QuickPlayResults.W_QuickPlayResults_C.AnaliticsSent
// 0x0020 (0x0020 - 0x0000)
struct W_QuickPlayResults_C_AnaliticsSent final
{
public:
	struct FClientWriteEventResponse              Result;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                CustomData;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_QuickPlayResults_C_AnaliticsSent) == 0x000008, "Wrong alignment on W_QuickPlayResults_C_AnaliticsSent");
static_assert(sizeof(W_QuickPlayResults_C_AnaliticsSent) == 0x000020, "Wrong size on W_QuickPlayResults_C_AnaliticsSent");
static_assert(offsetof(W_QuickPlayResults_C_AnaliticsSent, Result) == 0x000000, "Member 'W_QuickPlayResults_C_AnaliticsSent::Result' has a wrong offset!");
static_assert(offsetof(W_QuickPlayResults_C_AnaliticsSent, CustomData) == 0x000018, "Member 'W_QuickPlayResults_C_AnaliticsSent::CustomData' has a wrong offset!");

// Function W_QuickPlayResults.W_QuickPlayResults_C.AnaliticsFailed
// 0x0040 (0x0040 - 0x0000)
struct W_QuickPlayResults_C_AnaliticsFailed final
{
public:
	struct FPlayFabError                          Error;                                             // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                CustomData;                                        // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_QuickPlayResults_C_AnaliticsFailed) == 0x000008, "Wrong alignment on W_QuickPlayResults_C_AnaliticsFailed");
static_assert(sizeof(W_QuickPlayResults_C_AnaliticsFailed) == 0x000040, "Wrong size on W_QuickPlayResults_C_AnaliticsFailed");
static_assert(offsetof(W_QuickPlayResults_C_AnaliticsFailed, Error) == 0x000000, "Member 'W_QuickPlayResults_C_AnaliticsFailed::Error' has a wrong offset!");
static_assert(offsetof(W_QuickPlayResults_C_AnaliticsFailed, CustomData) == 0x000038, "Member 'W_QuickPlayResults_C_AnaliticsFailed::CustomData' has a wrong offset!");

// Function W_QuickPlayResults.W_QuickPlayResults_C.SetMainMenuRef
// 0x0008 (0x0008 - 0x0000)
struct W_QuickPlayResults_C_SetMainMenuRef final
{
public:
	class UMainMenuScreen_C*                      MainMenu;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_QuickPlayResults_C_SetMainMenuRef) == 0x000008, "Wrong alignment on W_QuickPlayResults_C_SetMainMenuRef");
static_assert(sizeof(W_QuickPlayResults_C_SetMainMenuRef) == 0x000008, "Wrong size on W_QuickPlayResults_C_SetMainMenuRef");
static_assert(offsetof(W_QuickPlayResults_C_SetMainMenuRef, MainMenu) == 0x000000, "Member 'W_QuickPlayResults_C_SetMainMenuRef::MainMenu' has a wrong offset!");

}

