#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_ServerInfo

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function W_ServerInfo.W_ServerInfo_C.ExecuteUbergraph_W_ServerInfo
// 0x0020 (0x0020 - 0x0000)
struct W_ServerInfo_C_ExecuteUbergraph_W_ServerInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ServerInfo_C_ExecuteUbergraph_W_ServerInfo) == 0x000008, "Wrong alignment on W_ServerInfo_C_ExecuteUbergraph_W_ServerInfo");
static_assert(sizeof(W_ServerInfo_C_ExecuteUbergraph_W_ServerInfo) == 0x000020, "Wrong size on W_ServerInfo_C_ExecuteUbergraph_W_ServerInfo");
static_assert(offsetof(W_ServerInfo_C_ExecuteUbergraph_W_ServerInfo, EntryPoint) == 0x000000, "Member 'W_ServerInfo_C_ExecuteUbergraph_W_ServerInfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(W_ServerInfo_C_ExecuteUbergraph_W_ServerInfo, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'W_ServerInfo_C_ExecuteUbergraph_W_ServerInfo::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(W_ServerInfo_C_ExecuteUbergraph_W_ServerInfo, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'W_ServerInfo_C_ExecuteUbergraph_W_ServerInfo::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

// Function W_ServerInfo.W_ServerInfo_C.UpdateData
// 0x0218 (0x0218 - 0x0000)
struct W_ServerInfo_C_UpdateData final
{
public:
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USQGameUserSettings*                    CallFunc_GetSquadGameUserSettings_ReturnValue;     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetStreamerModeEnabledForLevel_ReturnValue; // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USQGameUserSettings*                    CallFunc_GetSquadGameUserSettings_ReturnValue_1;   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetStreamerModeEnabledForLevel_ReturnValue_1; // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53[0x1];                                       // 0x0053(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetServerHealthValues_ServerHealthLow;    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetServerHealthValues_ServerHealthHigh;   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASQGameState*                           CallFunc_GetSquadGameState_Return_Value;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0068(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0088(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00C8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0108(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0118(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0130(0x0018)()
	bool                                          Temp_bool_Variable_2;                              // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x014A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14B[0x5];                                      // 0x014B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0150(0x0018)()
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0168(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0178(0x0040)(HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x01B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x01C8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x01D8(0x0018)()
	class ASQGameState*                           CallFunc_GetSquadGameState_Return_Value_1;         // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PlayerController_C*                 K2Node_DynamicCast_AsBP_Player_Controller;         // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDev_ReturnValue;                        // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAdmin_ReturnValue;                      // 0x0212(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsQA_ReturnValue;                         // 0x0213(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0215(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0216(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(W_ServerInfo_C_UpdateData) == 0x000008, "Wrong alignment on W_ServerInfo_C_UpdateData");
static_assert(sizeof(W_ServerInfo_C_UpdateData) == 0x000218, "Wrong size on W_ServerInfo_C_UpdateData");
static_assert(offsetof(W_ServerInfo_C_UpdateData, Temp_struct_Variable) == 0x000000, "Member 'W_ServerInfo_C_UpdateData::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(W_ServerInfo_C_UpdateData, Temp_bool_Variable) == 0x000010, "Member 'W_ServerInfo_C_UpdateData::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(W_ServerInfo_C_UpdateData, Temp_struct_Variable_1) == 0x000014, "Member 'W_ServerInfo_C_UpdateData::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(W_ServerInfo_C_UpdateData, Temp_struct_Variable_2) == 0x000024, "Member 'W_ServerInfo_C_UpdateData::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(W_ServerInfo_C_UpdateData, Temp_bool_Variable_1) == 0x000034, "Member 'W_ServerInfo_C_UpdateData::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(W_ServerInfo_C_UpdateData, CallFunc_GetSquadGameUserSettings_ReturnValue) == 0x000038, "Member 'W_ServerInfo_C_UpdateData::CallFunc_GetSquadGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ServerInfo_C_UpdateData, CallFunc_GetStreamerModeEnabledForLevel_ReturnValue) == 0x000040, "Member 'W_ServerInfo_C_UpdateData::CallFunc_GetStreamerModeEnabledForLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ServerInfo_C_UpdateData, Temp_byte_Variable) == 0x000041, "Member 'W_ServerInfo_C_UpdateData::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(W_ServerInfo_C_UpdateData, CallFunc_GetSquadGameUserSettings_ReturnValue_1) == 0x000048, "Member 'W_ServerInfo_C_UpdateData::CallFunc_GetSquadGameUserSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ServerInfo_C_UpdateData, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'W_ServerInfo_C_UpdateData::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ServerInfo_C_UpdateData, CallFunc_GetStreamerModeEnabledForLevel_ReturnValue_1) == 0x000051, "Member 'W_ServerInfo_C_UpdateData::CallFunc_GetStreamerModeEnabledForLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ServerInfo_C_UpdateData, Temp_byte_Variable_1) == 0x000052, "Member 'W_ServerInfo_C_UpdateData::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(W_ServerInfo_C_UpdateData, CallFunc_GetServerHealthValues_ServerHealthLow) == 0x000054, "Member 'W_ServerInfo_C_UpdateData::CallFunc_GetServerHealthValues_ServerHealthLow' has a wrong offset!");
static_assert(offsetof(W_ServerInfo_C_UpdateData, CallFunc_GetServerHealthValues_ServerHealthHigh) == 0x000058, "Member 'W_ServerInfo_C_UpdateData::CallFunc_GetServerHealthValues_ServerHealthHigh' has a wrong offset!");
static_assert(offsetof(W_ServerInfo_C_UpdateData, CallFunc_GetSquadGameState_Return_Value) == 0x000060, "Member 'W_ServerInfo_C_UpdateData::CallFunc_GetSquadGameState_Return_Value' has a wrong offset!");
static_assert(offsetof(W_ServerInfo_C_UpdateData, CallFunc_Conv_StringToText_ReturnValue) == 0x000068, "Member 'W_ServerInfo_C_UpdateData::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ServerInfo_C_UpdateData, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'W_ServerInfo_C_UpdateData::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ServerInfo_C_UpdateData, K2Node_MakeStruct_FormatArgumentData) == 0x000088, "Member 'W_ServerInfo_C_UpdateData::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(W_ServerInfo_C_UpdateData, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000C8, "Member 'W_ServerInfo_C_UpdateData::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(W_ServerInfo_C_UpdateData, K2Node_MakeArray_Array) == 0x000108, "Member 'W_ServerInfo_C_UpdateData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(W_ServerInfo_C_UpdateData, CallFunc_Format_ReturnValue) == 0x000118, "Member 'W_ServerInfo_C_UpdateData::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ServerInfo_C_UpdateData, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000130, "Member 'W_ServerInfo_C_UpdateData::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ServerInfo_C_UpdateData, Temp_bool_Variable_2) == 0x000148, "Member 'W_ServerInfo_C_UpdateData::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(W_ServerInfo_C_UpdateData, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000149, "Member 'W_ServerInfo_C_UpdateData::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ServerInfo_C_UpdateData, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x00014A, "Member 'W_ServerInfo_C_UpdateData::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ServerInfo_C_UpdateData, CallFunc_Conv_FloatToText_ReturnValue) == 0x000150, "Member 'W_ServerInfo_C_UpdateData::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ServerInfo_C_UpdateData, K2Node_Select_Default) == 0x000168, "Member 'W_ServerInfo_C_UpdateData::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(W_ServerInfo_C_UpdateData, K2Node_MakeStruct_FormatArgumentData_2) == 0x000178, "Member 'W_ServerInfo_C_UpdateData::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(W_ServerInfo_C_UpdateData, K2Node_Select_Default_1) == 0x0001B8, "Member 'W_ServerInfo_C_UpdateData::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(W_ServerInfo_C_UpdateData, K2Node_MakeArray_Array_1) == 0x0001C8, "Member 'W_ServerInfo_C_UpdateData::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(W_ServerInfo_C_UpdateData, CallFunc_Format_ReturnValue_1) == 0x0001D8, "Member 'W_ServerInfo_C_UpdateData::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ServerInfo_C_UpdateData, CallFunc_GetSquadGameState_Return_Value_1) == 0x0001F0, "Member 'W_ServerInfo_C_UpdateData::CallFunc_GetSquadGameState_Return_Value_1' has a wrong offset!");
static_assert(offsetof(W_ServerInfo_C_UpdateData, CallFunc_IsValid_ReturnValue_1) == 0x0001F8, "Member 'W_ServerInfo_C_UpdateData::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ServerInfo_C_UpdateData, CallFunc_GetOwningPlayer_ReturnValue) == 0x000200, "Member 'W_ServerInfo_C_UpdateData::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ServerInfo_C_UpdateData, K2Node_DynamicCast_AsBP_Player_Controller) == 0x000208, "Member 'W_ServerInfo_C_UpdateData::K2Node_DynamicCast_AsBP_Player_Controller' has a wrong offset!");
static_assert(offsetof(W_ServerInfo_C_UpdateData, K2Node_DynamicCast_bSuccess) == 0x000210, "Member 'W_ServerInfo_C_UpdateData::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(W_ServerInfo_C_UpdateData, CallFunc_IsDev_ReturnValue) == 0x000211, "Member 'W_ServerInfo_C_UpdateData::CallFunc_IsDev_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ServerInfo_C_UpdateData, CallFunc_IsAdmin_ReturnValue) == 0x000212, "Member 'W_ServerInfo_C_UpdateData::CallFunc_IsAdmin_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ServerInfo_C_UpdateData, CallFunc_IsQA_ReturnValue) == 0x000213, "Member 'W_ServerInfo_C_UpdateData::CallFunc_IsQA_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ServerInfo_C_UpdateData, CallFunc_BooleanOR_ReturnValue) == 0x000214, "Member 'W_ServerInfo_C_UpdateData::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(W_ServerInfo_C_UpdateData, CallFunc_BooleanOR_ReturnValue_1) == 0x000215, "Member 'W_ServerInfo_C_UpdateData::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(W_ServerInfo_C_UpdateData, K2Node_Select_Default_2) == 0x000216, "Member 'W_ServerInfo_C_UpdateData::K2Node_Select_Default_2' has a wrong offset!");

}

