#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_SquadIndexMarker

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_SquadIndexMarker.W_SquadIndexMarker_C
// 0x0020 (0x0280 - 0x0260)
class UW_SquadIndexMarker_C final : public UUserWidget
{
public:
	class UImage*                                 BPSquadColorImage;                                 // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             BPSquadNumberText;                                 // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               MainSB;                                            // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               SquadColorOverlay;                                 // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Update(const class FText& NewSquadText);
	void GetWidth(float* Width);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_SquadIndexMarker_C">();
	}
	static class UW_SquadIndexMarker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_SquadIndexMarker_C>();
	}
};
static_assert(alignof(UW_SquadIndexMarker_C) == 0x000008, "Wrong alignment on UW_SquadIndexMarker_C");
static_assert(sizeof(UW_SquadIndexMarker_C) == 0x000280, "Wrong size on UW_SquadIndexMarker_C");
static_assert(offsetof(UW_SquadIndexMarker_C, BPSquadColorImage) == 0x000260, "Member 'UW_SquadIndexMarker_C::BPSquadColorImage' has a wrong offset!");
static_assert(offsetof(UW_SquadIndexMarker_C, BPSquadNumberText) == 0x000268, "Member 'UW_SquadIndexMarker_C::BPSquadNumberText' has a wrong offset!");
static_assert(offsetof(UW_SquadIndexMarker_C, MainSB) == 0x000270, "Member 'UW_SquadIndexMarker_C::MainSB' has a wrong offset!");
static_assert(offsetof(UW_SquadIndexMarker_C, SquadColorOverlay) == 0x000278, "Member 'UW_SquadIndexMarker_C::SquadColorOverlay' has a wrong offset!");

}

