#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_TicketDetailsCategory_Logistics

#include "Basic.hpp"

#include "W_TicketDetailsCategory_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_TicketDetailsCategory_Logistics.W_TicketDetailsCategory_Logistics_C
// 0x0018 (0x0398 - 0x0380)
class UW_TicketDetailsCategory_Logistics_C final : public UW_TicketDetailsCategory_C
{
public:
	class UW_TicketDetailRecord_C*                FobCreatedRecord;                                  // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_TicketDetailRecord_C*                AmmoRecord;                                        // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UW_TicketDetailRecord_C*                ConstructionRecord;                                // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddRow(struct FSQTicketsSummaryRecord& Fob, int32& Ammo, int32& Construction);
	void GetMaxValues(int32* Units, int32* UnitTickets, int32* Score);
	void UpdateProgressBar(int32& MaxScore);
	void FillEmptyRecords(class UUMG_Tooltip_C* Tooltip);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"W_TicketDetailsCategory_Logistics_C">();
	}
	static class UW_TicketDetailsCategory_Logistics_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_TicketDetailsCategory_Logistics_C>();
	}
};
static_assert(alignof(UW_TicketDetailsCategory_Logistics_C) == 0x000008, "Wrong alignment on UW_TicketDetailsCategory_Logistics_C");
static_assert(sizeof(UW_TicketDetailsCategory_Logistics_C) == 0x000398, "Wrong size on UW_TicketDetailsCategory_Logistics_C");
static_assert(offsetof(UW_TicketDetailsCategory_Logistics_C, FobCreatedRecord) == 0x000380, "Member 'UW_TicketDetailsCategory_Logistics_C::FobCreatedRecord' has a wrong offset!");
static_assert(offsetof(UW_TicketDetailsCategory_Logistics_C, AmmoRecord) == 0x000388, "Member 'UW_TicketDetailsCategory_Logistics_C::AmmoRecord' has a wrong offset!");
static_assert(offsetof(UW_TicketDetailsCategory_Logistics_C, ConstructionRecord) == 0x000390, "Member 'UW_TicketDetailsCategory_Logistics_C::ConstructionRecord' has a wrong offset!");

}

